[
    {
        "id": 1785,
        "owner": [],
        "entity_id": "2023",
        "entity_id_full": "sse/skill/2023",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a skill called \"Definition Schnittstelle\" with the ID 2023. The skill has no parent skills and no nested skills. The skill was created on 2023-11-20T07:51:13.181Z and last updated on 2023-11-20T07:51:13.181Z. The level of the skill is 1 and it has no description.",
        "created_at": "2023-11-13T14:23:11.272Z",
        "updated_at": "2023-11-20T07:51:13.181Z"
    },
    {
        "id": 1810,
        "owner": [],
        "entity_id": "2048",
        "entity_id_full": "sse/skill/2048",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill, including the skill's id, name, level, description, and when it was created and updated. The skill also has a list of nested skills and a list of parent skills.",
        "created_at": "2023-11-13T14:23:11.294Z",
        "updated_at": "2023-11-20T07:51:13.203Z"
    },
    {
        "id": 1904,
        "owner": [],
        "entity_id": "2162",
        "entity_id_full": "sse/skill/2162",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes information on a skill called \"Entwicklung von Sensoren\" which is a part of the parent skill \"Sensorik.\" The skill has a level of 1 and was created on November 20, 2023. There is no description available for the skill.",
        "created_at": "2023-11-13T14:23:11.360Z",
        "updated_at": "2023-11-20T07:51:13.267Z"
    },
    {
        "id": 1936,
        "owner": [],
        "entity_id": "2169",
        "entity_id_full": "sse/skill/2169",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill, including the skill's id, name, level, description, and when it was created and updated. The skill may also have certain parent skills and nested skills associated with it.",
        "created_at": "2023-11-13T14:23:11.364Z",
        "updated_at": "2023-11-20T07:51:13.269Z"
    },
    {
        "id": 1738,
        "owner": [],
        "entity_id": "16",
        "entity_id_full": "sse/skill/16",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a class called \"Program Structure II.\" The class has an ID of 16, and is part of a repository with an ID of 1. The class was created on November 20, 2023, and last updated on the same day. The class has a Level 2 difficulty, and its description is \"Knowing how to add own code into a template.\" The dictionary does not contain any information about skills required or recommended for the class.",
        "created_at": "2023-11-13T14:23:09.828Z",
        "updated_at": "2023-11-20T07:51:11.487Z"
    },
    {
        "id": 1734,
        "owner": [],
        "entity_id": "1",
        "entity_id_full": "sse/skill/1",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 1\n- nested_skills: []\n- parent_skills: ['Commands Usage']\n- repository_id: 1\n- created_at: 2023-11-20T07:51:10.956Z\n- updated_at: 2023-11-20T07:51:10.956Z\n- name: Compiler Calling\n- level: 1\n- description: Calling javac, wo/ knowing what it exactly does\n\nThe id key is the unique identifier for the skill and the value is 1. The nested_skills key is an empty list which indicates that this skill does not have any nested skills. The parent_skills key contains a list of skills that are required in order to learn this skill. In this case, the parent skill is 'Commands Usage'. The repository_id key indicates which repository this skill belongs to and the value is 1. The created_at and updated_at keys contain the date and time when the skill was created and last updated. The name key contains the name of the skill and the level key indicates what level the skill is. The description key contains a short description",
        "created_at": "2023-11-13T14:23:09.333Z",
        "updated_at": "2023-11-20T07:51:10.956Z"
    },
    {
        "id": 1737,
        "owner": [],
        "entity_id": "15",
        "entity_id_full": "sse/skill/15",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, and repository_id. The id key has a value of 15, nested_skills has an empty list as its value, parent_skills also has an empty list as its value, and repository_id has a value of 1. The created_at and updated_at keys are both timestamps showing when the skill was created and last updated. The name key has a value of \"Program Structure I\" and the level key has a value of 1. The description key has a value of \"Knowing how to add own code into a template\".",
        "created_at": "2023-11-13T14:23:09.827Z",
        "updated_at": "2023-11-20T07:51:11.486Z"
    },
    {
        "id": 1735,
        "owner": [],
        "entity_id": "2",
        "entity_id_full": "sse/skill/2",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 2\n- nested_skills: []\n- parent_skills: ['Commands Usage']\n- repository_id: 1\n- created_at: 2023-11-20T07:51:10.956Z\n- updated_at: 2023-11-20T07:51:10.956Z\n- name: Interpreter Calling\n- level: 1\n- description: Calling java, wo/ knowing what it exactly does.\n\nThe id key represents the unique identifier for this skill. The nested_skills key represents any skills that are subordinate to this skill. The parent_skills key represents any skills that this skill is subordinate to. The repository_id key represents the unique identifier for the repository that this skill belongs to. The created_at key represents the date and time when this skill was created. The updated_at key represents the date and time when this skill was last updated. The name key represents the name of this skill. The level key represents the level of this skill. The description key represents the description of this skill.",
        "created_at": "2023-11-13T14:23:09.326Z",
        "updated_at": "2023-11-20T07:51:10.956Z"
    },
    {
        "id": 1727,
        "owner": [],
        "entity_id": "3",
        "entity_id_full": "sse/skill/3",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Compiler Usage.\" The skill has an id of 3, is a level 3 skill, and has the description \"Knowing how & why to use javac.\" The skill is associated with the repository with an id of 1. The skill was created on 2023-11-20T07:51:10.956Z and was last updated on 2023-11-20T07:51:10.956Z. The skill has no nested skills associated with it, but it does have the parent skill \"Commands Understanding.\"",
        "created_at": "2023-11-13T14:23:09.326Z",
        "updated_at": "2023-11-20T07:51:10.956Z"
    },
    {
        "id": 1731,
        "owner": [],
        "entity_id": "5",
        "entity_id_full": "sse/skill/5",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary contains metadata about a particular skill. The 'id' field is the unique identifier for the skill, 'nested_skills' is a list of skills that are considered sub-skills of this one, 'parent_skills' is a list of skills of which this one is a sub-skill, 'repository_id' is the id of the repository in which this skill is found, 'created_at' and 'updated_at' are timestamps for when the skill was created and last updated, 'name' is the name of the skill, 'level' is the difficulty level of the skill, and 'description' is a brief description of the skill.",
        "created_at": "2023-11-13T14:23:09.328Z",
        "updated_at": "2023-11-20T07:51:10.958Z"
    },
    {
        "id": 1742,
        "owner": [],
        "entity_id": "9",
        "entity_id_full": "sse/skill/9",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"if-statement.\" The skill has an id of 9, is at level 3, and has a description of \"if wo/ else.\" The skill has no nested skills or parent skills. The skill was created on 2023-11-20T07:51:11.225Z and updated on 2023-11-20T07:51:11.225Z.",
        "created_at": "2023-11-13T14:23:09.599Z",
        "updated_at": "2023-11-20T07:51:11.225Z"
    },
    {
        "id": 1730,
        "owner": [],
        "entity_id": "6",
        "entity_id_full": "sse/skill/6",
        "entity_type": "skill",
        "contents": "\n\n\nThe \"id\" key is the unique identifier for this particular skill and its value is \"6\". The \"nested_skills\" key is an empty list because this skill has no sub-skills. The \"parent_skills\" key is a list containing the skill's parent skill, which is \"Expressions\". The \"repository_id\" key is the unique identifier for the repository that this skill belongs to and its value is \"1\". The \"created_at\" key is the date and time when this skill was created and its value is \"2023-11-20T07:51:11.211Z\". The \"updated_at\" key is the date and time when this skill was last updated and its value is \"2023-11-20T07:51:11.211Z\". The \"name\" key is the name of this skill and its value is \"Primitive Datatypes & Operators\". The \"level\" key is the difficulty level of this skill and its value is \"3\". The \"description\" key is a description of this skill and its value is an empty string.",
        "created_at": "2023-11-13T14:23:09.571Z",
        "updated_at": "2023-11-20T07:51:11.211Z"
    },
    {
        "id": 1753,
        "owner": [],
        "entity_id": "10",
        "entity_id_full": "sse/skill/10",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill, including the skill's id number, the date the skill was created and updated, the skill's name and description, the skill's level, and any skills that are either required to learn the skill (parent_skills) or that can be learned once the skill is mastered (nested_skills). In this particular dictionary, the skill is called \"else-statement\" and is at level 3. There are no skills listed as either required to learn it or that can be learned once it is mastered.",
        "created_at": "2023-11-13T14:23:09.638Z",
        "updated_at": "2023-11-20T07:51:11.234Z"
    },
    {
        "id": 1728,
        "owner": [],
        "entity_id": "11",
        "entity_id_full": "sse/skill/11",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs:\n- id: 11\n- nested_skills: []\n- parent_skills: ['if/else concept', 'Code Blocks']\n- repository_id: 1\n- created_at: 2023-11-20T07:51:11.482Z\n- updated_at: 2023-11-20T07:51:11.482Z\n- name: if-block\n- level: 3\n- description: Using curly brackets to nest more than 1 statement\n\nThe id is 11, the nested_skills are [], the parent_skills are ['if/else concept', 'Code Blocks'], the repository_id is 1, the created_at is 2023-11-20T07:51:11.482Z, the updated_at is 2023-11-20T07:51:11.482Z, the name is if-block, the level is 3, and the description is Using curly brackets to nest more than 1 statement.",
        "created_at": "2023-11-13T14:23:09.824Z",
        "updated_at": "2023-11-20T07:51:11.482Z"
    },
    {
        "id": 1739,
        "owner": [],
        "entity_id": "7",
        "entity_id_full": "sse/skill/7",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents a skill, 'Variables,' that belongs to a repository of skills. The skill has an id of 7, was created on 2023-11-20T07:51:11.221Z, and was last updated on 2023-11-20T07:51:11.221Z. The skill has a name of 'Variables,' a level of 3, and a description of 'Variable Usage in Expressions.' This skill does not have any nested skills, but does have a parent skill of 'Expressions.'",
        "created_at": "2023-11-13T14:23:09.591Z",
        "updated_at": "2023-11-20T07:51:11.221Z"
    },
    {
        "id": 1736,
        "owner": [],
        "entity_id": "14",
        "entity_id_full": "sse/skill/14",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n\n- The \"id\" key contains the value 14, which is the unique identifier for this particular skill.\n- The \"nested_skills\" key contains an empty list, which means that this skill does not have any skills nested within it.\n- The \"parent_skills\" key contains a list with a single element, \"switch/case concept\". This indicates that the \"switch/case advanced\" skill is a child skill of the \"switch/case concept\" skill.\n- The \"repository_id\" key contains the value 1, which indicates that this skill is part of repository 1.\n- The \"created_at\" key contains a timestamp indicating when this skill was created.\n- The \"updated_at\" key contains a timestamp indicating when this skill was last updated.\n- The \"name\" key contains the value \"switch/case advanced\", which is the name of this skill.\n- The \"level\" key contains the value 3, which is the level of this skill.\n- The \"description\" key contains the value \"falls through, expressions, strings\", which is a brief description of this skill.",
        "created_at": "2023-11-13T14:23:09.826Z",
        "updated_at": "2023-11-20T07:51:11.485Z"
    },
    {
        "id": 1740,
        "owner": [],
        "entity_id": "17",
        "entity_id_full": "sse/skill/17",
        "entity_type": "skill",
        "contents": "\n\n\n\nThe dictionary includes four key-value pairs. The first key is \"id\" and the value is 17. This is the id number of the skill. The second key is \"nested_skills\" and the value is an empty list. This means that there are no skills nested within this skill. The third key is \"parent_skills\" and the value is also an empty list. This means that this skill does not have any parent skills. The fourth key is \"repository_id\" and the value is 1. This is the id number of the repository that this skill belongs to.",
        "created_at": "2023-11-13T14:23:09.829Z",
        "updated_at": "2023-11-20T07:51:11.487Z"
    },
    {
        "id": 1768,
        "owner": [],
        "entity_id": "2004",
        "entity_id_full": "sse/skill/2004",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains data on a particular skill, including the skill's id, the id of the skill's repository, the skill's name, the skill's level, and a description of the skill. Additionally, the dictionary contains lists of the skill's nested skills and parent skills. The skill was created on 2023-11-20T07:51:12.480Z and updated on the same date and time.",
        "created_at": "2023-11-13T14:23:10.767Z",
        "updated_at": "2023-11-20T07:51:12.480Z"
    },
    {
        "id": 1732,
        "owner": [],
        "entity_id": "12",
        "entity_id_full": "sse/skill/12",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 12\n- nested_skills: []\n- parent_skills: ['if/else concept']\n- repository_id: 1\n- created_at: 2023-11-20T07:51:11.483Z\n- updated_at: 2023-11-20T07:51:11.483Z\n- name: if nesting\n- level: 3\n- description: Nest multiple if-statements\n\nThe id key contains the unique identifier for the skill, which is 12 in this case. The nested_skills key contains a list of skills that are nested under this skill. The parent_skills key contains a list of skills that this skill is a child of. In this case, the skill is a child of the 'if/else concept' skill. The repository_id key contains the id of the repository that this skill belongs to. The created_at and updated_at keys contain timestamps for when the skill was created and last updated. The name key contains the name of the skill, which is 'if nesting' in this case. The level key contains the level of the skill, which is",
        "created_at": "2023-11-13T14:23:09.825Z",
        "updated_at": "2023-11-20T07:51:11.483Z"
    },
    {
        "id": 1733,
        "owner": [],
        "entity_id": "13",
        "entity_id_full": "sse/skill/13",
        "entity_type": "skill",
        "contents": "\n\nThe following dictionary is a description of a repository of skills. The id is the unique identifier for the repository, the nested_skills is a list of skills that are contained within this repository, the parent_skills is a list of skills that this repository is a child of, the repository_id is the id of the repository that this skill is contained within, the created_at is the date that the repository was created, the updated_at is the date that the repository was last updated, the name is the name of the repository, the level is the level of difficulty of the repository, the description is a brief description of the repository.",
        "created_at": "2023-11-13T14:23:09.825Z",
        "updated_at": "2023-11-20T07:51:11.484Z"
    },
    {
        "id": 1741,
        "owner": [],
        "entity_id": "18",
        "entity_id_full": "sse/skill/18",
        "entity_type": "skill",
        "contents": "\n\nThe id key is the unique identifier for this particular skill and the value is the number 18. The nested_skills key is an empty list which presumably would be populated if this skill had any sub-skills. The parent_skills key is a list containing a single string, \"Expressions\". This indicates that this skill is a sub-skill of the skill \"Expressions\". The repository_id key is the unique identifier for the repository that this skill belongs to and the value is the number 1. The created_at and updated_at keys both contain timestamps indicating when this skill was created and last updated. The name key contains the name of this skill, \"What are Expressions\", and the level key indicates that this is a level 1 skill. The description key is empty.",
        "created_at": "2023-11-13T14:23:09.830Z",
        "updated_at": "2023-11-20T07:51:11.488Z"
    },
    {
        "id": 1743,
        "owner": [],
        "entity_id": "19",
        "entity_id_full": "sse/skill/19",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four key value pairs. The first is id which has a value of 19. The second is nested_skills which has a value of an empty list. This means that there are no nested skills. The third is parent_skills which has a value of an empty list. This means that there are no parent skills. The fourth is repository_id which has a value of 1. This is the identifier for the repository. The fifth is created_at which has a value of 2023-11-20T07:51:11.489Z. This is the date and time that the constant was created. The sixth is updated_at which has a value of 2023-11-20T07:51:11.489Z. This is the date and time that the constant was last updated. The seventh is name which has a value of Constants. This is the name of the constant. The eighth is level which has a value of 3. This is the level of the constant. The ninth is description which has a value of final. This is the description of the constant. The tenth is static which has a value of true. This means that the constant is static.",
        "created_at": "2023-11-13T14:23:09.830Z",
        "updated_at": "2023-11-20T07:51:11.489Z"
    },
    {
        "id": 1744,
        "owner": [],
        "entity_id": "20",
        "entity_id_full": "sse/skill/20",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains four keys: id, nested_skills, parent_skills, repository_id. The id key is associated with the value 20, the nested_skills key is associated with an empty list, the parent_skills key is associated with an empty list, and the repository_id key is associated with the value 1. The created_at and updated_at keys are both associated with the date 2023-11-20T07:51:11.489Z. The name key is associated with the value Input, and the level key is associated with the value 3. Finally, the description key is associated with the value User input via Scanner.",
        "created_at": "2023-11-13T14:23:09.832Z",
        "updated_at": "2023-11-20T07:51:11.489Z"
    },
    {
        "id": 1729,
        "owner": [],
        "entity_id": "4",
        "entity_id_full": "sse/skill/4",
        "entity_type": "skill",
        "contents": "\n\nThe first key, id, has a value of 4. This is the unique identifier for this particular skill.\n\nThe next key is nested_skills which is an empty list. This field would typically contain a list of skills which are sub-skills of the current skill, but in this case there are no sub-skills.\n\nThe next key is parent_skills which contains a single element: the string 'Commands Understanding'. This indicates that the skill 'Interpreter Usage' is a sub-skill of the 'Commands Understanding' skill.\n\nThe next key is repository_id which has a value of 1. This indicates that this skill is part of the repository with id 1.\n\nThe next two keys are created_at and updated_at. These both contain timestamps indicating when this skill was created and last updated.\n\nThe next key is name which contains the string 'Interpreter Usage'. This is the name of the skill.\n\nThe next key is level which has a value of 3. This indicates the level of the skill. A level 1 skill is a basic skill, while a level 3 skill is an advanced skill.\n\nThe final key is description which contains",
        "created_at": "2023-11-13T14:23:09.326Z",
        "updated_at": "2023-11-20T07:51:10.956Z"
    },
    {
        "id": 1745,
        "owner": [],
        "entity_id": "21",
        "entity_id_full": "sse/skill/21",
        "entity_type": "skill",
        "contents": "\n\n\n\nThe Python dictionary includes the following key value pairs:\n-id: 21\n-nested_skills: []\n-parent_skills: []\n-repository_id: 1\n-created_at: 2023-11-20T07:51:11.491Z\n-updated_at: 2023-11-20T07:51:11.491Z\n-name: Writing Import\n-level: 1\n-description: Writing Import statements wo/ knowing the background.\n\nThe id key represents the unique identifier for the skill. The nested_skills key represents a list of skills that are related to this skill. The parent_skills key represents a list of skills that this skill is a sub-skill of. The repository_id key represents the unique identifier of the repository that this skill belongs to. The created_at key represents the date and time that the skill was created. The updated_at key represents the date and time that the skill was last updated. The name key represents the name of the skill. The level key represents the skill level of the skill. The description key represents a description of the skill.",
        "created_at": "2023-11-13T14:23:09.833Z",
        "updated_at": "2023-11-20T07:51:11.491Z"
    },
    {
        "id": 1750,
        "owner": [],
        "entity_id": "22",
        "entity_id_full": "sse/skill/22",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill, including the skill's id, name, level, and description. The id is a unique identifier for the skill, while the name is the name of the skill. The level indicates the difficulty of the skill, with 1 being the easiest and 5 being the hardest. The description provides more information about the skill.",
        "created_at": "2023-11-13T14:23:09.834Z",
        "updated_at": "2023-11-20T07:51:11.491Z"
    },
    {
        "id": 1747,
        "owner": [],
        "entity_id": "23",
        "entity_id_full": "sse/skill/23",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents one skill on a skill tree. The skill has an id of 23, no nested skills, and the parent skills are 'switch/case concept' and 'Code Blocks'. The skill was created on 2023-11-20T07:51:11.492Z and last updated on the same date. The skill is called 'Code Block I' and is level 3. The description is 'More than one statement wo/scope'.",
        "created_at": "2023-11-13T14:23:09.834Z",
        "updated_at": "2023-11-20T07:51:11.492Z"
    },
    {
        "id": 1748,
        "owner": [],
        "entity_id": "24",
        "entity_id_full": "sse/skill/24",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary consists of six key-value pairs. The id key is associated with the value 24, the nested_skills key is associated with an empty list value, the parent_skills key is associated with a list value containing the string \"Code Blocks\", the repository_id key is associated with the value 1, the created_at key is associated with the value \"2023-11-20T07:51:11.493Z\", and the updated_at key is also associated with the value \"2023-11-20T07:51:11.493Z\". The name key is associated with the string value \"Code Block II\" and the level key is associated with the value 3. The description key is associated with the string value \"With scope\".",
        "created_at": "2023-11-13T14:23:09.835Z",
        "updated_at": "2023-11-20T07:51:11.493Z"
    },
    {
        "id": 1746,
        "owner": [],
        "entity_id": "25",
        "entity_id_full": "sse/skill/25",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary consists of seven key value pairs. The first key is \"id\" and the value is 25. The second key is \"nested_skills\" and the value is an empty list. The third key is \"parent_skills\" and the value is a list consisting of one element, \"Imperative Loops\". The fourth key is \"repository_id\" and the value is 1. The fifth key is \"created_at\" and the value is \"2023-11-20T07:51:11.493Z\". The sixth key is \"updated_at\" and the value is \"2023-11-20T07:51:11.493Z\". The seventh and final key is \"name\" and the value is \"Foundations of Loops\".",
        "created_at": "2023-11-13T14:23:09.835Z",
        "updated_at": "2023-11-20T07:51:11.493Z"
    },
    {
        "id": 1751,
        "owner": [],
        "entity_id": "27",
        "entity_id_full": "sse/skill/27",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary describes a skill called While-Loop. The skill has an id of 27, is in repository 1, was created on November 20, 2023, and updated on the same date. The skill is a level 3 skill and its description is \"While-Loop\". The skill has no nested skills but does have the parent skill \"Imperative Loops\".",
        "created_at": "2023-11-13T14:23:09.836Z",
        "updated_at": "2023-11-20T07:51:11.495Z"
    },
    {
        "id": 1749,
        "owner": [],
        "entity_id": "26",
        "entity_id_full": "sse/skill/26",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs:\n- id: 26\n- nested_skills: []\n- parent_skills: ['Imperative Loops']\n- repository_id: 1\n- created_at: 2023-11-20T07:51:11.494Z\n- updated_at: 2023-11-20T07:51:11.494Z\n- name: For-Loop\n- level: 3\n- description: For-Loop\n\nThe id key has a value of 26, the nested_skills key has an empty list as its value, the parent_skills key has a list of one element as its value, the repository_id key has a value of 1, the created_at key has a value of 2023-11-20T07:51:11.494Z, the updated_at key has a value of 2023-11-20T07:51:11.494Z, the name key has a value of For-Loop, the level key has a value of 3, and the description key has a value of For-Loop.",
        "created_at": "2023-11-13T14:23:09.836Z",
        "updated_at": "2023-11-20T07:51:11.494Z"
    },
    {
        "id": 1752,
        "owner": [],
        "entity_id": "28",
        "entity_id_full": "sse/skill/28",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a computer programming skill called a \"Do-While-Loop\". The id key refers to a unique identifier for the skill, while the nested_skills key denotes any skills that are required in order to learn the \"Do-While-Loop\" skill. The value for the parent_skills key is a list of skills that are needed in order to learn the \"Do-While-Loop\" skill. The repository_id key is a unique identifier for the repository in which the skill is located. The created_at and updated_at keys contain timestamps for when the skill was created and last updated, respectively. Finally, the name and level keys provide the name and difficulty level of the skill, while the description key contains a brief description of the skill.",
        "created_at": "2023-11-13T14:23:09.836Z",
        "updated_at": "2023-11-20T07:51:11.495Z"
    },
    {
        "id": 1754,
        "owner": [],
        "entity_id": "1001",
        "entity_id_full": "sse/skill/1001",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains key value pairs that describe commands to compile and execute programs without a deeper understanding. The id key is set to 1001, meaning that this is the first command in the dictionary. The nested_skills key is set to a list of two items, \"Compiler Calling\" and \"Interpreter Calling.\" This means that the user must know how to call a compiler and interpreter in order to use this particular command. The parent_skills key is set to an empty list, indicating that this command does not have any dependencies. The repository_id key is set to 1, meaning that this command belongs to the first repository in the dictionary. The created_at key is set to 2023-11-20T07:51:11.576Z, indicating when this command was created. The updated_at key is set to 2023-11-20T07:51:11.576Z, indicating when this command was last updated. The name key is set to \"Commands Usage,\" indicating the name of this command. The level key is set to 1, indicating that this is a beginner-level command. The description key is set to \"Commands to compile and execute own programs, wo/ deeper understanding",
        "created_at": "2023-11-13T14:23:09.921Z",
        "updated_at": "2023-11-20T07:51:11.576Z"
    },
    {
        "id": 1755,
        "owner": [],
        "entity_id": "1002",
        "entity_id_full": "sse/skill/1002",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary consists of key-value pairs where the key is 'id' and the value is 1002. The next key is 'nested_skills' and the value is a list containing the two items 'Compiler Usage' and 'Interpreter Usage'. The next key is 'parent_skills' and the value is an empty list. The next key is 'repository_id' and the value is 1. The next key is 'created_at' and the value is '2023-11-20T07:51:11.587Z'. The next key is 'updated_at' and the value is '2023-11-20T07:51:11.587Z'. The final key is 'name' and the value is 'Commands Understanding'. The level key has a value of 3 and the description key has a value of 'Commands to compile and execute own programs, wo/ deeper understanding'.",
        "created_at": "2023-11-13T14:23:09.931Z",
        "updated_at": "2023-11-20T07:51:11.587Z"
    },
    {
        "id": 1756,
        "owner": [],
        "entity_id": "1003",
        "entity_id_full": "sse/skill/1003",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary has four keys: id, nested_skills, parent_skills, repository_id. The id key corresponds to a number that represents the Expressions concept in Java. The nested_skills key corresponds to a list of skills related to Expressions, including Literals, Primitive Datatypes & Operators, Variables, and What are Expressions. The parent_skills key corresponds to a list of skills required to understand Expressions, including if/else concept and switch/case concept. The repository_id key corresponds to a number that represents the location of the concept in the Java skills repository. The remaining keys, created_at and updated_at, represent the date and time when the concept was created and last updated, respectively.",
        "created_at": "2023-11-13T14:23:09.966Z",
        "updated_at": "2023-11-20T07:51:11.593Z"
    },
    {
        "id": 1757,
        "owner": [],
        "entity_id": "1004",
        "entity_id_full": "sse/skill/1004",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes the skill 'if/else concept' which is a part of the repository with id 1. The skill is at level 3 and has the description 'Complete understanding of if/else in Java'. The skill has the nested skills 'if-statement', 'else-statement', 'if-block', 'if nesting', and 'Expressions'. The skill's parent skill is 'Branching'. The skill was created on 2023-11-20T07:51:11.620Z and was updated on 2023-11-20T07:51:11.620Z.",
        "created_at": "2023-11-13T14:23:09.974Z",
        "updated_at": "2023-11-20T07:51:11.620Z"
    },
    {
        "id": 1758,
        "owner": [],
        "entity_id": "1005",
        "entity_id_full": "sse/skill/1005",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents a skill called \"switch/case concept\" with an ID of 1005. This skill has 4 sub-skills: \"switch/case advanced\", \"switch/case basics\", \"Code Block I\", and \"Expressions\". These sub-skills are all part of a larger skill called \"Branching\". This skill is stored in repository 1 and was last updated on 2023-11-20T07:51:11.628Z.",
        "created_at": "2023-11-13T14:23:09.982Z",
        "updated_at": "2023-11-20T07:51:11.628Z"
    },
    {
        "id": 1779,
        "owner": [],
        "entity_id": "2019",
        "entity_id_full": "sse/skill/2019",
        "entity_type": "skill",
        "contents": "\n\n\nThe id is 2019, the nested_skills are [], the parent_skills are ['Grundlagen Daten und Informationen'], the repository_id is 2, the created_at is 2023-11-20T07:51:13.178Z, the updated_at is 2023-11-20T07:51:13.178Z, the name is Definition Digitale Übertragungswege, the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.271Z",
        "updated_at": "2023-11-20T07:51:13.178Z"
    },
    {
        "id": 1759,
        "owner": [],
        "entity_id": "1006",
        "entity_id_full": "sse/skill/1006",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n\n- id: 1006\n- nested_skills: ['if/else concept', 'switch/case concept']\n- parent_skills: ['Control Structures']\n- repository_id: 1\n- created_at: 2023-11-20T07:51:11.633Z\n- updated_at: 2023-11-20T07:51:11.633Z\n- name: Branching\n- level: 3\n- description: if/else and switch/case\n\nThe id key corresponds to the unique identifier for the dictionary. The nested_skills key corresponds to a list of skills related to the concept of branching. The parent_skills key corresponds to a list of skills that the concept of branching falls under. The repository_id key corresponds to the unique identifier for the repository that the skill is stored in. The created_at key corresponds to the date and time that the skill was created. The updated_at key corresponds to the date and time that the skill was last updated. The name key corresponds to the name of the skill. The level key corresponds to the difficulty level of the skill. The description",
        "created_at": "2023-11-13T14:23:09.989Z",
        "updated_at": "2023-11-20T07:51:11.633Z"
    },
    {
        "id": 1760,
        "owner": [],
        "entity_id": "1007",
        "entity_id_full": "sse/skill/1007",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four key value pairs. The first key is \"id\" and the value is 1007. The second key is \"nested_skills\" and the value is a list of strings. The third key is \"parent_skills\" and the value is an empty list. The fourth key is \"repository_id\" and the value is 1.\n\nThe \"id\" key is the unique identifier for the dictionary. The \"nested_skills\" key is a list of skills that are related to the skill represented by the dictionary. The \"parent_skills\" key is a list of skills that the skill represented by the dictionary is a subset of. The \"repository_id\" key is the id of the repository that the skill belongs to.",
        "created_at": "2023-11-13T14:23:09.996Z",
        "updated_at": "2023-11-20T07:51:11.639Z"
    },
    {
        "id": 1761,
        "owner": [],
        "entity_id": "1008",
        "entity_id_full": "sse/skill/1008",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four key value pairs. The first pair is the id and the nested_skills. The id is 1008 and the nested_skills are the foundations of loops, while-loop, for-loop, and do-while-loop. The second pair is the parent_skills and the repository_id. The parent_skills are control structures and the repository_id is 1. The third pair is the created_at and the updated_at. The created_at is 2023-11-20T07:51:11.645Z and the updated_at is 2023-11-20T07:51:11.645Z. The fourth pair is the name and the level. The name is imperative loops and the level is 3.",
        "created_at": "2023-11-13T14:23:10.004Z",
        "updated_at": "2023-11-20T07:51:11.645Z"
    },
    {
        "id": 1762,
        "owner": [],
        "entity_id": "1009",
        "entity_id_full": "sse/skill/1009",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a particular skill, in this case \"Control Structures\". The id refers to the unique identifier for this skill, while nested_skills and parent_skills refer to other skills that this skill is related to. The repository_id indicates which repository this skill belongs to, while created_at and updated_at show when this skill was created and last updated. Finally, name and level indicate the skill's name and difficulty level, respectively, while description provides a brief overview of the skill.",
        "created_at": "2023-11-13T14:23:10.011Z",
        "updated_at": "2023-11-20T07:51:11.652Z"
    },
    {
        "id": 1765,
        "owner": [],
        "entity_id": "2003",
        "entity_id_full": "sse/skill/2003",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary describes a digital transformation course with the name \"Einführung Digitale Transformation\". The course is at level 1 and has no description. The course was created on 2023-11-20T07:51:12.480Z and updated on 2023-11-20T07:51:12.480Z. The course has no nested skills but has the parent skill \"Grundlagen Industrie 4.0\". The id of the course is 2003 and the repository_id is 2.",
        "created_at": "2023-11-13T14:23:10.766Z",
        "updated_at": "2023-11-20T07:51:12.480Z"
    },
    {
        "id": 1764,
        "owner": [],
        "entity_id": "2010",
        "entity_id_full": "sse/skill/2010",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill, including the skill's id, name, level, description, nested skills, and parent skills. The skill was created at the date and time indicated, and was updated at the same date and time.",
        "created_at": "2023-11-13T14:23:11.263Z",
        "updated_at": "2023-11-20T07:51:13.171Z"
    },
    {
        "id": 1766,
        "owner": [],
        "entity_id": "2011",
        "entity_id_full": "sse/skill/2011",
        "entity_type": "skill",
        "contents": "\n\n\n\nThe Python dictionary contains the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, and description.\n\nThe id key is the unique identifier for the dictionary.\n\nThe nested_skills key is a list of skills that are contained within this skill.\n\nThe parent_skills key is a list of skills that this skill is a subset of.\n\nThe repository_id key is the id of the repository that this skill belongs to.\n\nThe created_at key is the date and time that this skill was created.\n\nThe updated_at key is the date and time that this skill was last updated.\n\nThe name key is the name of the skill.\n\nThe level key is the level of the skill.\n\nThe description key is a description of the skill.",
        "created_at": "2023-11-13T14:23:11.264Z",
        "updated_at": "2023-11-20T07:51:13.172Z"
    },
    {
        "id": 1763,
        "owner": [],
        "entity_id": "2002",
        "entity_id_full": "sse/skill/2002",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a skill called \"Definition Industrie 4.0\" which is at level 1. The id is 2002, the repository_id is 2, and it was created_at on 2023-11-20T07:51:12.480Z. The skill has no nested_skills or parent_skills. The updated_at value is the same as the created_at value, meaning it was never updated. The description field is empty.",
        "created_at": "2023-11-13T14:23:10.766Z",
        "updated_at": "2023-11-20T07:51:12.480Z"
    },
    {
        "id": 1769,
        "owner": [],
        "entity_id": "2005",
        "entity_id_full": "sse/skill/2005",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary describes a \"skill\" which is a concept in the area of Industrial 4.0. The skill has the ID 2005, no nested skills, and the parent skill is \"Grundlagen Industrie 4.0\". The skill is found in repository 2, was created on 2023-11-20 at 07:51:12.482, and updated at the same time. The name of the skill is \"Produktionsdigitalisierung\" and it is at level 1. There is no description given.",
        "created_at": "2023-11-13T14:23:10.768Z",
        "updated_at": "2023-11-20T07:51:12.482Z"
    },
    {
        "id": 1783,
        "owner": [],
        "entity_id": "2006",
        "entity_id_full": "sse/skill/2006",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a \"smart factory\" and contains the following key value pairs:\n- id: 2006\n- nested_skills: []\n- parent_skills: ['Grundlagen Industrie 4.0']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:12.906Z\n- updated_at: 2023-11-20T07:51:12.906Z\n- name: Definition Smart Factory\n- level: 1\n- description: None\n\nThe id refers to the unique identifier of the smart factory. The nested_skills value is an empty list, indicating that there are no nested skills associated with this factory. The parent_skills value is a list containing the skill \"Grundlagen Industrie 4.0\", indicating that this factory is a sub-skill of that skill. The repository_id value indicates which repository this factory is stored in. The created_at and updated_at values show when the factory was created and last updated. The name value indicates the name of the factory. The level value indicates the level of the factory. The description value is set to None, indicating that there",
        "created_at": "2023-11-13T14:23:11.032Z",
        "updated_at": "2023-11-20T07:51:12.906Z"
    },
    {
        "id": 1770,
        "owner": [],
        "entity_id": "2012",
        "entity_id_full": "sse/skill/2012",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, repository_id. The value associated with the id key is 2012. The value associated with the nested_skills key is an empty list. The value associated with the parent_skills key is also an empty list. The value associated with the repository_id key is 2. The value associated with the created_at key is 2023-11-20T07:51:13.173Z. The value associated with the updated_at key is 2023-11-20T07:51:13.173Z. The value associated with the name key is Datenarten in der Produktion. The value associated with the level key is 1. The value associated with the description key is None.",
        "created_at": "2023-11-13T14:23:11.266Z",
        "updated_at": "2023-11-20T07:51:13.173Z"
    },
    {
        "id": 1773,
        "owner": [],
        "entity_id": "2013",
        "entity_id_full": "sse/skill/2013",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary contains information about a particular skill. The 'id' key contains a unique identifier for the skill, while the 'nested_skills' key contains a list of skills that are subskills of this skill. The 'parent_skills' key contains a list of skills of which this skill is a subskill. The 'repository_id' key contains the id of the repository in which this skill is stored. The 'created_at' key contains the date and time when this skill was created. The 'updated_at' key contains the date and time when this skill was last updated. The 'name' key contains the name of the skill. The 'level' key indicates the level of the skill, with 1 being the highest level. The 'description' key contains a description of the skill.",
        "created_at": "2023-11-13T14:23:11.266Z",
        "updated_at": "2023-11-20T07:51:13.174Z"
    },
    {
        "id": 1767,
        "owner": [],
        "entity_id": "2001",
        "entity_id_full": "sse/skill/2001",
        "entity_type": "skill",
        "contents": " {'id': '2001', 'nested_skills': [], 'parent_skills': ['Grundlagen Industrie 4.0'], 'repository_id': '2', 'created_at': '2023-11-20T07:51:12.479Z', 'updated_at': '2023-11-20T07:51:12.479Z', 'name': 'Geschichte der industriellen Produktion', 'level': '1', 'description': 'None'}\n\nThe dictionary represents a skill with the following attributes:\n- id: the unique identifier for the skill\n- nested_skills: a list of skills that are sub-skills of this skill\n- parent_skills: a list of skills of which this skill is a sub-skill\n- repository_id: the id of the repository that this skill belongs to\n- created_at: the date and time at which this skill was created\n- updated_at: the date and time at which this skill was last updated\n- name: the name of the skill\n- level: the level of the skill (1 is the highest level)\n",
        "created_at": "2023-11-13T14:23:10.766Z",
        "updated_at": "2023-11-20T07:51:12.479Z"
    },
    {
        "id": 1776,
        "owner": [],
        "entity_id": "2015",
        "entity_id_full": "sse/skill/2015",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a skill called \"Definition Endsystem\". The skill has an id of 2015, and was created on 2023-11-20T07:51:13.175Z. The skill was last updated on 2023-11-20T07:51:13.175Z. The skill is at level 1, and has no description. The skill has no nested skills, but has one parent skill, called \"Grundlagen Daten und Informationen\". The skill is stored in repository 2.",
        "created_at": "2023-11-13T14:23:11.268Z",
        "updated_at": "2023-11-20T07:51:13.175Z"
    },
    {
        "id": 1774,
        "owner": [],
        "entity_id": "2014",
        "entity_id_full": "sse/skill/2014",
        "entity_type": "skill",
        "contents": "\n\nThe id key in this dictionary refers to the id number of the definition, which is 2014. The nested_skills key refers to a list of skills that are related to this definition. The parent_skills key refers to a list of skills that this definition is a part of. The repository_id key refers to the id number of the repository that this definition is stored in. The created_at key refers to the date that this definition was created. The updated_at key refers to the date that this definition was last updated. The name key refers to the name of the definition, which is \"Definition Kommunikationsnetz\". The level key refers to the level of difficulty of the definition. The description key refers to a brief description of the definition.",
        "created_at": "2023-11-13T14:23:11.267Z",
        "updated_at": "2023-11-20T07:51:13.175Z"
    },
    {
        "id": 1775,
        "owner": [],
        "entity_id": "2007",
        "entity_id_full": "sse/skill/2007",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a skillset, including the name, description, level, id, repository_id, created_at, and updated_at. The nested_skills and parent_skills keys represent, respectively, any skillsets that are subsets of this skillset, and any skillsets of which this skillset is a subset.",
        "created_at": "2023-11-13T14:23:11.050Z",
        "updated_at": "2023-11-20T07:51:12.957Z"
    },
    {
        "id": 1771,
        "owner": [],
        "entity_id": "2008",
        "entity_id_full": "sse/skill/2008",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents a skill, which has the name \"Daten- und Informationsflüsse im Unternehmen\" (Data and Information Flows in the Enterprise), the ID 2008, the level 1, the parent skill \"Grundlagen Industrie 4.0\" (Basics of Industry 4.0), no nested skills and no description. The skill was created at 2023-11-20T07:51:12.981Z and updated at the same time.",
        "created_at": "2023-11-13T14:23:11.052Z",
        "updated_at": "2023-11-20T07:51:12.981Z"
    },
    {
        "id": 1780,
        "owner": [],
        "entity_id": "2016",
        "entity_id_full": "sse/skill/2016",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary includes the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, and description. The id key corresponds to the identification number assigned to the dictionary, while the nested_skills key refers to a list of skills that are related to the skill represented by the dictionary. The parent_skills key contains a list of skills that the skill represented by the dictionary is a subset of. The repository_id key corresponds to the identification number of the repository that the dictionary is stored in. The created_at key refers to the date and time when the dictionary was created, while the updated_at key corresponds to the date and time when the dictionary was last updated. The name key represents the name of the skill, while the level key corresponds to the skill's level of difficulty. The description key contains a brief description of the skill.",
        "created_at": "2023-11-13T14:23:11.269Z",
        "updated_at": "2023-11-20T07:51:13.176Z"
    },
    {
        "id": 1778,
        "owner": [],
        "entity_id": "2017",
        "entity_id_full": "sse/skill/2017",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains four keys: id, nested_skills, parent_skills, and repository_id. The id key is associated with the value 2017, which is the unique identifier for the dictionary. The nested_skills key is associated with an empty list, which indicates that there are no sub-skills within this skill. The parent_skills key is associated with a list containing a single element, 'Grundlagen Daten und Informationen'. This indicates that this skill is a sub-skill of the 'Grundlagen Daten und Informationen' skill. The repository_id key is associated with the value 2, which indicates that this skill is part of the second repository. The created_at and updated_at keys are both associated with the value 2023-11-20T07:51:13.177Z. This indicates that the skill was created on November 20, 2023 at 07:51:13.177 UTC.",
        "created_at": "2023-11-13T14:23:11.269Z",
        "updated_at": "2023-11-20T07:51:13.177Z"
    },
    {
        "id": 1777,
        "owner": [],
        "entity_id": "2018",
        "entity_id_full": "sse/skill/2018",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, description.\n\nThe id key corresponds to the unique identifier for the dictionary, while the nested_skills key contains a list of skills that are associated with the dictionary. The parent_skills key contains a list of skills that the dictionary is a part of, while the repository_id key contains the unique identifier for the repository that the dictionary is stored in. The created_at and updated_at keys contain the timestamp for when the dictionary was created and updated, respectively. The name key corresponds to the name of the dictionary, while the level key corresponds to the level of the dictionary. Finally, the description key contains a description of the dictionary.",
        "created_at": "2023-11-13T14:23:11.270Z",
        "updated_at": "2023-11-20T07:51:13.178Z"
    },
    {
        "id": 1772,
        "owner": [],
        "entity_id": "2009",
        "entity_id_full": "sse/skill/2009",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a technology used in Industry 4.0 with the corresponding id, nested skills, parent skills, repository id, creation date, update date, name, level, and description.",
        "created_at": "2023-11-13T14:23:11.067Z",
        "updated_at": "2023-11-20T07:51:12.989Z"
    },
    {
        "id": 1782,
        "owner": [],
        "entity_id": "2020",
        "entity_id_full": "sse/skill/2020",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents a skill called \"Vergleich der digitalen Übertragungswege\" which is a level 1 skill with no description. This skill has no nested skills, but does have the parent skill of \"Grundlagen Daten und Informationen\". The repository_id for this skill is 2 and it was created on 2023-11-20T07:51:13.179Z. This skill was last updated on 2023-11-20T07:51:13.179Z.",
        "created_at": "2023-11-13T14:23:11.271Z",
        "updated_at": "2023-11-20T07:51:13.179Z"
    },
    {
        "id": 1781,
        "owner": [],
        "entity_id": "2021",
        "entity_id_full": "sse/skill/2021",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 2021\n- nested_skills: []\n- parent_skills: ['Grundlagen Daten und Informationen']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.180Z\n- updated_at: 2023-11-20T07:51:13.180Z\n- name: Anwendung Digitale Übertragungswege\n- level: 1\n- description: None\n\nThe id key contains the unique identifier for the skill, while the nested_skills key lists any skills that are subskills of this skill. The parent_skills key lists any skills of which this skill is a subskill. The repository_id key indicates which learning repository this skill belongs to. The created_at and updated_at keys show when the skill was created and last updated, respectively. The name key contains the skill's name, while the level key indicates theskill's level within its learning repository. Finally, the description key contains a brief description of the skill.",
        "created_at": "2023-11-13T14:23:11.271Z",
        "updated_at": "2023-11-20T07:51:13.180Z"
    },
    {
        "id": 1784,
        "owner": [],
        "entity_id": "2022",
        "entity_id_full": "sse/skill/2022",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a particular subsystem within a definition. The id key corresponds to the unique identifier for the subsystem, the nested_skills key corresponds to a list of skills associated with the subsystem, the parent_skills key corresponds to a list of skills required for the subsystem, the repository_id key corresponds to the unique identifier for the repository in which the subsystem is found, the created_at key corresponds to the date and time the subsystem was created, the updated_at key corresponds to the date and time the subsystem was last updated, the name key corresponds to the name of the subsystem, the level key corresponds to the level of the subsystem within the definition, and the description key corresponds to a brief description of the subsystem.",
        "created_at": "2023-11-13T14:23:11.272Z",
        "updated_at": "2023-11-20T07:51:13.181Z"
    },
    {
        "id": 1788,
        "owner": [],
        "entity_id": "2026",
        "entity_id_full": "sse/skill/2026",
        "entity_type": "skill",
        "contents": "\n\nThe id key value pair refers to the identification number of the definition, which is 2026. The nested_skills key value pair refers to a list of skills that are related to the definition. The parent_skills key value pair refers to a list of skills that the definition falls under. The repository_id key value pair refers to the identification number of the repository that the definition is stored in, which is 2. The created_at key value pair refers to the date that the definition was created, which is 2023-11-20T07:51:13.184Z. The updated_at key value pair refers to the date that the definition was last updated, which is 2023-11-20T07:51:13.184Z. The name key value pair refers to the name of the definition, which is Definition Big Data. The level key value pair refers to the level of difficulty of the definition, which is 1. The description key value pair refers to a description of the definition, which is None.",
        "created_at": "2023-11-13T14:23:11.274Z",
        "updated_at": "2023-11-20T07:51:13.184Z"
    },
    {
        "id": 1786,
        "owner": [],
        "entity_id": "2024",
        "entity_id_full": "sse/skill/2024",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill called \"Definition Protokoll\" with an id of 2024. The skill has no nested skills and one parent skill called \"Grundlagen Daten und Informationen\". The skill was created on 2023-11-20T07:51:13.182Z and was updated on 2023-11-20T07:51:13.182Z. The level of the skill is 1 and it has no description.",
        "created_at": "2023-11-13T14:23:11.273Z",
        "updated_at": "2023-11-20T07:51:13.182Z"
    },
    {
        "id": 1787,
        "owner": [],
        "entity_id": "2025",
        "entity_id_full": "sse/skill/2025",
        "entity_type": "skill",
        "contents": "\nThe id is 2025, the nested_skills are [], the parent_skills are ['Grundlagen Daten und Informationen'], the repository_id is 2, the created_at is 2023-11-20T07:51:13.183Z, the updated_at is 2023-11-20T07:51:13.183Z, the name is Definition Informationstechnik, the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.273Z",
        "updated_at": "2023-11-20T07:51:13.183Z"
    },
    {
        "id": 1790,
        "owner": [],
        "entity_id": "2028",
        "entity_id_full": "sse/skill/2028",
        "entity_type": "skill",
        "contents": "\n\nThe id refers to the identification number of the skill, in this case 2028. The nested_skills key refers to a list of skills that are related to this skill, which in this case is empty. The parent_skills key refers to a list of skills of which this skill is a subset, and in this case the parent skill is \"Grundlagen Daten und Informationen\". The repository_id key refers to the identification number of the repository in which this skill is stored, and in this case the repository_id is 2. The created_at key refers to the date on which this skill was created, which in this case was 2023-11-20T07:51:13.185Z. The updated_at key refers to the date on which this skill was last updated, which in this case was also 2023-11-20T07:51:13.185Z. The name key corresponds to the name of the skill, which in this case is \"Datenverarbeitung der digitalen Produktion\". The level key corresponds to the level of the skill, which in this case is 1. The description key refers to a description of the skill, which in this case is",
        "created_at": "2023-11-13T14:23:11.276Z",
        "updated_at": "2023-11-20T07:51:13.185Z"
    },
    {
        "id": 1789,
        "owner": [],
        "entity_id": "2027",
        "entity_id_full": "sse/skill/2027",
        "entity_type": "skill",
        "contents": "\n\nThe id is 2027, the nested_skills are [], the parent_skills are ['Grundlagen Daten und Informationen'], the repository_id is 2, the created_at is 2023-11-20T07:51:13.184Z, the updated_at is 2023-11-20T07:51:13.184Z, the name is Definition Predictive Maintenance, the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.275Z",
        "updated_at": "2023-11-20T07:51:13.184Z"
    },
    {
        "id": 1793,
        "owner": [],
        "entity_id": "2029",
        "entity_id_full": "sse/skill/2029",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill that has the name \"Definition Algorithmus\", the ID 2029, the level 1, no description, was created on 2023-11-20T07:51:13.186Z and updated on 2023-11-20T07:51:13.186Z. This skill has no nested skills and its parent skill is \"Grundlagen Daten und Informationen\".",
        "created_at": "2023-11-13T14:23:11.276Z",
        "updated_at": "2023-11-20T07:51:13.186Z"
    },
    {
        "id": 1791,
        "owner": [],
        "entity_id": "2030",
        "entity_id_full": "sse/skill/2030",
        "entity_type": "skill",
        "contents": "\n\n\nThe following dictionary contains information on a skill called \"Beispiel Adaptive Routenplanung\". The id for this skill is 2030, and it has no nested skills. The skill's parent skill is \"Grundlagen Daten und Informationen\", and the repository id for this skill is 2. This skill was created at 2023-11-20T07:51:13.188Z and updated at 2023-11-20T07:51:13.188Z. The level for this skill is 1, and there is no description available.",
        "created_at": "2023-11-13T14:23:11.277Z",
        "updated_at": "2023-11-20T07:51:13.188Z"
    },
    {
        "id": 1792,
        "owner": [],
        "entity_id": "2031",
        "entity_id_full": "sse/skill/2031",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary includes four key value pairs. The first key is \"id\" and the corresponding value is \"2031\". The second key is \"nested_skills\" and the corresponding value is an empty list. The third key is \"parent_skills\" and the corresponding value is a list with one element, \"Grundlagen Daten und Informationen\". The fourth key is \"repository_id\" and the corresponding value is \"2\". The fifth key is \"created_at\" and the corresponding value is \"2023-11-20T07:51:13.189Z\". The sixth key is \"updated_at\" and the corresponding value is \"2023-11-20T07:51:13.189Z\". The seventh key is \"name\" and the corresponding value is \"Definition Blockchain\". The eighth key is \"level\" and the corresponding value is \"1\". The ninth key is \"description\" and the corresponding value is \"None\".",
        "created_at": "2023-11-13T14:23:11.277Z",
        "updated_at": "2023-11-20T07:51:13.189Z"
    },
    {
        "id": 1889,
        "owner": [],
        "entity_id": "2179",
        "entity_id_full": "sse/skill/2179",
        "entity_type": "skill",
        "contents": "\n\n\n\nThe dictionary contains information about a skill called \"Definition Heißleiter\" and its relations to other skills. The id of the skill is 2179, and it has no nested skills itself, but it is a child skill of the skill \"Sensorik\" (which has id 2). The skill was created on 2023-11-20T07:51:13.272Z and updated on the same date. It has a name and a level (1), but no description.",
        "created_at": "2023-11-13T14:23:11.371Z",
        "updated_at": "2023-11-20T07:51:13.272Z"
    },
    {
        "id": 1796,
        "owner": [],
        "entity_id": "2035",
        "entity_id_full": "sse/skill/2035",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes four keys: id, nested_skills, parent_skills, repository_id. The id key has a value of 2035, meaning that this is the identifier for this particular dictionary. The nested_skills key has a value of an empty list, meaning that there are no skills nested within this skill. The parent_skills key has a value of a list containing one element: 'Grundlagen Daten und Informationen'. This means that the skill 'Grundlagen Daten und Informationen' is a parent skill of the skill represented by this dictionary. The repository_id key has a value of 2, meaning that this dictionary belongs to repository 2. The created_at and updated_at keys both have a value of 2023-11-20T07:51:13.192Z, meaning that this dictionary was created and last updated on November 20, 2023 at 7:51:13 UTC. The name key has a value of 'Definition Cloud Computing', meaning that the name of this skill is 'Definition Cloud Computing'. The level key has a value of 1, meaning that this is a level 1 skill. The description key has a value of None, meaning that there is",
        "created_at": "2023-11-13T14:23:11.279Z",
        "updated_at": "2023-11-20T07:51:13.192Z"
    },
    {
        "id": 1803,
        "owner": [],
        "entity_id": "2033",
        "entity_id_full": "sse/skill/2033",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill, \"Beispiel Neue Geschäftsmodelle\", which has an id of 2033, is at level 1, has no description, was created on 2023-11-20T07:51:13.191Z, and was last updated on 2023-11-20T07:51:13.191Z. This skill has no nested skills, but it does have one parent skill, \"Grundlagen Daten und Informationen\", which has a repository id of 2.",
        "created_at": "2023-11-13T14:23:11.278Z",
        "updated_at": "2023-11-20T07:51:13.191Z"
    },
    {
        "id": 1798,
        "owner": [],
        "entity_id": "2034",
        "entity_id_full": "sse/skill/2034",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 2034\n- nested_skills: []\n- parent_skills: ['Grundlagen Daten und Informationen']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.192Z\n- updated_at: 2023-11-20T07:51:13.192Z\n- name: Definition Internet der Dinge\n- level: 1\n- description: None\n\nThe id refers to the unique identifier of the skill, nested_skills represents a list of skills that are nested under this skill, parent_skills represents a list of skills that this skill is nested under, repository_id refers to the id of the repository that this skill is part of, created_at represents the date and time when the skill was created, updated_at represents the date and time when the skill was last updated, name refers to the name of the skill, level refers to the skill level of the skill, and description contains a description of the skill.",
        "created_at": "2023-11-13T14:23:11.279Z",
        "updated_at": "2023-11-20T07:51:13.192Z"
    },
    {
        "id": 1794,
        "owner": [],
        "entity_id": "2032",
        "entity_id_full": "sse/skill/2032",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a skill called \"Potenziale Neuer Geschäftsmodelle\". The id key refers to the id number of the skill, which is 2032. The nested_skills key represents any skills that are part of this skill, and is currently empty. The parent_skills key represents any skills that this skill is a part of, and in this case, the skill \"Grundlagen Daten und Informationen\" is its parent. The repository_id key refers to the id number of the repository that this skill is part of, which is 2. The created_at key represents when this skill was created, which was Nov. 20, 2023 at 7:51 a.m. The updated_at key represents when this skill was last updated, which was also Nov. 20, 2023 at 7:51 a.m. The name key contains the name of the skill, which is \"Potenziale Neuer Geschäftsmodelle\". The level key represents the level of the skill, which is 1. The description key contains a brief description of the skill, which is currently set to None.",
        "created_at": "2023-11-13T14:23:11.278Z",
        "updated_at": "2023-11-20T07:51:13.190Z"
    },
    {
        "id": 1799,
        "owner": [],
        "entity_id": "2036",
        "entity_id_full": "sse/skill/2036",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes four key-value pairs. The first key is \"id\" and the corresponding value is \"2036\". This is the identifier for the dictionary. The second key is \"nested_skills\" and the corresponding value is an empty list. This indicates that there are no nested skills within this dictionary. The third key is \"parent_skills\" and the corresponding value is a list containing one element, \"Grundlagen Daten und Informationen\". This indicates that the skill \"Grundlagen Daten und Informationen\" is a parent skill of the skill represented by this dictionary. The fourth key is \"repository_id\" and the corresponding value is \"2\". This indicates the repository to which this skill belongs.",
        "created_at": "2023-11-13T14:23:11.280Z",
        "updated_at": "2023-11-20T07:51:13.193Z"
    },
    {
        "id": 1797,
        "owner": [],
        "entity_id": "2037",
        "entity_id_full": "sse/skill/2037",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, description.\n\nThe id key corresponds to the unique identifier for the skill. The nested_skills key corresponds to a list of skills that are nested within this skill (if any). The parent_skills key corresponds to a list of skills that this skill is a child of (if any). The repository_id key corresponds to the unique identifier for the repository that this skill belongs to. The created_at key corresponds to the date and time when the skill was created. The updated_at key corresponds to the date and time when the skill was last updated. The name key corresponds to the name of the skill. The level key corresponds to the level of the skill (1 being the highest). The description key corresponds to a description of the skill (if any).",
        "created_at": "2023-11-13T14:23:11.281Z",
        "updated_at": "2023-11-20T07:51:13.194Z"
    },
    {
        "id": 1795,
        "owner": [],
        "entity_id": "2038",
        "entity_id_full": "sse/skill/2038",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a skill called \"Definition Datenhoheit.\" The skill has an id of 2038, is at level 1, and was created on 11/20/2023 and last updated on the same date. There is no description for the skill. The skill has no nested skills but does have a parent skill called \"Grundlagen Daten und Informationen.\" The skill is located in repository 2.",
        "created_at": "2023-11-13T14:23:11.282Z",
        "updated_at": "2023-11-20T07:51:13.195Z"
    },
    {
        "id": 1801,
        "owner": [],
        "entity_id": "2039",
        "entity_id_full": "sse/skill/2039",
        "entity_type": "skill",
        "contents": "\n\n\nThe id refers to the id of the skill, which is 2039. The nested_skills key refers to a list of skills that are related to this skill. The parent_skills key refers to a list of skills that this skill is related to. The repository_id refers to the id of the repository that this skill is part of. The created_at key refers to the date and time when this skill was created. The updated_at key refers to the date and time when this skill was last updated. The name key refers to the name of the skill, which is \"Definition Daten Compliance\". The level key refers to the level of the skill, which is 1. The description key refers to a description of the skill.",
        "created_at": "2023-11-13T14:23:11.283Z",
        "updated_at": "2023-11-20T07:51:13.196Z"
    },
    {
        "id": 1800,
        "owner": [],
        "entity_id": "2040",
        "entity_id_full": "sse/skill/2040",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains four key value pairs. The id is 2040, the nested_skills is an empty list, the parent_skills is a list containing one element, 'Grundlagen Arbeit 4.0', the repository_id is 2, the created_at is '2023-11-20T07:51:13.197Z', the updated_at is '2023-11-20T07:51:13.197Z', the name is 'Definition Arbeit 4.0', the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.285Z",
        "updated_at": "2023-11-20T07:51:13.197Z"
    },
    {
        "id": 1845,
        "owner": [],
        "entity_id": "2184",
        "entity_id_full": "sse/skill/2184",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a skill named \"Aufbau einer Einweglichtschranke\" which is a level 1 skill with no description. The skill is part of the repository with id 2 and is part of the parent skills \"Sensorik\". The skill has no nested skills. The skill was created on 2023-11-20T07:51:13.274Z and updated on 2023-11-20T07:51:13.274Z.",
        "created_at": "2023-11-13T14:23:11.373Z",
        "updated_at": "2023-11-20T07:51:13.274Z"
    },
    {
        "id": 1802,
        "owner": [],
        "entity_id": "2041",
        "entity_id_full": "sse/skill/2041",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs: id: 2041, nested_skills: [], parent_skills: ['Grundlagen Arbeit 4.0'], repository_id: 2, created_at: 2023-11-20T07:51:13.197Z, updated_at: 2023-11-20T07:51:13.197Z, name: Zentrale Entwicklungen der Arbeitswelt, level: 1, description: None. id refers to the identifier of the dictionary, nested_skills refers to the skills that are nested within this skill, parent_skills refers to the skills that this skill is a child of, repository_id refers to the identifier of the repository that this skill belongs to, created_at refers to the date and time when this skill was created, updated_at refers to the date and time when this skill was last updated, name refers to the name of the skill, level refers to the level of the skill, and description refers to the description of the skill.",
        "created_at": "2023-11-13T14:23:11.287Z",
        "updated_at": "2023-11-20T07:51:13.197Z"
    },
    {
        "id": 1804,
        "owner": [],
        "entity_id": "2042",
        "entity_id_full": "sse/skill/2042",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill called \"Definition Lean Production\" which has an id of 2042. This skill has no nested skills and its parent skills are \"Grundlagen Arbeit 4.0\". The skill is stored in repository 2 and was created on 2023-11-20T07:51:13.198Z. The skill was last updated on 2023-11-20T07:51:13.198Z and has a level of 1. There is no description for this skill.",
        "created_at": "2023-11-13T14:23:11.288Z",
        "updated_at": "2023-11-20T07:51:13.198Z"
    },
    {
        "id": 1806,
        "owner": [],
        "entity_id": "2043",
        "entity_id_full": "sse/skill/2043",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains information on a definition for Lean Management. The id is 2043, the nested_skills are [], the parent_skills are ['Grundlagen Arbeit 4.0'], the repository_id is 2, the created_at is 2023-11-20T07:51:13.199Z, the updated_at is 2023-11-20T07:51:13.199Z, the name is Definition Lean Management, the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.289Z",
        "updated_at": "2023-11-20T07:51:13.199Z"
    },
    {
        "id": 1805,
        "owner": [],
        "entity_id": "2044",
        "entity_id_full": "sse/skill/2044",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary contains information about a particular skill. The 'id' key is the unique identifier for the skill, the 'nested_skills' key is a list of skills that are related to this skill, the 'parent_skills' key is a list of skills that this skill is related to, the 'repository_id' key is the id of the repository that this skill is stored in, the 'created_at' key is the date that this skill was created, the 'updated_at' key is the date that this skill was last updated, the 'name' key is the name of the skill, the 'level' key is the level of the skill, and the 'description' key is a description of the skill.",
        "created_at": "2023-11-13T14:23:11.291Z",
        "updated_at": "2023-11-20T07:51:13.199Z"
    },
    {
        "id": 1829,
        "owner": [],
        "entity_id": "2047",
        "entity_id_full": "sse/skill/2047",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a skill called \"Arten von Assistenzsystemen\". The skill has an id of 2047, and it is a top-level skill (its parent skills are listed in the \"parent_skills\" key). The skill was created on 2023-11-20T07:51:13.202Z and last updated on 2023-11-20T07:51:13.202Z. The skill has a level of 1 and does not have a description.",
        "created_at": "2023-11-13T14:23:11.293Z",
        "updated_at": "2023-11-20T07:51:13.202Z"
    },
    {
        "id": 1809,
        "owner": [],
        "entity_id": "2045",
        "entity_id_full": "sse/skill/2045",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains key value pairs describing a skill. The id key corresponds to the skill's unique identifier, while the nested_skills key corresponds to a list of skills related to the skill. The parent_skills key corresponds to a list of skills on which the skill is based. The repository_id key corresponds to the skill's repository identifier, while the created_at key corresponds to the skill's creation date. The updated_at key corresponds to the skill's update date, and the name key corresponds to the skill's name. The level key corresponds to the skill's level, while the description key corresponds to a description of the skill.",
        "created_at": "2023-11-13T14:23:11.292Z",
        "updated_at": "2023-11-20T07:51:13.200Z"
    },
    {
        "id": 1807,
        "owner": [],
        "entity_id": "2049",
        "entity_id_full": "sse/skill/2049",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Assistenzsysteme in der Produktion\". The skill has an id of 2049, and a level of 1. The skill is part of the parent skill \"Grundlagen Arbeit 4.0\". The skill was created on 2023-11-20T07:51:13.205Z and updated on 2023-11-20T07:51:13.205Z.",
        "created_at": "2023-11-13T14:23:11.296Z",
        "updated_at": "2023-11-20T07:51:13.205Z"
    },
    {
        "id": 1830,
        "owner": [],
        "entity_id": "2052",
        "entity_id_full": "sse/skill/2052",
        "entity_type": "skill",
        "contents": "\n\n\nThe id value is the unique identifier for this particular dictionary.\n\nThe nested_skills value is a list of all the skills that are considered to be part of this skill.\n\nThe parent_skills value is a list of all the skills that this skill is considered to be a part of.\n\nThe repository_id value is the identifier for the repository that this skill is associated with.\n\nThe created_at value is the date and time when this skill was created.\n\nThe updated_at value is the date and time when this skill was last updated.\n\nThe name value is the name of this skill.\n\nThe level value is the level of this skill.\n\nThe description value is a description of this skill.",
        "created_at": "2023-11-13T14:23:11.301Z",
        "updated_at": "2023-11-20T07:51:13.207Z"
    },
    {
        "id": 1811,
        "owner": [],
        "entity_id": "2046",
        "entity_id_full": "sse/skill/2046",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a system called \"Definition Assistenzsysteme.\" The system has an id of 2046, and was created on 2023-11-20T07:51:13.201Z. The system was last updated on 2023-11-20T07:51:13.201Z. The system has one parent skill, called \"Grundlagen Arbeit 4.0.\" The system does not have any nested skills. The system has a level of 1 and does not have a description.",
        "created_at": "2023-11-13T14:23:11.292Z",
        "updated_at": "2023-11-20T07:51:13.201Z"
    },
    {
        "id": 1876,
        "owner": [],
        "entity_id": "2062",
        "entity_id_full": "sse/skill/2062",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill called \"Grundlagen der Sensorik\" with the following properties:\n* id: 2062\n* nested_skills (empty list)\n* parent_skills (list containing one element: \"Grundlagen Produktionstechnik\")\n* repository_id: 2\n* created_at: 2023-11-20T07:51:13.216Z\n* updated_at: 2023-11-20T07:51:13.216Z\n* name: Grundlagen der Sensorik\n* level: 1\n* description: (null value)",
        "created_at": "2023-11-13T14:23:11.307Z",
        "updated_at": "2023-11-20T07:51:13.216Z"
    },
    {
        "id": 1831,
        "owner": [],
        "entity_id": "2064",
        "entity_id_full": "sse/skill/2064",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill. The id is the unique identifier for the skill, the name is the name of the skill, the level indicates the level of expertise required for the skill, and the description provides a brief overview of the skill. The nested_skills and parent_skills keys provide information about related skills. The repository_id key indicates the id of the repository that stores this skill information, and the created_at and updated_at keys provide timestamps for when the skill was created and last updated.",
        "created_at": "2023-11-13T14:23:11.308Z",
        "updated_at": "2023-11-20T07:51:13.218Z"
    },
    {
        "id": 2000,
        "owner": [],
        "entity_id": "2072",
        "entity_id_full": "sse/skill/2072",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary consists of key value pairs that store information about Automatisierte Routenplanung. The keys in the dictionary are \"id\", \"nested_skills\", \"parent_skills\", \"repository_id\", \"created_at\", \"updated_at\", \"name\", \"level\", and \"description\". The values associated with each of these keys are 2072, [], ['Grundlagen Produktionstechnik'], 2, 2023-11-20T07:51:13.225Z, 2023-11-20T07:51:13.225Z, Automatisierte Routenplanung, 1, and None.\n\nThe key \"id\" stores the unique identifier for Automatisierte Routenplanung. The key \"nested_skills\" stores a list of skills that are related to Automatisierte Routenplanung. The key \"parent_skills\" stores a list of skills that are required to be learned before Automatisierte Routenplanung can be mastered. The key \"repository_id\" stores the identifier for the repository where Automatisierte Routenplanung is stored. The",
        "created_at": "2023-11-13T14:23:11.313Z",
        "updated_at": "2023-11-20T07:51:13.225Z"
    },
    {
        "id": 1832,
        "owner": [],
        "entity_id": "2074",
        "entity_id_full": "sse/skill/2074",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key-value pairs:\n- id: 2074\n- nested_skills: []\n- parent_skills: ['Grundlagen Produktionstechnik']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.226Z\n- updated_at: 2023-11-20T07:51:13.226Z\n- name: Anwendung der additiven Fertigungsverfahren\n- level: 1\n- description: None\n\nThe id key-value pair refers to the unique identifier for the dictionary. The nested_skills key-value pair refers to a list of skills that are related to this skill. The parent_skills key-value pair refers to a list of skills that this skill is a sub-skill of. The repository_id key-value pair refers to the id of the repository that this skill is stored in. The created_at key-value pair refers to the date and time that this skill was created. The updated_at key-value pair refers to the date and time that this skill was last updated. The name",
        "created_at": "2023-11-13T14:23:11.314Z",
        "updated_at": "2023-11-20T07:51:13.226Z"
    },
    {
        "id": 1878,
        "owner": [],
        "entity_id": "2078",
        "entity_id_full": "sse/skill/2078",
        "entity_type": "skill",
        "contents": "\n\n\n\nThe dictionary has four key-value pairs.\n\nThe first pair is the \"id\" and \"2078\". This is the identifier for the skill.\n\nThe second pair is the \"nested_skills\" and \"[]\". This is an empty list that will hold any skills that are subordinate to this skill.\n\nThe third pair is the \"parent_skills\" and \"['Big Data']\". This is a list of skills that this skill is subordinate to. In this case, the skill is subordinate to the \"Big Data\" skill.\n\nThe fourth pair is the \"repository_id\" and \"2\". This is the identifier for the repository that this skill belongs to.",
        "created_at": "2023-11-13T14:23:11.317Z",
        "updated_at": "2023-11-20T07:51:13.229Z"
    },
    {
        "id": 1915,
        "owner": [],
        "entity_id": "2080",
        "entity_id_full": "sse/skill/2080",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains four key-value pairs. The id key is associated with the value 2080, the nested_skills key is associated with an empty list, the parent_skills key is associated with a list containing the string \"Big Data\", and the repository_id key is associated with the integer value 2. The created_at and updated_at keys are both associated with the string \"2023-11-20T07:51:13.231Z\". The name key is associated with the string \"4-V-Modell\" and the level key is associated with the integer value 1. The description key is associated with the value None.",
        "created_at": "2023-11-13T14:23:11.317Z",
        "updated_at": "2023-11-20T07:51:13.231Z"
    },
    {
        "id": 1833,
        "owner": [],
        "entity_id": "2086",
        "entity_id_full": "sse/skill/2086",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents a skill on the website. The skill has an ID of 2086, a name of \"Arten von Wissen\", and a level of 1. The skill has no parent skills and no nested skills. The skill was created on 2023-11-20T07:51:13.236Z and updated on 2023-11-20T07:51:13.236Z.",
        "created_at": "2023-11-13T14:23:11.321Z",
        "updated_at": "2023-11-20T07:51:13.236Z"
    },
    {
        "id": 1896,
        "owner": [],
        "entity_id": "2087",
        "entity_id_full": "sse/skill/2087",
        "entity_type": "skill",
        "contents": "\n\nThe following Python dictionary is a description of a data repository. The id is the unique identifier for the repository, the nested_skills is a list of skills related to the repository, the parent_skills is a list of skills that the repository is a part of, the repository_id is the id of the repository, the created_at is the date when the repository was created, the updated_at is the date when the repository was last updated, the name is the name of the repository, the level is the level of the repository, and the description is a brief description of the repository.",
        "created_at": "2023-11-13T14:23:11.321Z",
        "updated_at": "2023-11-20T07:51:13.237Z"
    },
    {
        "id": 1919,
        "owner": [],
        "entity_id": "2094",
        "entity_id_full": "sse/skill/2094",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs:\n- id: 2094\n- nested_skills: []\n- parent_skills: ['Produktionsplanung und -steuerung']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.241Z\n- updated_at: 2023-11-20T07:51:13.241Z\n- name: Beispiel Lieferkettenmodell\n- level: 1\n- description: None\n\nThe id key has a value of 2094, meaning that this is the unique identifier for this particular dictionary. The nested_skills key has a value of [], meaning that there are no nested skills within this dictionary. The parent_skills key has a value of ['Produktionsplanung und -steuerung'], meaning that this dictionary has a parent skill of production planning and control. The repository_id key has a value of 2, meaning that this dictionary is located in repository 2. The created_at key has a value of 2023-11-20T07:51:13.241Z, meaning that this dictionary was created on November",
        "created_at": "2023-11-13T14:23:11.325Z",
        "updated_at": "2023-11-20T07:51:13.241Z"
    },
    {
        "id": 1920,
        "owner": [],
        "entity_id": "2096",
        "entity_id_full": "sse/skill/2096",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill called \"Einführung in MES\" with the ID 2096. The skill has no nested skills and the parent skill is \"Produktionsplanung und -steuerung\". The skill is stored in repository 2 and was created on 2023-11-20T07:51:13.241Z. The skill was last updated on 2023-11-20T07:51:13.241Z. The skill is at level 1 and has no description.",
        "created_at": "2023-11-13T14:23:11.327Z",
        "updated_at": "2023-11-20T07:51:13.241Z"
    },
    {
        "id": 1817,
        "owner": [],
        "entity_id": "2103",
        "entity_id_full": "sse/skill/2103",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains 4 key value pairs. The first key is \"id\" and the value is \"2103\". This is the unique identifier for the dictionary. The second key is \"nested_skills\" and the value is an empty list. This means that there are no skills nested under this skill. The third key is \"parent_skills\" and the value is a list containing one element, \"Produktionsplanung und -steuerung\". This means that the skill \"Schwachstellen ausgleichen mit MES\" is a sub-skill of \"Produktionsplanung und -steuerung\". The fourth key is \"name\" and the value is \"Schwachstellen ausgleichen mit MES\". This is the name of the skill.",
        "created_at": "2023-11-13T14:23:11.329Z",
        "updated_at": "2023-11-20T07:51:13.243Z"
    },
    {
        "id": 1950,
        "owner": [],
        "entity_id": "2105",
        "entity_id_full": "sse/skill/2105",
        "entity_type": "skill",
        "contents": "\n\n\nThe id is 2105, the nested_skills are [], the parent_skills are ['Produktionsplanung und -steuerung'], the repository_id is 2, the created_at is 2023-11-20T07:51:13.244Z, the updated_at is 2023-11-20T07:51:13.244Z, the name is Beispiel Industrie 4.0, Digitalisierung und Vernetzung, the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.330Z",
        "updated_at": "2023-11-20T07:51:13.244Z"
    },
    {
        "id": 1898,
        "owner": [],
        "entity_id": "2108",
        "entity_id_full": "sse/skill/2108",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information on a particular skill, including the skill's id number, name, description, and level. The skill is also nested within two other skills, 'Werkzeugkoffer 4.0' and 'Ziele des Lean Managements'. The dictionary also includes information on when the skill was created and last updated.",
        "created_at": "2023-11-13T14:23:11.332Z",
        "updated_at": "2023-11-20T07:51:13.245Z"
    },
    {
        "id": 2004,
        "owner": [],
        "entity_id": "2114",
        "entity_id_full": "sse/skill/2114",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, repository_id. The value associated with the id key is 2114. The value associated with the nested_skills key is an empty list. The value associated with the parent_skills key is a list with one element, 'Werkzeugkoffer 4.0'. The value associated with the repository_id key is 2. The value associated with the created_at key is 2023-11-20T07:51:13.247Z. The value associated with the updated_at key is 2023-11-20T07:51:13.247Z. The value associated with the name key is Voraussetzungen für Kanban. The value associated with the level key is 1. The value associated with the description key is None.",
        "created_at": "2023-11-13T14:23:11.334Z",
        "updated_at": "2023-11-20T07:51:13.247Z"
    },
    {
        "id": 1882,
        "owner": [],
        "entity_id": "2117",
        "entity_id_full": "sse/skill/2117",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill, including the skill's id, name, level, description, when it was created and updated, as well as its parent skills and nested skills.",
        "created_at": "2023-11-13T14:23:11.335Z",
        "updated_at": "2023-11-20T07:51:13.248Z"
    },
    {
        "id": 1925,
        "owner": [],
        "entity_id": "2122",
        "entity_id_full": "sse/skill/2122",
        "entity_type": "skill",
        "contents": "\n\n\n\nThe dictionary includes the following key value pairs:\n\n- id: the unique identifier for the PDCA cycle\n- nested_skills: a list of skills that are part of the PDCA cycle\n- parent_skills: a list of skills that the PDCA cycle depends on\n- repository_id: the id of the repository that the PDCA cycle is stored in\n- created_at: the date and time when the PDCA cycle was created\n- updated_at: the date and time when the PDCA cycle was last updated\n- name: the name of the PDCA cycle\n- level: the level of the PDCA cycle\n- description: a description of the PDCA cycle",
        "created_at": "2023-11-13T14:23:11.338Z",
        "updated_at": "2023-11-20T07:51:13.250Z"
    },
    {
        "id": 1883,
        "owner": [],
        "entity_id": "2127",
        "entity_id_full": "sse/skill/2127",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n\n- id: 2127\n- nested_skills: []\n- parent_skills: ['Werkzeugkoffer 4.0']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.251Z\n- updated_at: 2023-11-20T07:51:13.251Z\n- name: Voraussetzungen für Just-in-Time\n- level: 1\n- description: None\n\nThe id key refers to the unique identifier of the skill, in this case 2127. The nested_skills key indicates any skills that are child skills of this skill, in this case there are none. The parent_skills key refers to any parent skills of this skill, in this case the parent skill is 'Werkzeugkoffer 4.0'. The repository_id key refers to the id of the repository that this skill belongs to, in this case 2. The created_at and updated_at keys refer to the date and time when the skill was created and last updated, respectively. The name key contains the name of the skill",
        "created_at": "2023-11-13T14:23:11.340Z",
        "updated_at": "2023-11-20T07:51:13.251Z"
    },
    {
        "id": 1820,
        "owner": [],
        "entity_id": "2130",
        "entity_id_full": "sse/skill/2130",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a skill called \"Definition FIFO\" including its id, repository_id, name, level, and description. The skill is part of a group of skills called \"Werkzeugkoffer 4.0\" and does not have any sub-skills or parent skills. The skill was created on 2023-11-20T07:51:13.252Z and updated on the same date.",
        "created_at": "2023-11-13T14:23:11.341Z",
        "updated_at": "2023-11-20T07:51:13.252Z"
    },
    {
        "id": 1838,
        "owner": [],
        "entity_id": "2138",
        "entity_id_full": "sse/skill/2138",
        "entity_type": "skill",
        "contents": "\n\nSkills are the key to success in any field, and this dictonary is no different. The id key is the unique identifier for this skill, while nested_skills and parent_skills are lists of skills that are related to this one. repository_id is the id of the repository this skill was created in, while created_at and updated_at are the dates when this skill was created and last updated. Finally, name is the name of the skill, level is the skill's level, and description is a brief description of the skill.",
        "created_at": "2023-11-13T14:23:11.344Z",
        "updated_at": "2023-11-20T07:51:13.256Z"
    },
    {
        "id": 1839,
        "owner": [],
        "entity_id": "2142",
        "entity_id_full": "sse/skill/2142",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, and description. The id is a unique identifier for the skill. The nested_skills key indicates skills that are subordinate to this skill, and the parent_skills key indicates skills that this skill is subordinate to. The repository_id indicates the id of the skill repository that this skill belongs to. The created_at and updated_at keys indicate when the skill was created and last updated, respectively. The name key indicates the name of the skill, and the level key indicates the skill's level in a hierarchical skill tree. The description key provides a description of the skill.",
        "created_at": "2023-11-13T14:23:11.347Z",
        "updated_at": "2023-11-20T07:51:13.258Z"
    },
    {
        "id": 1822,
        "owner": [],
        "entity_id": "2144",
        "entity_id_full": "sse/skill/2144",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four key value pairs. The first pair is the id and the value is 2144. The second pair is the nested_skills and the value is an empty list. The third pair is the parent_skills and the value is a list with one element, 'Fertigung 4.0'. The fourth pair is the repository_id and the value is 2.",
        "created_at": "2023-11-13T14:23:11.349Z",
        "updated_at": "2023-11-20T07:51:13.259Z"
    },
    {
        "id": 1885,
        "owner": [],
        "entity_id": "2146",
        "entity_id_full": "sse/skill/2146",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a particular skill called \"Einsatzbereiche der additiven Fertigug.\" The skill is part of a larger skill called \"Fertigung 4.0.\" The skill has an id of 2146, and was created on 2023-11-20T07:51:13.260Z. It was last updated on 2023-11-20T07:51:13.260Z. The skill is at level 1 and has no description.",
        "created_at": "2023-11-13T14:23:11.350Z",
        "updated_at": "2023-11-20T07:51:13.260Z"
    },
    {
        "id": 1956,
        "owner": [],
        "entity_id": "2158",
        "entity_id_full": "sse/skill/2158",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary is describing a skill called \"Steuerung von Assistenzsystemen\" which is a child skill of the parent skill \"Assistenzsysteme\". The dictionary includes the skill's id, the date the skill was created and updated, the skill's name and level, and a description of the skill.",
        "created_at": "2023-11-13T14:23:11.356Z",
        "updated_at": "2023-11-20T07:51:13.265Z"
    },
    {
        "id": 1903,
        "owner": [],
        "entity_id": "2156",
        "entity_id_full": "sse/skill/2156",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes four keys: id, nested_skills, parent_skills, repository_id. The id key refers to the identification number of the dictionary, which is 2156. The nested_skills key refers to a list of skills that are related to the skill represented by the dictionary, which is empty in this case. The parent_skills key refers to a list of skills of which the skill represented by the dictionary is a subset, which is ['Assistenzsysteme'] in this case. The repository_id key refers to the identification number of the repository in which the skill is stored, which is 2 in this case. The created_at key refers to the date and time when the skill was created, which is 2023-11-20T07:51:13.264Z in this case. The updated_at key refers to the date and time when the skill was last updated, which is 2023-11-20T07:51:13.264Z in this case. The name key refers to the name of the skill, which is Definition Künstliche Intelligenz II in this case. The level key refers to the level of the skill, which is 1 in this",
        "created_at": "2023-11-13T14:23:11.354Z",
        "updated_at": "2023-11-20T07:51:13.264Z"
    },
    {
        "id": 1824,
        "owner": [],
        "entity_id": "2167",
        "entity_id_full": "sse/skill/2167",
        "entity_type": "skill",
        "contents": "\n\nThe following dictionary represents a skill, which has an id of 2167, no nested skills, one parent skill of 'Sensorik', a repository id of 2, a created date of 2023-11-20T07:51:13.268Z, and an updated date of 2023-11-20T07:51:13.268Z. The skill's name is 'Funktionsprinzip von Messeinrichtungen' and it is level 1. There is no description for the skill.",
        "created_at": "2023-11-13T14:23:11.362Z",
        "updated_at": "2023-11-20T07:51:13.268Z"
    },
    {
        "id": 1958,
        "owner": [],
        "entity_id": "2171",
        "entity_id_full": "sse/skill/2171",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a skill called \"Messprinzipien von Sensoren\" which is part of a larger skill tree on sensors. The dictionary includes the id of the skill, when it was created and updated, the name of the skill, the level within the skill tree, and a description. This particular skill is a top level skill, with no child skills or parent skills.",
        "created_at": "2023-11-13T14:23:11.364Z",
        "updated_at": "2023-11-20T07:51:13.269Z"
    },
    {
        "id": 1825,
        "owner": [],
        "entity_id": "2175",
        "entity_id_full": "sse/skill/2175",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill. The id refers to the unique identifier for the skill, nested_skills refers to any skills that are contained within this skill, parent_skills refers to any skills that this skill is a part of, repository_id refers to the repository that this skill is contained in, created_at refers to the date and time that the skill was created, updated_at refers to the date and time that the skill was last updated, name refers to the name of the skill, level refers to the level of the skill, and description refers to a description of the skill.",
        "created_at": "2023-11-13T14:23:11.369Z",
        "updated_at": "2023-11-20T07:51:13.270Z"
    },
    {
        "id": 1872,
        "owner": [],
        "entity_id": "2180",
        "entity_id_full": "sse/skill/2180",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents a skill in a skill tree. The id is the unique identifier for this skill, the nested_skills is a list of skills that are subordinate to this skill, the parent_skills is a list of skills that this skill is subordinate to, the repository_id is the id of the skill repository that this skill is part of, the created_at is the date when this skill was created, the updated_at is the date when this skill was last updated, the name is the name of this skill, the level is the level of this skill in the skill tree, and the description is a description of this skill.",
        "created_at": "2023-11-13T14:23:11.371Z",
        "updated_at": "2023-11-20T07:51:13.273Z"
    },
    {
        "id": 1959,
        "owner": [],
        "entity_id": "2185",
        "entity_id_full": "sse/skill/2185",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary seems to store information about a particular task or example. The 'id' is presumably a unique identifier for this task, while 'nested_skills' and 'parent_skills' could store information about which skills are required to complete the task, or which skills the task falls under. 'repository_id' might refer to where this task is stored, while 'created_at' and 'updated_at' give timestamps for when the task was originally created, and when it was last updated. 'name' simply seems to be the name of the task, and 'level' might represent the difficulty of the task. 'description' is set to 'None' so it presumably contains no information.",
        "created_at": "2023-11-13T14:23:11.373Z",
        "updated_at": "2023-11-20T07:51:13.274Z"
    },
    {
        "id": 1890,
        "owner": [],
        "entity_id": "2188",
        "entity_id_full": "sse/skill/2188",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill called \"Fertigungsprinzipien\" with the id 2188. This skill has no nested skills and its parent skills are \"Grundlagen innerbetrieblicher Materialfluss\". The repository_id is 2 and the skill was created_at 2023-11-20T07:51:13.274Z and updated_at 2023-11-20T07:51:13.274Z. The level of the skill is 1 and it has no description.",
        "created_at": "2023-11-13T14:23:11.374Z",
        "updated_at": "2023-11-20T07:51:13.274Z"
    },
    {
        "id": 1844,
        "owner": [],
        "entity_id": "2194",
        "entity_id_full": "sse/skill/2194",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has four key value pairs. The first key is \"id\" and the value is \"2194\". The second key is \"nested_skills\" and the value is an empty list. The third key is \"parent_skills\" and the value is a list containing one element, \"Grundlagen innerbetrieblicher Materialfluss\". The fourth key is \"repository_id\" and the value is \"2\".\n\nThe \"id\" key corresponds to the unique identifier of the dictionary. The \"nested_skills\" key corresponds to a list of skills that are contained within this skill. The \"parent_skills\" key corresponds to a list of skills that this skill is a sub-skill of. The \"repository_id\" key corresponds to the id of the repository that this skill belongs to.",
        "created_at": "2023-11-13T14:23:11.378Z",
        "updated_at": "2023-11-20T07:51:13.276Z"
    },
    {
        "id": 2013,
        "owner": [],
        "entity_id": "2198",
        "entity_id_full": "sse/skill/2198",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes the different aspects and applications of RFID technology. The id refers to the unique identifier assigned to the RFID technology, nested_skills refers to the different skills required to use RFID technology, parent_skills refers to the skill required to use the RFID technology, repository_id refers to the unique identifier assigned to the RFID technology, created_at refers to the date when RFID technology was first created, and updated_at refers to the date when RFID technology was last updated. The name refers to the name of the RFID technology, level refers to the different levels of RFID technology, and description refers to a brief description of what RFID technology is.",
        "created_at": "2023-11-13T14:23:11.380Z",
        "updated_at": "2023-11-20T07:51:13.277Z"
    },
    {
        "id": 1892,
        "owner": [],
        "entity_id": "2051",
        "entity_id_full": "sse/skill/2051",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill called \"Definition Ergonomie\" with the ID 2051. It is a top-level skill (i.e. it has no parent skills) and it is stored in repository 2. The skill was created on 2023-11-20T07:51:13.206Z and last updated on the same date.",
        "created_at": "2023-11-13T14:23:11.299Z",
        "updated_at": "2023-11-20T07:51:13.206Z"
    },
    {
        "id": 1812,
        "owner": [],
        "entity_id": "2058",
        "entity_id_full": "sse/skill/2058",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary has four key-value pairs. The first key is \"id\" and the corresponding value is 2058. This is the unique identifier for the dictionary. The second key is \"nested_skills\" and the corresponding value is an empty list. This indicates that there are no sub-skills associated with this skill. The third key is \"parent_skills\" and the corresponding value is a list containing one element, \"Grundlagen Produktionstechnik\". This indicates that this skill is a sub-skill of \"Grundlagen Produktionstechnik\". The fourth key is \"repository_id\" and the corresponding value is 2. This indicates the id of the repository that this skill is associated with.",
        "created_at": "2023-11-13T14:23:11.304Z",
        "updated_at": "2023-11-20T07:51:13.212Z"
    },
    {
        "id": 1860,
        "owner": [],
        "entity_id": "2069",
        "entity_id_full": "sse/skill/2069",
        "entity_type": "skill",
        "contents": "\n\n\nThe id key value pair defines the id of the object as 2069. The nested_skills key value pair defines the nested skills of the object as an empty list. The parent_skills key value pair defines the parent skills of the object as a list containing the string \"Grundlagen Produktionstechnik\". The repository_id key value pair defines the repository id of the object as 2. The created_at key value pair defines the date and time when the object was created as 2023-11-20T07:51:13.222Z. The updated_at key value pair defines the date and time when the object was last updated as 2023-11-20T07:51:13.222Z. The name key value pair defines the name of the object as the string \"Definition Smartes Feldgerät\". The level key value pair defines the level of the object as 1. The description key value pair defines the description of the object as None.",
        "created_at": "2023-11-13T14:23:11.311Z",
        "updated_at": "2023-11-20T07:51:13.222Z"
    },
    {
        "id": 1916,
        "owner": [],
        "entity_id": "2085",
        "entity_id_full": "sse/skill/2085",
        "entity_type": "skill",
        "contents": "\n\n\nThe id key value pair represents the unique identifier for this particular skill. The nested_skills key value pair represents a list of skills that are related to this skill. The parent_skills key value pair represents a list of skills that this skill is related to. The repository_id key value pair represents the unique identifier for the repository that this skill is part of. The created_at key value pair represents the date and time that this skill was created. The updated_at key value pair represents the date and time that this skill was last updated. The name key value pair represents the name of this skill. The level key value pair represents the level of this skill. The description key value pair represents a description of this skill.",
        "created_at": "2023-11-13T14:23:11.320Z",
        "updated_at": "2023-11-20T07:51:13.234Z"
    },
    {
        "id": 1816,
        "owner": [],
        "entity_id": "2093",
        "entity_id_full": "sse/skill/2093",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Definition Produktionsplanung und -steuerung\". The id of the skill is 2093. The skill has no nested skills and its parent skills are \"Produktionsplanung und -steuerung\". The repository_id is 2 and the skill was created_at on 2023-11-20T07:51:13.240Z. The skill was updated_at on 2023-11-20T07:51:13.240Z. The name of the skill is \"Definition Produktionsplanung und -steuerung\". The level is 1 and the description is None.",
        "created_at": "2023-11-13T14:23:11.325Z",
        "updated_at": "2023-11-20T07:51:13.240Z"
    },
    {
        "id": 1906,
        "owner": [],
        "entity_id": "2186",
        "entity_id_full": "sse/skill/2186",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill, including the skill's id, name, level, description, and when it was created and updated. It also lists the skill's parent skills and nested skills.",
        "created_at": "2023-11-13T14:23:11.373Z",
        "updated_at": "2023-11-20T07:51:13.276Z"
    },
    {
        "id": 1880,
        "owner": [],
        "entity_id": "2098",
        "entity_id_full": "sse/skill/2098",
        "entity_type": "skill",
        "contents": "\n\nThe \"id\" key refers to the unique identification number of the software, which is \"2098\". The \"nested_skills\" key is an empty list because the software does not have any nested skills. The \"parent_skills\" key refers to the skills that the software is related to, which are \"Produktionsplanung und -steuerung\". The \"repository_id\" key refers to the id of the repository that the software is stored in, which is \"2\". The \"created_at\" key refers to the date and time when the software was created, which is \"2023-11-20T07:51:13.242Z\". The \"updated_at\" key refers to the date and time when the software was last updated, which is \"2023-11-20T07:51:13.242Z\". The \"name\" key refers to the name of the software, which is \"Softwaresystem ERP\". The \"level\" key refers to the level of the software, which is \"1\". The \"description\" key is set to \"None\" because the software does not have a description.",
        "created_at": "2023-11-13T14:23:11.327Z",
        "updated_at": "2023-11-20T07:51:13.242Z"
    },
    {
        "id": 1955,
        "owner": [],
        "entity_id": "2112",
        "entity_id_full": "sse/skill/2112",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains information about a Kanban Definition. The id is the unique identifier for the KanbanDefinition. The nested_skills field is a list of skills that are related to this Kanban Definition. The parent_skills field is a list of skills that are required to be mastered before this Kanban Definition can be started. The repository_id is the id of the repository that this Kanban Definition is associated with. The created_at field is the date and time when the Kanban Definition was created. The updated_at field is the date and time when the Kanban Definition was last updated. The name is the name of the Kanban Definition. The level indicates the difficulty level of the Kanban Definition. The description field contains a brief description of the Kanban Definition.",
        "created_at": "2023-11-13T14:23:11.334Z",
        "updated_at": "2023-11-20T07:51:13.246Z"
    },
    {
        "id": 1819,
        "owner": [],
        "entity_id": "2121",
        "entity_id_full": "sse/skill/2121",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 2121\n- nested_skills: []\n- parent_skills: ['Werkzeugkoffer 4.0']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.249Z\n- updated_at: 2023-11-20T07:51:13.249Z\n- name: Phasen des PDCA-Zyklus\n- level: 1\n- description: None\n\nThe id is the unique identifier for the skill and is used to reference the skill in the database. The nested_skills is an empty list which indicates that this skill does not have any sub-skills. The parent_skills contains a list of skills that this skill is a sub-skill of. In this case, the skill is a sub-skill of the 'Werkzeugkoffer 4.0' skill. The repository_id is the id of the repository that this skill belongs to. The created_at and updated_at fields store the date and time when the skill was created and last updated. The name field stores the name of the",
        "created_at": "2023-11-13T14:23:11.337Z",
        "updated_at": "2023-11-20T07:51:13.249Z"
    },
    {
        "id": 1953,
        "owner": [],
        "entity_id": "2133",
        "entity_id_full": "sse/skill/2133",
        "entity_type": "skill",
        "contents": "\n\n\nThe id is 2133, the nested_skills is an empty list, the parent_skills is a list containing the string \"Werkzeugkoffer 4.0\", the repository_id is 2, the created_at is a date object 2023-11-20T07:51:13.253Z, the updated_at is also a date object 2023-11-20T07:51:13.253Z, the name is a string \"Vor- und Nachteile von FIFO\", the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.342Z",
        "updated_at": "2023-11-20T07:51:13.253Z"
    },
    {
        "id": 1928,
        "owner": [],
        "entity_id": "2135",
        "entity_id_full": "sse/skill/2135",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary describes a goal of a spaghetti diagram, specifically goal number 2135. The goal has no nested skills or parent skills associated with it, and it is located in repository number 2. The goal was created on November 20th, 2023 at 7:51:13 am, and last updated on the same day at the same time. The goal's name is \"Ziele des Spaghetti-Diagramms\" and it is level 1. There is no description associated with this goal.",
        "created_at": "2023-11-13T14:23:11.343Z",
        "updated_at": "2023-11-20T07:51:13.254Z"
    },
    {
        "id": 1868,
        "owner": [],
        "entity_id": "2145",
        "entity_id_full": "sse/skill/2145",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains information on a certain manufacturing process. The id refers to the unique identifier of the process, while the nested_skills and parent_skills keys contain lists of skills related to the manufacturing process. The repository_id is the identifier of the repository where this manufacturing process is stored, while the created_at and updated_at keys contain timestamps for when the process was created and updated, respectively. The name key contains the name of the manufacturing process, while the level key indicates the level of difficulty of the process. Finally, the description key contains a description of the manufacturing process.",
        "created_at": "2023-11-13T14:23:11.349Z",
        "updated_at": "2023-11-20T07:51:13.260Z"
    },
    {
        "id": 2009,
        "owner": [],
        "entity_id": "2160",
        "entity_id_full": "sse/skill/2160",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary {id: 2160, nested_skills: [], parent_skills: ['Assistenzsysteme'], repository_id: 2, created_at: 2023-11-20T07:51:13.266Z, updated_at: 2023-11-20T07:51:13.266Z, name: Aktorik von Assistenzsystemen, level: 1, description: None} has the following key value pairs:\n\n-id: 2160\n-nested_skills: []\n-parent_skills: ['Assistenzsysteme']\n-repository_id: 2\n-created_at: 2023-11-20T07:51:13.266Z\n-updated_at: 2023-11-20T07:51:13.266Z\n-name: Aktorik von Assistenzsystemen\n-level: 1\n-description: None",
        "created_at": "2023-11-13T14:23:11.358Z",
        "updated_at": "2023-11-20T07:51:13.266Z"
    },
    {
        "id": 1887,
        "owner": [],
        "entity_id": "2164",
        "entity_id_full": "sse/skill/2164",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"SI-Einheiten\" which is a level 1 skill with no parent skills and no nested skills. The skill was created on 2023-11-20T07:51:13.267Z and last updated on 2023-11-20T07:51:13.267Z. The repository_id is 2 and the id is 2164.",
        "created_at": "2023-11-13T14:23:11.360Z",
        "updated_at": "2023-11-20T07:51:13.267Z"
    },
    {
        "id": 1938,
        "owner": [],
        "entity_id": "2177",
        "entity_id_full": "sse/skill/2177",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents a skill called \"Definition Sensoren zur Temperaturmessung\" with an ID of 2177. The skill has no nested skills and one parent skill called \"Sensorik\". The skill was created on 2023-11-20T07:51:13.271Z and last updated on 2023-11-20T07:51:13.271Z. The skill is at level 1 and has no description.",
        "created_at": "2023-11-13T14:23:11.370Z",
        "updated_at": "2023-11-20T07:51:13.271Z"
    },
    {
        "id": 1940,
        "owner": [],
        "entity_id": "2187",
        "entity_id_full": "sse/skill/2187",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a particular skill, including the skill's id number, name, level, description, and when the skill was created and updated. The skill also has a list of parent skills and nested skills associated with it.",
        "created_at": "2023-11-13T14:23:11.374Z",
        "updated_at": "2023-11-20T07:51:13.274Z"
    },
    {
        "id": 1907,
        "owner": [],
        "entity_id": "2192",
        "entity_id_full": "sse/skill/2192",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill, specifically its id, name, level, and description. The id is used to identify the skill, the name is the actual name of the skill, the level defines how difficult the skill is, and the description provides more information about what the skill entails. The nested_skills and parent_skills keys are used to identify what skills are required to learn the skill in question, and the repository_id is used to identify where the skill is located. The created_at and updated_at keys are used to track when the skill was first created and last updated.",
        "created_at": "2023-11-13T14:23:11.376Z",
        "updated_at": "2023-11-20T07:51:13.275Z"
    },
    {
        "id": 1913,
        "owner": [],
        "entity_id": "2071",
        "entity_id_full": "sse/skill/2071",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Selbststeuerung/Autonomie\" (self-regulation/autonomy). The skill has an id of 2071, is at level 1, and was created on 2023-11-20T07:51:13.224Z. There is no description for the skill. The skill has no nested skills, but does have the parent skill \"Grundlagen Produktionstechnik\" (basics of production technology). The repository_id is 2, which likely means that the skill is part of a larger collection of skills (repository).",
        "created_at": "2023-11-13T14:23:11.312Z",
        "updated_at": "2023-11-20T07:51:13.224Z"
    },
    {
        "id": 1998,
        "owner": [],
        "entity_id": "2053",
        "entity_id_full": "sse/skill/2053",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 2053\n- nested_skills: []\n- parent_skills: ['Grundlagen Produktionstechnik']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.208Z\n- updated_at: 2023-11-20T07:51:13.208Z\n- name: Anwendungsbeispiele Digitale Fabrik\n- level: 1\n- description: None\n\nThe id key is the unique identifier for the dictionary, the nested_skills key is an empty list indicating there are no nested skills, the parent_skills key is a list containing the parent skill 'Grundlagen Produktionstechnik', the repository_id key is the id of the repository this skill is stored in, the created_at and updated_at keys are the timestamps for when the skill was created and last updated, the name key is the name of the skill, the level key is the level of the skill, and the description key is set to None indicating there is no description for the skill",
        "created_at": "2023-11-13T14:23:11.300Z",
        "updated_at": "2023-11-20T07:51:13.208Z"
    },
    {
        "id": 1859,
        "owner": [],
        "entity_id": "2060",
        "entity_id_full": "sse/skill/2060",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains four key value pairs. The first key is \"id\" and the corresponding value is 2060. This is the identification number for the dictionary. The second key is \"nested_skills\" and the corresponding value is an empty list. This indicates that there are no nested skills associated with this dictionary. The third key is \"parent_skills\" and the corresponding value is a list containing one element, \"Grundlagen Produktionstechnik\". This indicates that the skill \"Grundlagen Produktionstechnik\" is a parent skill of the skill represented by this dictionary. The fourth key is \"repository_id\" and the corresponding value is 2. This is the identification number of the repository in which this dictionary is stored.",
        "created_at": "2023-11-13T14:23:11.306Z",
        "updated_at": "2023-11-20T07:51:13.215Z"
    },
    {
        "id": 1813,
        "owner": [],
        "entity_id": "2068",
        "entity_id_full": "sse/skill/2068",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four main keys: id, nested_skills, parent_skills, and repository_id. The id key corresponds to the unique identifier for the Industrie-Personal-Computer, the nested_skills key corresponds to any skills that are part of this Industrie-Personal-Computer, the parent_skills key corresponds to any skills that are required for this Industrie-Personal-Computer, and the repository_id key corresponds to the unique identifier for the repository where this Industrie-Personal-Computer is found. The created_at and updated_at keys correspond to the timestamp for when this Industrie-Personal-Computer was created and last updated, respectively. The name key corresponds to the name of the Industrie-Personal-Computer, while the level key corresponds to the difficulty level of the Industrie-Personal-Computer. Finally, the description key provides a brief description of the Industrie-Personal-Computer.",
        "created_at": "2023-11-13T14:23:11.311Z",
        "updated_at": "2023-11-20T07:51:13.221Z"
    },
    {
        "id": 1914,
        "owner": [],
        "entity_id": "2077",
        "entity_id_full": "sse/skill/2077",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Definition Künstliche Intelligenz\" and its properties. The id of the skill is 2077, it has no nested skills, its parent skills are \"Grundlagen Produktionstechnik\", the repository it is stored in has an id of 2, it was created on 2023-11-20T07:51:13.229Z, and updated on 2023-11-20T07:51:13.229Z. The skill is level 1 and has no description.",
        "created_at": "2023-11-13T14:23:11.316Z",
        "updated_at": "2023-11-20T07:51:13.229Z"
    },
    {
        "id": 1948,
        "owner": [],
        "entity_id": "2091",
        "entity_id_full": "sse/skill/2091",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a skill called \"Risiken von Big Data für produzierende Unternehmen\". The skill has an id of 2091, is at level 1, has no description, and was created on 2023-11-20T07:51:13.239Z. The skill has no nested skills and its parent skills are 'Big Data'. The repository_id is 2.",
        "created_at": "2023-11-13T14:23:11.324Z",
        "updated_at": "2023-11-20T07:51:13.239Z"
    },
    {
        "id": 1897,
        "owner": [],
        "entity_id": "2100",
        "entity_id_full": "sse/skill/2100",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a software system called \"Softwaresystem BDE\". The id is 2100, the nested_skills are empty, the parent_skills are \"Produktionsplanung und -steuerung\", the repository_id is 2, the created_at date is 2023-11-20T07:51:13.243Z, the updated_at date is 2023-11-20T07:51:13.243Z, the name is \"Softwaresystem BDE\", the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.328Z",
        "updated_at": "2023-11-20T07:51:13.243Z"
    },
    {
        "id": 1818,
        "owner": [],
        "entity_id": "2113",
        "entity_id_full": "sse/skill/2113",
        "entity_type": "skill",
        "contents": "\n\nThis is a dictionary with the following key value pairs:\n- id: the id of the dictionary\n- nested_skills: an empty list\n- parent_skills: a list containing the skill \"Werkzeugkoffer 4.0\"\n- repository_id: the id of the repository this skill is stored in\n- created_at: the date and time the skill was created\n- updated_at: the date and time the skill was last updated\n- name: the name of the skill\n- level: the level of the skill\n- description: a brief description of the skill",
        "created_at": "2023-11-13T14:23:11.334Z",
        "updated_at": "2023-11-20T07:51:13.246Z"
    },
    {
        "id": 1924,
        "owner": [],
        "entity_id": "2118",
        "entity_id_full": "sse/skill/2118",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a single skill, including the skill's id, name, description, level, repository id, when it was created and updated, and its parent and nested skills.",
        "created_at": "2023-11-13T14:23:11.336Z",
        "updated_at": "2023-11-20T07:51:13.248Z"
    },
    {
        "id": 1900,
        "owner": [],
        "entity_id": "2126",
        "entity_id_full": "sse/skill/2126",
        "entity_type": "skill",
        "contents": "\n\nThe following Python dictionary contains information on a particular skill. The id key corresponds to the unique identifier for the skill, while the nested_skills key contains a list of any skills that are contained within this skill. The parent_skills key indicates any skills that this skill is a part of, while the repository_id corresponds to the unique identifier for the repository that this skill is stored in. The created_at key contains the date and time that the skill was created, while the updated_at key contains the date and time that the skill was last updated. Finally, the name key corresponds to the name of the skill, while the level key indicates the level of the skill.",
        "created_at": "2023-11-13T14:23:11.340Z",
        "updated_at": "2023-11-20T07:51:13.251Z"
    },
    {
        "id": 1930,
        "owner": [],
        "entity_id": "2141",
        "entity_id_full": "sse/skill/2141",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 2141\n- nested_skills: []\n- parent_skills: ['Fertigung 4.0']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.258Z\n- updated_at: 2023-11-20T07:51:13.258Z\n- name: Parameter der Lasertechnik\n- level: 1\n- description: None\n\nThe id key represents the unique identifier for the dictionary. The nested_skills key represents a list of skills that are related to the skill represented by the dictionary. The parent_skills key represents a list of skills that the skill represented by the dictionary is a sub-skill of. The repository_id key represents the id of the repository that the skill is stored in. The created_at key represents the date and time that the skill was created. The updated_at key represents the date and time that the skill was last updated. The name key represents the name of the skill. The level key represents the level of the skill. The description key represents a description of the skill.",
        "created_at": "2023-11-13T14:23:11.346Z",
        "updated_at": "2023-11-20T07:51:13.258Z"
    },
    {
        "id": 1942,
        "owner": [],
        "entity_id": "2197",
        "entity_id_full": "sse/skill/2197",
        "entity_type": "skill",
        "contents": "\n\nThis is a dictionary with information about a particular skill. The 'id' key is the unique identifier for this skill, the 'nested_skills' key is a list of skills that are related to this skill, the 'parent_skills' key is a list of skills that this skill is a part of, the 'repository_id' key is the identifier for the repository that this skill is stored in, the 'created_at' key is the date and time that this skill was created, the 'updated_at' key is the date and time that this skill was last updated, the 'name' key is the name of this skill, the 'level' key is the level of this skill, and the 'description' key is a description of this skill.",
        "created_at": "2023-11-13T14:23:11.380Z",
        "updated_at": "2023-11-20T07:51:13.277Z"
    },
    {
        "id": 1823,
        "owner": [],
        "entity_id": "2150",
        "entity_id_full": "sse/skill/2150",
        "entity_type": "skill",
        "contents": "\n\nThe following Python dictionary includes the data for a specific skill. The id indicates the unique identifier for the skill, the nested_skills key lists any skills that are less specific versions of the current skill, the parent_skills key lists any skills of which the current skill is a more specific version, the repository_id key indicates the unique identifier for the repository in which the skill is stored, the created_at key indicates when the skill was created, the updated_at key indicates when the skill was last updated, the name key indicates the name of the skill, the level key indicates the level of specificity of the skill, and the description key provides a brief description of the skill.",
        "created_at": "2023-11-13T14:23:11.352Z",
        "updated_at": "2023-11-20T07:51:13.261Z"
    },
    {
        "id": 1933,
        "owner": [],
        "entity_id": "2159",
        "entity_id_full": "sse/skill/2159",
        "entity_type": "skill",
        "contents": "\n\nThe id key value pair refers to the id number of the given skill. The nested_skills key value pair refers to a list of skills that are related to the given skill. The parent_skills key value pair refers to a list of skills of which the given skill is a sub-skill. The repository_id key value pair refers to the id number of the repository in which the skill is located. The created_at key value pair refers to the date on which the skill was added to the repository. The updated_at key value pair refers to the date on which the skill was last updated. The name key value pair refers to the name of the skill. The level key value pair refers to the level of the skill. The description key value pair refers to a description of the skill.",
        "created_at": "2023-11-13T14:23:11.356Z",
        "updated_at": "2023-11-20T07:51:13.265Z"
    },
    {
        "id": 1870,
        "owner": [],
        "entity_id": "2163",
        "entity_id_full": "sse/skill/2163",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill. The 'id' key refers to the unique identifier for the skill, while the 'nested_skills' key refers to any skills that are sub-categories of the current skill. In this case, there are no nested skills so the value is an empty list. The 'parent_skills' key refers to any skills that the current skill is a sub-category of. In this case, the value is a list containing the skill 'Sensorik'. The 'repository_id' key refers to the id of the repository that the skill is stored in. The 'created_at' and 'updated_at' keys refer to the dates when the skill was created and last updated. The 'name' key contains the name of the skill, which in this case is 'Definition Messtechnik'. The 'level' key refers to the level of difficulty of the skill, with 1 being the easiest. The 'description' key contains a brief description of the skill, but in this case the value is 'None' because no description has been provided.",
        "created_at": "2023-11-13T14:23:11.360Z",
        "updated_at": "2023-11-20T07:51:13.267Z"
    },
    {
        "id": 1905,
        "owner": [],
        "entity_id": "2176",
        "entity_id_full": "sse/skill/2176",
        "entity_type": "skill",
        "contents": "\n\nThe following Python dictionary contains information about a machine that can sense its surroundings. The machine has an id of 2176, and is a part of a larger repository of machines with id 2. The machine was created on 2023-11-20T07:51:13.271Z and last updated on 2023-11-20T07:51:13.271Z. The machine is named \"Beispiel Fühlende Maschine\" and is level 1. The machine does not have a description.",
        "created_at": "2023-11-13T14:23:11.369Z",
        "updated_at": "2023-11-20T07:51:13.271Z"
    },
    {
        "id": 2012,
        "owner": [],
        "entity_id": "2189",
        "entity_id_full": "sse/skill/2189",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a particular skill, including the skill's id number, name, level, and description. It also lists the skill's parent skills (if any) and nested skills (if any), as well as the id number of the repository where the skill is stored. Finally, the dictionary includes the date and time when the skill was created and last updated.",
        "created_at": "2023-11-13T14:23:11.375Z",
        "updated_at": "2023-11-20T07:51:13.274Z"
    },
    {
        "id": 1891,
        "owner": [],
        "entity_id": "2196",
        "entity_id_full": "sse/skill/2196",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary describes the components of RFID. The id refers to the unique identifier for this particular component. The nested_skills key refers to any skills that are required for this component. The parent_skills key refers to the skills that this component is a part of. The repository_id is the unique identifier for the location where this component is stored. The created_at key refers to the date when this component was created. The updated_at key refers to the date when this component was last updated. The name key refers to the name of this component. The level key refers to the level of difficulty of this component. The description key refers to a description of this component.",
        "created_at": "2023-11-13T14:23:11.379Z",
        "updated_at": "2023-11-20T07:51:13.276Z"
    },
    {
        "id": 1874,
        "owner": [],
        "entity_id": "2202",
        "entity_id_full": "sse/skill/2202",
        "entity_type": "skill",
        "contents": "\n\n\nThe id key refers to the unique identifier for the skill. The nested_skills key refers to any skills that are contained within this skill. The parent_skills key refers to any skills that this skill is a child of. The repository_id key refers to the unique identifier for the repository this skill is contained in. The created_at key refers to the date and time when the skill was created. The updated_at key refers to the date and time when the skill was last updated. The name key refers to the name of the skill. The level key refers to the level of the skill. The description key refers to a description of the skill.",
        "created_at": "2023-11-13T14:23:11.383Z",
        "updated_at": "2023-11-20T07:51:13.278Z"
    },
    {
        "id": 1875,
        "owner": [],
        "entity_id": "2054",
        "entity_id_full": "sse/skill/2054",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, repository_id. The id key is associated with the value 2054, which is the identification number for the skill. The nested_skills key is associated with an empty list, which means that this skill does not have any sub-skills. The parent_skills key is associated with a list containing one element, \"Grundlagen Produktionstechnik\", which indicates that this is a sub-skill of the \"Grundlagen Produktionstechnik\" skill. The repository_id key is associated with the value 2, which indicates that this skill is part of the \"Production Technology\" repository. The created_at and updated_at keys are both associated with the date and time stamp 2023-11-20T07:51:13.209Z, which indicates when this skill was created or last updated. The name key is associated with the string \"Digitale Methoden, Modelle und Werkzeuge\", which is the name of the skill. The level key is associated with the value 1, which indicates that this is a basic level skill. The description key is associated with the value",
        "created_at": "2023-11-13T14:23:11.301Z",
        "updated_at": "2023-11-20T07:51:13.209Z"
    },
    {
        "id": 1893,
        "owner": [],
        "entity_id": "2065",
        "entity_id_full": "sse/skill/2065",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 2065\n- nested_skills: []\n- parent_skills: ['Grundlagen Produktionstechnik']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.219Z\n- updated_at: 2023-11-20T07:51:13.219Z\n- name: Anwendung von Predicitve Maintenance\n- level: 1\n- description: None\n\nThe id refers to the unique identifier of the skill. The nested_skills indicates if the skill has any child skills. The parent_skills indicates the parent skill of the current skill. The repository_id is the unique identifier of the repository the skill belongs to. The created_at and updated_at fields show the date and time when the skill was created and updated. The name field contains the name of the skill. The level refers to the level of the skill. The description field contains a description of the skill.",
        "created_at": "2023-11-13T14:23:11.308Z",
        "updated_at": "2023-11-20T07:51:13.219Z"
    },
    {
        "id": 1814,
        "owner": [],
        "entity_id": "2075",
        "entity_id_full": "sse/skill/2075",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Definition Maschine Learning.\" The skill has an id of 2075, and it was created on November 20, 2023. The skill is at level 1 and has no description. The skill is part of a repository with an id of 2. The skill has no nested skills, but it has a parent skill called \"Grundlagen Produktionstechnik.\"",
        "created_at": "2023-11-13T14:23:11.315Z",
        "updated_at": "2023-11-20T07:51:13.227Z"
    },
    {
        "id": 1861,
        "owner": [],
        "entity_id": "2079",
        "entity_id_full": "sse/skill/2079",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs:\n- id: 2079\n- nested_skills: []\n- parent_skills: ['Big Data']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.230Z\n- updated_at: 2023-11-20T07:51:13.230Z\n- name: Geschichte von Big Data\n- level: 1\n- description: None\n\nThe id key has a value of 2079, which is the unique identifier for this particular skill. The nested_skills key has an empty value, indicating that this skill does not have any skills nested within it. The parent_skills key has a value of ['Big Data'], indicating that this skill is a sub-skill of the Big Data skill. The repository_id key has a value of 2, which is the unique identifier for the repository that this skill belongs to. The created_at key has a value of 2023-11-20T07:51:13.230Z, which is the date and time that this skill was created. The updated_at key has a value of 2023",
        "created_at": "2023-11-13T14:23:11.317Z",
        "updated_at": "2023-11-20T07:51:13.230Z"
    },
    {
        "id": 1879,
        "owner": [],
        "entity_id": "2090",
        "entity_id_full": "sse/skill/2090",
        "entity_type": "skill",
        "contents": "\n\nid: 2090 - The id of the skill\nnested_skills: [] - A list of nested skills\nparent_skills: ['Big Data'] - A list of parent skills\nrepository_id: 2 - The id of the repository the skill belongs to\ncreated_at: 2023-11-20T07:51:13.239Z - The date the skill was created\nupdated_at: 2023-11-20T07:51:13.239Z - The date the skill was updated\nname: Beispiel Datenanalyse - The name of the skill\nlevel: 1 - The level of the skill\ndescription: None - A description of the skill",
        "created_at": "2023-11-13T14:23:11.324Z",
        "updated_at": "2023-11-20T07:51:13.239Z"
    },
    {
        "id": 1921,
        "owner": [],
        "entity_id": "2102",
        "entity_id_full": "sse/skill/2102",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Abweichungen zwischen Ist- und Soll-Zustand\" which is a child skill of the \"Produktionsplanung und -steuerung\" skill. The skill has an ID of 2102 and was created on 2023-11-20T07:51:13.243Z. The skill was last updated on 2023-11-20T07:51:13.243Z. The skill has a level of 1 and does not have a description.",
        "created_at": "2023-11-13T14:23:11.329Z",
        "updated_at": "2023-11-20T07:51:13.243Z"
    },
    {
        "id": 1923,
        "owner": [],
        "entity_id": "2109",
        "entity_id_full": "sse/skill/2109",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a skill called \"Formen der Verschwendung\" (Waste Forms). It is a skill at level 1 with no description. It has no nested skills, but its parent skills are \"Werkzeugkoffer 4.0\" (Toolkit 4.0). The repository_id is 2 and it was created_at 2023-11-20T07:51:13.245Z and last updated_at 2023-11-20T07:51:13.245Z.",
        "created_at": "2023-11-13T14:23:11.332Z",
        "updated_at": "2023-11-20T07:51:13.245Z"
    },
    {
        "id": 1899,
        "owner": [],
        "entity_id": "2119",
        "entity_id_full": "sse/skill/2119",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, description.\n\nThe id key has a value of 2119.\n\nThe nested_skills key has a value of an empty list.\n\nThe parent_skills key has a value of a list containing the string \"Werkzeugkoffer 4.0\".\n\nThe repository_id key has a value of 2.\n\nThe created_at key has a value of \"2023-11-20T07:51:13.248Z\".\n\nThe updated_at key has a value of \"2023-11-20T07:51:13.248Z\".\n\nThe name key has a value of \"Wertstromdarstellung\".\n\nThe level key has a value of 1.\n\nThe description key has a value of None.",
        "created_at": "2023-11-13T14:23:11.336Z",
        "updated_at": "2023-11-20T07:51:13.248Z"
    },
    {
        "id": 1952,
        "owner": [],
        "entity_id": "2125",
        "entity_id_full": "sse/skill/2125",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Anwendung von Poka Yoke\" and has the following key value pairs:\n\n- id: the unique identifier for the skill\n\n- nested_skills: a list of skills that are related to or required for this skill\n\n- parent_skills: a list of skills that this skill is a sub-skill of\n\n- repository_id: the id of the repository that this skill is stored in\n\n- created_at: the date and time when this skill was created\n\n- updated_at: the date and time when this skill was last updated\n\n- name: the name of the skill\n\n- level: the level of the skill (1 is the highest)\n\n- description: a description of the skill",
        "created_at": "2023-11-13T14:23:11.339Z",
        "updated_at": "2023-11-20T07:51:13.251Z"
    },
    {
        "id": 1901,
        "owner": [],
        "entity_id": "2136",
        "entity_id_full": "sse/skill/2136",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains four key-value pairs. The first pair is the id and nested_skills. The id is the unique identifier for the skillset and the nested_skills is a list of all the skills that are contained within that skillset. The second pair is the parent_skills and repository_id. The parent_skills is a list of skills that the skillset inherits from and the repository_id is the unique identifier for the repository that the skillset is contained within. The third pair is the created_at and updated_at. These are the dates when the skillset was created and last updated. The fourth pair is the name and level. The name is the name of the skillset and the level is the Skillset's difficulty level.",
        "created_at": "2023-11-13T14:23:11.344Z",
        "updated_at": "2023-11-20T07:51:13.255Z"
    },
    {
        "id": 2007,
        "owner": [],
        "entity_id": "2143",
        "entity_id_full": "sse/skill/2143",
        "entity_type": "skill",
        "contents": "\n\nThe following dictionary contains information on a manufacturing process called \"Additive Manufacturing\". The id key is the unique identifier for this process, and the nested_skills key is an empty list indicating that there are no additional processes nested within this one. The parent_skills key indicates that this process is a part of the \"Fertigung 4.0\" manufacturing process. The repository_id key is the id of the repository that this process is stored in, and the created_at and updated_at keys are timestamps indicating when this process was created and last updated. The name key contains the name of this process, and the level key indicates that this is a level 1 process. The description key is set to None, indicating that there is no description available for this process.",
        "created_at": "2023-11-13T14:23:11.347Z",
        "updated_at": "2023-11-20T07:51:13.259Z"
    },
    {
        "id": 1932,
        "owner": [],
        "entity_id": "2151",
        "entity_id_full": "sse/skill/2151",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, repository_id. \n\nThe id key has a value of 2151. This is the id of the skill.\n\nThe nested_skills key has a value of an empty list. This list represents the skills that are nested under this skill.\n\nThe parent_skills key has a value of a list with one element, 'Assistenzsysteme'. This list represents the skills that are parent skills to this skill.\n\nThe repository_id key has a value of 2. This is the id of the repository that this skill belongs to.\n\nThe created_at key has a value of 2023-11-20T07:51:13.262Z. This is the date and time when the skill was created.\n\nThe updated_at key has a value of 2023-11-20T07:51:13.262Z. This is the date and time when the skill was last updated.\n\nThe name key has a value of Belastungsarten. This is the name of the skill.\n\nThe level key has a value of 1. This is the level of the",
        "created_at": "2023-11-13T14:23:11.352Z",
        "updated_at": "2023-11-20T07:51:13.262Z"
    },
    {
        "id": 1934,
        "owner": [],
        "entity_id": "2161",
        "entity_id_full": "sse/skill/2161",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Definition Sensor.\" The id of the skill is 2161, and it has no nested skills or parent skills. The repository_id is 2, which indicates that the skill is part of a repository of skills. The skill was created on 2023-11-20T07:51:13.267Z and last updated on 2023-11-20T07:51:13.267Z. The level of the skill is 1, and it has no description.",
        "created_at": "2023-11-13T14:23:11.358Z",
        "updated_at": "2023-11-20T07:51:13.267Z"
    },
    {
        "id": 1871,
        "owner": [],
        "entity_id": "2170",
        "entity_id_full": "sse/skill/2170",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill called \"Aktive und passive Sensoren\" with the id 2170. The skill is a level 1 skill and has no parent skills or nested skills. The skill was created on 2023-11-20T07:51:13.269Z and last updated on the same date. There is no description for the skill.",
        "created_at": "2023-11-13T14:23:11.364Z",
        "updated_at": "2023-11-20T07:51:13.269Z"
    },
    {
        "id": 1910,
        "owner": [],
        "entity_id": "2055",
        "entity_id_full": "sse/skill/2055",
        "entity_type": "skill",
        "contents": "\n\n\n\nThe dictionary consists of key value pairs that describe various aspects of a digital factory. The id is the unique identifier for the factory, the nested_skills are the skills that are required for the factory to function, the parent_skills are the skills that are necessary for the factory to operate, the repository_id is the id of the repository that the factory is stored in, the created_at is the date when the factory was created, the updated_at is the date when the factory was last updated, the name is the name of the factory, the level is the level of the factory, and the description is a brief description of the factory.",
        "created_at": "2023-11-13T14:23:11.302Z",
        "updated_at": "2023-11-20T07:51:13.209Z"
    },
    {
        "id": 1999,
        "owner": [],
        "entity_id": "2066",
        "entity_id_full": "sse/skill/2066",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a \"field device\" with the following attributes: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, and description.\n\nThe id is a unique identifier for the field device.\nThe nested_skills attribute contains a list of skills that are associated with the field device.\nThe parent_skills attribute contains a list of skills that the field device inherits from its parent skill.\nThe repository_id is the id of the repository that the field device is stored in.\nThe created_at and updated_at attributes are timestamps for when the field device was created and last updated.\nThe name attribute is the name of the field device.\nThe level attribute is the level of the field device.\nThe description attribute is a description of the field device.",
        "created_at": "2023-11-13T14:23:11.310Z",
        "updated_at": "2023-11-20T07:51:13.220Z"
    },
    {
        "id": 1894,
        "owner": [],
        "entity_id": "2073",
        "entity_id_full": "sse/skill/2073",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill called \"Additive Fertigungsverfahren\" with the following properties:\n- id: 2073\n- nested_skills: []\n- parent_skills: ['Grundlagen Produktionstechnik']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.225Z\n- updated_at: 2023-11-20T07:51:13.225Z\n- name: Additive Fertigungsverfahren\n- level: 1\n- description: None",
        "created_at": "2023-11-13T14:23:11.314Z",
        "updated_at": "2023-11-20T07:51:13.225Z"
    },
    {
        "id": 1895,
        "owner": [],
        "entity_id": "2081",
        "entity_id_full": "sse/skill/2081",
        "entity_type": "skill",
        "contents": "\n\nThe following dictionary contains information about a particular skill, including the name of the skill, a description of the skill, and the skill's level within a larger skill set. The skill's id number, the repository it is contained within, and when it was created and updated are also included. This skill is a parent skill within the larger skill set of 'Big Data'.",
        "created_at": "2023-11-13T14:23:11.318Z",
        "updated_at": "2023-11-20T07:51:13.232Z"
    },
    {
        "id": 1918,
        "owner": [],
        "entity_id": "2092",
        "entity_id_full": "sse/skill/2092",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a course called \"Einführung Produktionsmanagement\" which is at level 1. The id is 2092, the repository_id is 2, the created_at and updated_at are 2023-11-20T07:51:13.240Z. The parent_skills are ['Produktionsplanung und -steuerung'], and the nested_skills are []. The description is None.",
        "created_at": "2023-11-13T14:23:11.324Z",
        "updated_at": "2023-11-20T07:51:13.240Z"
    },
    {
        "id": 1949,
        "owner": [],
        "entity_id": "2097",
        "entity_id_full": "sse/skill/2097",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes four keys: id, nested_skills, parent_skills, repository_id. The id key has a value of 2097, which is the unique identifier for the skill. The nested_skills key has a value of an empty list, which indicates that this skill has no sub-skills. The parent_skills key has a value of a list containing a single string, 'Produktionsplanung und -steuerung', which indicates that this skill is a sub-skill of 'Produktionsplanung und -steuerung'. The repository_id key has a value of 2, which is the id of the repository that this skill belongs to. The created_at and updated_at keys both have values of 2023-11-20T07:51:13.241Z, which are the timestamps for when this skill was created and last updated, respectively. Finally, the name key has a value of 'Einführung in BDE', which is the name of the skill, and the level key has a value of 1, which is the skill's level. The description key has a value of None, which indicates that no description has been provided for this skill",
        "created_at": "2023-11-13T14:23:11.327Z",
        "updated_at": "2023-11-20T07:51:13.241Z"
    },
    {
        "id": 1922,
        "owner": [],
        "entity_id": "2111",
        "entity_id_full": "sse/skill/2111",
        "entity_type": "skill",
        "contents": "\n\n\nThe id is the unique identifier for this skill and is used internally by the system. The nested_skills array is used to store any skills that are considered to be sub-skills of this skill. The parent_skills array stores the skills that this skill is considered a sub-skill of. The repository_id is the unique identifier of the repository that this skill belongs to. The created_at and updated_at timestamps denote when thisskill was created and last updated respectively. The name is the human-readable name of this skill. The level indicates the skill's place in the skill hierarchy. The description field is reserved for a human-readable description of this skill.",
        "created_at": "2023-11-13T14:23:11.333Z",
        "updated_at": "2023-11-20T07:51:13.246Z"
    },
    {
        "id": 1865,
        "owner": [],
        "entity_id": "2116",
        "entity_id_full": "sse/skill/2116",
        "entity_type": "skill",
        "contents": "\n\n\nThe \"id\" key refers to the unique identifier for this particular skill. The \"nested_skills\" key is an empty list which indicates that this skill has no sub-skills or child skills. The \"parent_skills\" key contains a list with a single element indicating the name of the parent skill for this skill. In this case, the parent skill is \"Werkzeugkoffer 4.0\". The \"repository_id\" key indicates the id of the repository that this skill belongs to. The \"created_at\" and \"updated_at\" keys contain timestamps indicating when this skill was created and last updated. The \"name\" key contains the name of this skill. The \"level\" key indicates the level of this skill. The \"description\" key is set to \"None\" indicating that there is no description for this skill.",
        "created_at": "2023-11-13T14:23:11.335Z",
        "updated_at": "2023-11-20T07:51:13.247Z"
    },
    {
        "id": 1927,
        "owner": [],
        "entity_id": "2131",
        "entity_id_full": "sse/skill/2131",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, repository_id. The value corresponding to the id key is 2131, the value corresponding to the nested_skills key is an empty list, the value corresponding to the parent_skills key is a list with one element 'Werkzeugkoffer 4.0', and the value corresponding to the repository_id key is 2. The created_at and updated_at keys have values that are strings representing dates. The value corresponding to the name key is 'Anwendung von FIFO' and the value corresponding to the level key is 1. The value corresponding to the description key is None.",
        "created_at": "2023-11-13T14:23:11.341Z",
        "updated_at": "2023-11-20T07:51:13.253Z"
    },
    {
        "id": 1884,
        "owner": [],
        "entity_id": "2137",
        "entity_id_full": "sse/skill/2137",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary consists of key value pairs that describe a skill. The id key is the unique identifier for the skill, the nested_skills key contains a list of skills that are related to this skill, the parent_skills key contains a list of skills that this skill is based off of, the repository_id key is the unique identifier for the repository that this skill is stored in, the created_at key is the date that the skill was created, the updated_at key is the date that the skill was last updated, the name key is the name of the skill, the level key is the level of the skill, and the description key is a description of the skill.",
        "created_at": "2023-11-13T14:23:11.344Z",
        "updated_at": "2023-11-20T07:51:13.256Z"
    },
    {
        "id": 1937,
        "owner": [],
        "entity_id": "2178",
        "entity_id_full": "sse/skill/2178",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Definition Kaltleiter.\" The skill has an id of 2178, and it is a level 1 skill. The skill is part of a repository with an id of 2. The skill was created on 2023-11-20T07:51:13.271Z, and it was updated on 2023-11-20T07:51:13.271Z. The skill has no description.",
        "created_at": "2023-11-13T14:23:11.370Z",
        "updated_at": "2023-11-20T07:51:13.271Z"
    },
    {
        "id": 1902,
        "owner": [],
        "entity_id": "2148",
        "entity_id_full": "sse/skill/2148",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four key value pairs. The first pair is the id which is 2148. The second pair is nested skills which is an empty list. The third pair is parent skills which has a list containing one element, 'Fertigung 4.0'. The fourth pair is repository id which is 2. The fifth pair is created at which is 2023-11-20T07:51:13.261Z. The sixth pair is updated at which is 2023-11-20T07:51:13.261Z. The seventh pair is name which is 'Nachbehandlung der 3D-Teile' and the eighth pair is level which is 1. The last pair is description which is None.",
        "created_at": "2023-11-13T14:23:11.351Z",
        "updated_at": "2023-11-20T07:51:13.261Z"
    },
    {
        "id": 1869,
        "owner": [],
        "entity_id": "2157",
        "entity_id_full": "sse/skill/2157",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary consists of the following key value pairs:\n-id: 2157\n-nested_skills: []\n-parent_skills: ['Assistenzsysteme']\n-repository_id: 2\n-created_at: 2023-11-20T07:51:13.265Z\n-updated_at: 2023-11-20T07:51:13.265Z\n-name: Beispiel Assistent für virtuelle Prozess-Inbetriebnahme\n-level: 1\n-description: None\n\nThe id refers to the unique identifier of the dictionary entry. The nested_skills key indicates whether the skill has any sub-skills, which are listed in an array. The parent_skills key specifies the parent skills of the skill, which are listed in an array. The repository_id defines the repository to which the skill belongs. The created_at key refers to the date and time when the skill was created. The updated_at key shows the date and time when the skill was last updated. The name indicates the name of the skill. The level key defines the level of the skill. The description key contains",
        "created_at": "2023-11-13T14:23:11.355Z",
        "updated_at": "2023-11-20T07:51:13.265Z"
    },
    {
        "id": 1957,
        "owner": [],
        "entity_id": "2168",
        "entity_id_full": "sse/skill/2168",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a specific skill. The id field is the unique identifier for the skill, the nested_skills field contains a list of any skills that are related to this one, the parent_skills field contains a list of any skills that this one is a sub-skill of, the repository_id field identifies which repository this skill belongs to, the created_at and updated_at fields contain timestamps for when the skill was created and last updated, the name field contains the name of the skill, the level field identifies the level of the skill within the repository (1 being the highest), and the description field contains a description of the skill.",
        "created_at": "2023-11-13T14:23:11.363Z",
        "updated_at": "2023-11-20T07:51:13.268Z"
    },
    {
        "id": 2010,
        "owner": [],
        "entity_id": "2173",
        "entity_id_full": "sse/skill/2173",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill called \"Definition Sensoren zur Kraftmessung\" with the ID 2173. This skill has no nested skills and one parent skill called \"Sensorik\". The skill was created on 2023-11-20T07:51:13.270Z and last updated on the same date. The skill is at level 1 and has no description.",
        "created_at": "2023-11-13T14:23:11.367Z",
        "updated_at": "2023-11-20T07:51:13.270Z"
    },
    {
        "id": 1826,
        "owner": [],
        "entity_id": "2181",
        "entity_id_full": "sse/skill/2181",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a specific skill, in this case Sensoren zur Schwingungsmessung. The id key is the unique identifier for the skill, the nested_skills key is a list of skills that fall under this skill, the parent_skills key is a list of skills that this skill falls under, the repository_id key is the id of the repository that this skill belongs to, the created_at key is the date and time that the skill was created, the updated_at key is the date and time that the skill was last updated, the name key is the name of the skill, the level key is the level of the skill, and the description key is a description of the skill.",
        "created_at": "2023-11-13T14:23:11.372Z",
        "updated_at": "2023-11-20T07:51:13.273Z"
    },
    {
        "id": 1941,
        "owner": [],
        "entity_id": "2191",
        "entity_id_full": "sse/skill/2191",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a material flow simulation. The id is the unique identifier for the simulation, the nested_skills and parent_skills are lists of skills required for the simulation, the repository_id is the id of the repository where the simulation is stored, and the created_at and updated_at are the dates when the simulation was created and last updated. The name is the name of the simulation, the level is the difficulty level of the simulation, and the description is a brief description of the simulation.",
        "created_at": "2023-11-13T14:23:11.376Z",
        "updated_at": "2023-11-20T07:51:13.275Z"
    },
    {
        "id": 1943,
        "owner": [],
        "entity_id": "2200",
        "entity_id_full": "sse/skill/2200",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Vorteile der Verwendung von RFID\" which is a child skill of the parent skill \"RFID\". The dictionary includes the skill's id (2200), the date the skill was created (2023-11-20T07:51:13.278Z) and updated (2023-11-20T07:51:13.278Z), the skill's level (1), and a description (None). The skill has no nested skills.",
        "created_at": "2023-11-13T14:23:11.383Z",
        "updated_at": "2023-11-20T07:51:13.278Z"
    },
    {
        "id": 1846,
        "owner": [],
        "entity_id": "2501",
        "entity_id_full": "sse/skill/2501",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary represents a skill called \"Grundlagen Industrie 4.0\" with the following information:\n- The id of the skill is 2501.\n- The nested_skills list contains the names of sub-skills, which are: 'Einführung Digitale Transformation', 'Herausforderungen bei der Umsetzung von Digitalisierungsmaßnahmen', 'Definition Industrie 4.0', 'Produktionsdigitalisierung', 'Definition Smart Factory', 'Gründe Digitalisierung', 'Geschichte der industriellen Produktion', 'Definition Daten und Informationen', 'Daten- und Informationsflüsse im Unternehmen', 'Technologien der Digitalisierung'.\n- The parent_skills list is empty, indicating that this skill does not have any parent skills.\n- The repository_id is 2, meaning that this skill is part of the second repository.\n- The skill was created_at 2023-11-20T07:51:13.598Z and updated_at 2023-11-20T07:51:13",
        "created_at": "2023-11-13T14:23:11.688Z",
        "updated_at": "2023-11-20T07:51:13.598Z"
    },
    {
        "id": 1847,
        "owner": [],
        "entity_id": "2502",
        "entity_id_full": "sse/skill/2502",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes the id, name, level, description, nested_skills, and parent_skills of a set of data and information. The id is 2502, the name is Grundlagen Daten und Informationen, the level is 1, the description is None, the nested_skills are Definition Kommunikationstechnik, Definition Endsystem, Definition Kommunikationsnetz, Definition Analoge Übertragungwege, Vor- und Nachteile Analoge Übertragungswege, Anwendung Analoge Übertragungswege, Vergleich der digitalen Übertragungswege, Definition Digitale Übertragungswege, Anwendung Digitale Übertragungswege, Definition Subsystem, Definition Schnittstelle, Definition Big Data, Definition Protokoll, Definition Informationstechnik, Datenverarbeitung der digitalen Produktion, Definition Predictive Maintenance, Definition Algorithmus, Beispiel Adaptive Routenplanung, Definition Blockchain, Definition Cloud Computing, Beispiel Neue Geschäftsmodelle, Definition Internet",
        "created_at": "2023-11-13T14:23:11.697Z",
        "updated_at": "2023-11-20T07:51:13.619Z"
    },
    {
        "id": 1848,
        "owner": [],
        "entity_id": "2503",
        "entity_id_full": "sse/skill/2503",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four key value pairs. The first key is \"id\" and the value is \"2503\". The second key is \"nested_skills\" and the value is a list of strings. The third key is \"parent_skills\" and the value is an empty list. The fourth key is \"repository_id\" and the value is \"2\". The fifth key is \"created_at\" and the value is a date. The sixth key is \"updated_at\" and the value is a date. The seventh key is \"name\" and the value is \"Grundlagen Arbeit 4.0\". The eighth key is \"level\" and the value is \"1\". The ninth key is \"description\" and the value is None.",
        "created_at": "2023-11-13T14:23:11.723Z",
        "updated_at": "2023-11-20T07:51:13.632Z"
    },
    {
        "id": 1849,
        "owner": [],
        "entity_id": "2504",
        "entity_id_full": "sse/skill/2504",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, and description.\n\nThe id is the unique identifier for the dictionary.\n\nThe nested_skills key indicates the skills that are related to the Production Basics dictionary.\n\nThe parent_skills key indicates the skills that the Production Basics dictionary is based on.\n\nThe repository_id is the identifier for the location where the Production Basics dictionary is stored.\n\nThe created_at key indicates when the Production Basics dictionary was created.\n\nThe updated_at key indicates when the Production Basics dictionary was last updated.\n\nThe name key indicates the name of the Production Basics dictionary.\n\nThe level key indicates the level of the Production Basics dictionary.\n\nThe description key indicates a description of the Production Basics dictionary.",
        "created_at": "2023-11-13T14:23:11.731Z",
        "updated_at": "2023-11-20T07:51:13.662Z"
    },
    {
        "id": 1850,
        "owner": [],
        "entity_id": "2505",
        "entity_id_full": "sse/skill/2505",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, description.\n\nThe id is the unique identifier for the dictionary.\n\nThe nested_skills key contains a list of skills that are related to the Big Data topic.\n\nThe parent_skills key contains a list of skills that are required to understand the Big Data topic.\n\nThe repository_id is the identifier for the repository where the dictionary is stored.\n\nThe created_at key contains the date when the dictionary was created.\n\nThe updated_at key contains the date when the dictionary was last updated.\n\nThe name key contains the name of the Big Data topic.\n\nThe level key indicates the level of difficulty of the Big Data topic.\n\nThe description key contains a description of the Big Data topic.",
        "created_at": "2023-11-13T14:23:11.741Z",
        "updated_at": "2023-11-20T07:51:13.678Z"
    },
    {
        "id": 1851,
        "owner": [],
        "entity_id": "2506",
        "entity_id_full": "sse/skill/2506",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, and repository_id. The id key has a value of 2506, the nested_skills key has a value of a list of strings, the parent_skills key has a value of an empty list, and the repository_id key has a value of 2. The created_at and updated_at keys have values of datetime objects. The name key has a value of \"Produktionsplanung und -steuerung\" and the level key has a value of 1. The description key has a value of None.",
        "created_at": "2023-11-13T14:23:11.748Z",
        "updated_at": "2023-11-20T07:51:13.685Z"
    },
    {
        "id": 1852,
        "owner": [],
        "entity_id": "2507",
        "entity_id_full": "sse/skill/2507",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a toolkit with various tools for Lean Management. The tools are grouped by skill, and each skill has a description of how to use it.",
        "created_at": "2023-11-13T14:23:11.756Z",
        "updated_at": "2023-11-20T07:51:13.692Z"
    },
    {
        "id": 1853,
        "owner": [],
        "entity_id": "2508",
        "entity_id_full": "sse/skill/2508",
        "entity_type": "skill",
        "contents": "\n\nThe following dictionary describes the skills needed for Fertigung 4.0, a manufacturing process that uses lasers. The skills are organized by level, with the highest level skills being 'Physikalische Grundlagen der Lasertechnik' and 'Beispiel Lasertechnik für Informationsbereitstellung'. The lower level skills are 'Geschichte der additiven Fertigung', 'Einsatzbereiche der additiven Fertigug', 'Vorteile der additiven Fertigung', and 'Parameter der Lasertechnik'.",
        "created_at": "2023-11-13T14:23:11.777Z",
        "updated_at": "2023-11-20T07:51:13.701Z"
    },
    {
        "id": 1854,
        "owner": [],
        "entity_id": "2509",
        "entity_id_full": "sse/skill/2509",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n\n- id: 2509\n- nested_skills: ['Steuerung von Assistenzsystemen', 'Definition Künstliche Intelligenz II', 'Aktorik von Assistenzsystemen', 'Sensorik von Assistenzsystemen', 'Belastungsarten', 'Beispiel Assistent für virtuelle Prozess-Inbetriebnahme', 'Formen von Assistenzsystemen', 'Assistenzsysteme in der Fertigung', 'Reduzierung von Belastungen', 'Ziele von Assistenzsystemen']\n- parent_skills: [], \n- repository_id: 2, \n- created_at: 2023-11-20T07:51:13.711Z, \n- updated_at: 2023-11-20T07:51:13.711Z, \n- name: Assistenzsysteme, \n- level: 1, \n- description: None\n\nThe id is the unique identifier for this particular skill. The nested_skills list contains the skills that fall under this category",
        "created_at": "2023-11-13T14:23:11.784Z",
        "updated_at": "2023-11-20T07:51:13.711Z"
    },
    {
        "id": 1855,
        "owner": [],
        "entity_id": "2510",
        "entity_id_full": "sse/skill/2510",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents a skill, \"Sensorik\", with the following properties: \n- id: 2510\n- nested_skills: a list of skills that are related to or required for this skill\n- parent_skills: a list of skills of which this skill is a part\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.719Z\n- update_at: 2023-11-20T07:51:13.719Z\n- name: Sensorik\n- level: 1\n- description: null",
        "created_at": "2023-11-13T14:23:11.791Z",
        "updated_at": "2023-11-20T07:51:13.719Z"
    },
    {
        "id": 1856,
        "owner": [],
        "entity_id": "2511",
        "entity_id_full": "sse/skill/2511",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes the following key value pairs:\n- id: the id of the dictionary\n- nested_skills: a list of skills that are related to the dictionary\n- parent_skills: a list of skills that the dictionary is based on\n- repository_id: the id of the repository that the dictionary is in\n- created_at: the date that the dictionary was created\n- updated_at: the date that the dictionary was last updated\n- name: the name of the dictionary\n- level: the level of the dictionary\n- description: a description of the dictionary",
        "created_at": "2023-11-13T14:23:11.800Z",
        "updated_at": "2023-11-20T07:51:13.752Z"
    },
    {
        "id": 1857,
        "owner": [],
        "entity_id": "2512",
        "entity_id_full": "sse/skill/2512",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a set of skills and related information. The id refers to the unique identifier for this particular skill set. The nested_skills key lists several skills related to RFID technology, while the parent_skills key lists any higher-level skills that may be related. The repository_id indicates which skill repository this skill set came from, while the created_at and updated_at keys show when this skill set was first created and last updated, respectively. The name key simply lists the name of the skill set (in this case, RFID), while the level key indicates what level this skill set is (1 being the highest level). Finally, the description key gives a brief description of the skill set, though it is currently set to None.",
        "created_at": "2023-11-13T14:23:11.807Z",
        "updated_at": "2023-11-20T07:51:13.759Z"
    },
    {
        "id": 1858,
        "owner": [],
        "entity_id": "2056",
        "entity_id_full": "sse/skill/2056",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill called \"Grundlagen Automatisierungskomponenten\" with the id 2056. The skill has no nested skills and its parent skills are \"Grundlagen Produktionstechnik\". The skill is stored in repository 2 and was created on 2023-11-20T07:51:13.210Z. The skill was updated on 2023-11-20T07:51:13.210Z. The level of the skill is 1 and it has no description.",
        "created_at": "2023-11-13T14:23:11.303Z",
        "updated_at": "2023-11-20T07:51:13.210Z"
    },
    {
        "id": 1911,
        "owner": [],
        "entity_id": "2061",
        "entity_id_full": "sse/skill/2061",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes four key value pairs. The first key is \"id\" and the value is 2061. This is the identification number for the dictionary. The second key is \"nested_skills\" and the value is an empty list. This indicates that there are no skills nested within this skill. The third key is \"parent_skills\" and the value is a list containing the skill \"Grundlagen Produktionstechnik\". This indicates that this skill is a child of the skill \"Grundlagen Produktionstechnik\". The fourth key is \"repository_id\" and the value is 2. This indicates that this skill is part of repository 2.",
        "created_at": "2023-11-13T14:23:11.306Z",
        "updated_at": "2023-11-20T07:51:13.216Z"
    },
    {
        "id": 1980,
        "owner": [],
        "entity_id": "3507",
        "entity_id_full": "sse/skill/3507",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary contains information about a particular skill, including the ID number, the name of the skill, a description, the level of the skill, and when the skill was created and updated. It also includes a list of nested skills and a list of parent skills.",
        "created_at": "2023-11-13T14:23:14.099Z",
        "updated_at": "2023-11-20T07:51:15.543Z"
    },
    {
        "id": 1947,
        "owner": [],
        "entity_id": "2083",
        "entity_id_full": "sse/skill/2083",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n- id: 2083\n- nested_skills: []\n- parent_skills: ['Big Data']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.233Z\n- updated_at: 2023-11-20T07:51:13.233Z\n- name: Definition Data Mining\n- level: 1\n- description: None\n\nThe id key corresponds to the unique identifier for the skill, which is 2083 in this case. The nested_skills key is an empty list, indicating that there are no sub-skills within this skill. The parent_skills key contains a list with a single element, 'Big Data', indicating that this skill is a sub-skill of the 'Big Data' skill. The repository_id key corresponds to the unique identifier for the repository that this skill belongs to, which is 2 in this case. The created_at and updated_at keys correspond to the timestamps for when the skill was created and last updated, respectively. The name key corresponds to the name of the skill, which is 'Definition Data Mining' in",
        "created_at": "2023-11-13T14:23:11.319Z",
        "updated_at": "2023-11-20T07:51:13.233Z"
    },
    {
        "id": 1862,
        "owner": [],
        "entity_id": "2089",
        "entity_id_full": "sse/skill/2089",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill related to data mining. The 'id' key corresponds to the unique identifier for the skill, while the 'nested_skills' and 'parent_skills' keys provide lists of skills that are related to the current skill. The 'repository_id' key relates the skill to a particular repository of data, while the 'created_at' and 'updated_at' keys provide timestamps for when the skill was created and last updated. Finally, the 'name' and 'description' keys give the skill's name and provide a brief description of the skill, respectively.",
        "created_at": "2023-11-13T14:23:11.323Z",
        "updated_at": "2023-11-20T07:51:13.238Z"
    },
    {
        "id": 1863,
        "owner": [],
        "entity_id": "2099",
        "entity_id_full": "sse/skill/2099",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a software system skill called \"Softwaresystem MES.\" The id is 2099, the nested_skills list is empty, the parent_skills list contains the skill \"Produktionsplanung und -steuerung,\" the repository_id is 2, the created_at date is 2023-11-20T07:51:13.242Z, the updated_at date is 2023-11-20T07:51:13.242Z, the name is \"Softwaresystem MES,\" the level is 1, and the description is \"None.\"",
        "created_at": "2023-11-13T14:23:11.328Z",
        "updated_at": "2023-11-20T07:51:13.242Z"
    },
    {
        "id": 1881,
        "owner": [],
        "entity_id": "2106",
        "entity_id_full": "sse/skill/2106",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs: id is 2106, nested_skills is an empty list, parent_skills has one element which is the string \"Werkzeugkoffer 4.0\", repository_id is 2, created_at is 2023-11-20T07:51:13.245Z, updated_at is 2023-11-20T07:51:13.245Z, name is Definition Lean Management II, level is 1, description is None.",
        "created_at": "2023-11-13T14:23:11.331Z",
        "updated_at": "2023-11-20T07:51:13.245Z"
    },
    {
        "id": 1951,
        "owner": [],
        "entity_id": "2115",
        "entity_id_full": "sse/skill/2115",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, description.\n\nThe id refers to the unique identifier for the dictionary.\nThe nested_skills refers to a list of skills that are related to the parent_skills.\nThe parent_skills refers to the skills that the nested_skills are related to.\nThe repository_id refers to the id of the repository that the dictionary is stored in.\nThe created_at refers to the date and time that the dictionary was created.\nThe updated_at refers to the date and time that the dictionary was last updated.\nThe name refers to the name of the dictionary.\nThe level refers to the level of the dictionary.\nThe description refers to the description of the dictionary.",
        "created_at": "2023-11-13T14:23:11.335Z",
        "updated_at": "2023-11-20T07:51:13.247Z"
    },
    {
        "id": 1866,
        "owner": [],
        "entity_id": "2124",
        "entity_id_full": "sse/skill/2124",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs:\n- id: 2124\n- nested_skills: []\n- parent_skills: ['Werkzeugkoffer 4.0']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.251Z\n- updated_at: 2023-11-20T07:51:13.251Z\n- name: Durchführung von Poka Yoke\n- level: 1\n- description: None\n\nThe id is a unique identifier for this particular skill. The nested_skills key indicates there are no skills nested within this skill, while the parent_skills key tells us that this skill is a part of the 'Werkzeugkoffer 4.0' skill. The repository_id is a unique identifier for the repository this skill is stored in, while the created_at and updated_at keys give us timestamps for when this skill was first created and last updated. The name of the skill is 'Durchführung von Poka Yoke' and it is currently at level 1. There is no description available for this skill.",
        "created_at": "2023-11-13T14:23:11.339Z",
        "updated_at": "2023-11-20T07:51:13.251Z"
    },
    {
        "id": 1867,
        "owner": [],
        "entity_id": "2132",
        "entity_id_full": "sse/skill/2132",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains information on a FIFO-Regale. The id is 2132, the nested_skills are empty, the parent_skills are 'Werkzeugkoffer 4.0', the repository_id is 2, the created_at is 2023-11-20T07:51:13.253Z, the updated_at is 2023-11-20T07:51:13.253Z, the name is FIFO-Regale, the level is 1, and the description is None.",
        "created_at": "2023-11-13T14:23:11.342Z",
        "updated_at": "2023-11-20T07:51:13.253Z"
    },
    {
        "id": 2006,
        "owner": [],
        "entity_id": "2140",
        "entity_id_full": "sse/skill/2140",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill called \"Fertigungsprozesse mit Lasern\" with the skill id of 2140. The skill has no nested skills and its parent skill is \"Fertigung 4.0\". The skill is stored in repository 2 and was created on 2023-11-20T07:51:13.258Z. The skill was last updated on 2023-11-20T07:51:13.258Z. The skill is at level 1 and has no description.",
        "created_at": "2023-11-13T14:23:11.345Z",
        "updated_at": "2023-11-20T07:51:13.258Z"
    },
    {
        "id": 1931,
        "owner": [],
        "entity_id": "2152",
        "entity_id_full": "sse/skill/2152",
        "entity_type": "skill",
        "contents": "\n\n\nThe Python dictionary id: 2152, nested_skills: [], parent_skills: ['Assistenzsysteme'], repository_id: 2, created_at: 2023-11-20T07:51:13.262Z, updated_at: 2023-11-20T07:51:13.262Z, name: Formen von Assistenzsystemen, level: 1, description: None contains the following key value pairs:\n\n- id: The id of the skill\n- nested_skills: A list of skills that are nested within this skill\n- parent_skills: A list of skills that this skill is a parent of\n- repository_id: The id of the repository that this skill belongs to\n- created_at: The date and time that this skill was created\n- updated_at: The date and time that this skill was last updated\n- name: The name of the skill\n- level: The level of the skill\n- description: A description of the skill",
        "created_at": "2023-11-13T14:23:11.352Z",
        "updated_at": "2023-11-20T07:51:13.262Z"
    },
    {
        "id": 2011,
        "owner": [],
        "entity_id": "2154",
        "entity_id_full": "sse/skill/2154",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill, including the skill's id number, the skills it is nested under, the skills that it is a parent of, the id number of the repository it is contained in, the date it was created and last updated, the skill's name, and its level within the skill hierarchy.",
        "created_at": "2023-11-13T14:23:11.354Z",
        "updated_at": "2023-11-20T07:51:13.264Z"
    },
    {
        "id": 1935,
        "owner": [],
        "entity_id": "2166",
        "entity_id_full": "sse/skill/2166",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, and repository_id. The value associated with the id key is 2166. The value associated with the nested_skills key is an empty list. The value associated with the parent_skills key is a list containing the string \"Sensorik\". The value associated with the repository_id key is 2. The value associated with the created_at key is a datetime object representing November 20, 2023 at 07:51:13.268 UTC. The value associated with the updated_at key is a datetime object representing November 20, 2023 at 07:51:13.268 UTC. The value associated with the name key is the string \"Analog-/Digital-Wandler\". The value associated with the level key is 1. The value associated with the description key is None.",
        "created_at": "2023-11-13T14:23:11.362Z",
        "updated_at": "2023-11-20T07:51:13.268Z"
    },
    {
        "id": 1843,
        "owner": [],
        "entity_id": "2182",
        "entity_id_full": "sse/skill/2182",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill. The id is the unique identifier for the skill, the nested_skills is a list of skills that are related to this skill, the parent_skills is a list of skills of which this skill is a sub-skill, the repository_id is the id of the repository in which this skill is stored, the created_at is the date and time at which this skill was created, the updated_at is the date and time at which this skill was updated, the name is the name of the skill, the level is the level of the skill, and the description is a description of the skill.",
        "created_at": "2023-11-13T14:23:11.372Z",
        "updated_at": "2023-11-20T07:51:13.273Z"
    },
    {
        "id": 1827,
        "owner": [],
        "entity_id": "2193",
        "entity_id_full": "sse/skill/2193",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n\n- id: 2193\n- nested_skills: []\n- parent_skills: ['Grundlagen innerbetrieblicher Materialfluss']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.275Z\n- updated_at: 2023-11-20T07:51:13.275Z\n- name: Schritte der Materialflusssimulation\n- level: 1\n- description: None\n\nThe id key contains the unique identifier for the dictionary, while the nested_skills key lists any skills that are contained within this skill (if any). The parent_skills key lists any skills that this skill is a child of, while the repository_id key indicates which repository this skill belongs to. The created_at and updated_at keys contain timestamps for when the skill was created and last updated, respectively. The name key contains the name of the skill, while the level key indicates the skill's level (e.g. 1, 2, 3, etc.). Finally, the description key contains a brief description of the skill",
        "created_at": "2023-11-13T14:23:11.377Z",
        "updated_at": "2023-11-20T07:51:13.275Z"
    },
    {
        "id": 1909,
        "owner": [],
        "entity_id": "2057",
        "entity_id_full": "sse/skill/2057",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill, including the skill's id number, name, level, and description. The nesting skills and Repository id keys identify other skills that this skill is related to, while the created_at and updated_at keys show when this skill was first created and last updated, respectively.",
        "created_at": "2023-11-13T14:23:11.303Z",
        "updated_at": "2023-11-20T07:51:13.211Z"
    },
    {
        "id": 1944,
        "owner": [],
        "entity_id": "2059",
        "entity_id_full": "sse/skill/2059",
        "entity_type": "skill",
        "contents": "\n\n\nThe Python dictionary contains the following key value pairs:\n- id: 2059\n- nested_skills: []\n- parent_skills: ['Grundlagen Produktionstechnik']\n- repository_id: 2\n- created_at: 2023-11-20T07:51:13.214Z\n- updated_at: 2023-11-20T07:51:13.214Z\n- name: Definition Cyber-physisches System\n- level: 1\n- description: None\n\nThe id key refers to the unique identifier of the skill, while the nested_skills key refers to any skills that are contained within this skill. The parent_skills key refers to any skills that this skill is a child of, while the repository_id key refers to the unique identifier of the repository that this skill belongs to. The created_at and updated_at keys refer to the date and time when the skill was created and last updated, respectively. The name key refers to the name of the skill, while the level key refers to the skill's level within the repository. Finally, the description key refers to a short description of the skill.",
        "created_at": "2023-11-13T14:23:11.305Z",
        "updated_at": "2023-11-20T07:51:13.214Z"
    },
    {
        "id": 1912,
        "owner": [],
        "entity_id": "2067",
        "entity_id_full": "sse/skill/2067",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a course titled \"Definition Speicherprogrammierbare Steuerungseinheiten\" including the course id, when it was created and last updated, its name, level, and description. The nested_skills and parent_skills keys are both empty lists. The repository_id key contains the id of the course's repository.",
        "created_at": "2023-11-13T14:23:11.310Z",
        "updated_at": "2023-11-20T07:51:13.221Z"
    },
    {
        "id": 1946,
        "owner": [],
        "entity_id": "2076",
        "entity_id_full": "sse/skill/2076",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a machine learning course. The id is the course's id number, the nested_skills list contains any skills that are required for the course, the parent_skills list contains any skills that are recommended for the course, the repository_id is the id number of the course's repository, created_at is the date when the course was created, updated_at is the date when the course was last updated, name is the name of the course, level is the course's level, and description is a brief description of the course.",
        "created_at": "2023-11-13T14:23:11.316Z",
        "updated_at": "2023-11-20T07:51:13.227Z"
    },
    {
        "id": 1815,
        "owner": [],
        "entity_id": "2082",
        "entity_id_full": "sse/skill/2082",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a skill called \"Methoden zur Datenanalyse\" (Methods for Data Analysis) with the ID 2082. It is a level 1 skill (out of a possible 5) and is part of the \"Big Data\" skill group. The dictionary also includes the date/time when the skill was created and last updated.",
        "created_at": "2023-11-13T14:23:11.319Z",
        "updated_at": "2023-11-20T07:51:13.232Z"
    },
    {
        "id": 1917,
        "owner": [],
        "entity_id": "2088",
        "entity_id_full": "sse/skill/2088",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a particular skill, including the skill's id number, name, level, and description. The skill may also have nested skills and parent skills, which are indicated in the corresponding lists. Finally, the repository_id refers to the id number of the skill's repository (where it is stored or categorized), and the created_at and updated_at fields give the dates when the skill was created and last updated, respectively.",
        "created_at": "2023-11-13T14:23:11.323Z",
        "updated_at": "2023-11-20T07:51:13.238Z"
    },
    {
        "id": 2003,
        "owner": [],
        "entity_id": "2104",
        "entity_id_full": "sse/skill/2104",
        "entity_type": "skill",
        "contents": "\n\n\nThe id is the unique identifier for this particular skill and is used to reference this skill in other areas of the program. The nested_skills is an empty list that will eventually contain other skills that are related to this skill. The parent_skills is a list containing the skills that this skill is related to. The repository_id is the id of the repository that this skill is associated with. The created_at and updated_at fields contain the date and time that this skill was created and last updated. The name field contains the name of this skill. The level field indicates the importance or difficulty of this skill. The description field contains a brief description of this skill.",
        "created_at": "2023-11-13T14:23:11.330Z",
        "updated_at": "2023-11-20T07:51:13.244Z"
    },
    {
        "id": 1835,
        "owner": [],
        "entity_id": "2110",
        "entity_id_full": "sse/skill/2110",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes information on a definition for the 5S-Methodde. The id is 2110, the nested_skills are empty, the parent_skills include 'Werkzeugkoffer 4.0', the repository_id is 2, the created_at is 2023-11-20T07:51:13.246Z, the updated_at is 2023-11-20T07:51:13.246Z, the name is 'Definition 5S-Methodde', the level is 1, and the description is 'None'.",
        "created_at": "2023-11-13T14:23:11.333Z",
        "updated_at": "2023-11-20T07:51:13.246Z"
    },
    {
        "id": 1836,
        "owner": [],
        "entity_id": "2120",
        "entity_id_full": "sse/skill/2120",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary consists of key value pairs that represent a skill. The id corresponds to the unique identifier for the skill, the nested_skills represents a list of skills that are related to this skill, the parent_skills represents a list of skills of which this skill is a child, the repository_id corresponds to the unique identifier of the repository to which this skill belongs, created_at represents the date and time when this skill was created, updated_at represents the date and time when this skill was updated, name represents the name of the skill, level represents the level of the skill, and description represents a description of the skill.",
        "created_at": "2023-11-13T14:23:11.337Z",
        "updated_at": "2023-11-20T07:51:13.249Z"
    },
    {
        "id": 1837,
        "owner": [],
        "entity_id": "2129",
        "entity_id_full": "sse/skill/2129",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains information about a skill called \"Vor- und Nachteile von Just-in-Time.\" The skill has an ID of 2129, and it is a level 1 skill. The dictionary also contains information about the skill's parent skills and nested skills. The skill was created on 2023-11-20T07:51:13.252Z and updated on 2023-11-20T07:51:13.252Z.",
        "created_at": "2023-11-13T14:23:11.340Z",
        "updated_at": "2023-11-20T07:51:13.252Z"
    },
    {
        "id": 1954,
        "owner": [],
        "entity_id": "2139",
        "entity_id_full": "sse/skill/2139",
        "entity_type": "skill",
        "contents": "\n\n\nThe id key has a value of 2139, which corresponds to the id of the skill. The nested_skills key has a value of an empty list, which means that this skill does not have any nested skills. The parent_skills key has a value of a list containing a single element, 'Fertigung 4.0', which indicates that this is a child skill of 'Fertigung 4.0'. The repository_id key has a value of 2, which corresponds to the id of the repository that this skill is stored in. The created_at key has a value of '2023-11-20T07:51:13.257Z', which is the date and time that this skill was created. The updated_at key has a value of '2023-11-20T07:51:13.257Z', which is the date and time that this skill was last updated. The name key has a value of 'Eigenschaften eines Lasers', which is the name of the skill. The level key has a value of 1, which corresponds to the level of the skill. The description key has a value of None, which indicates that no description has been provided for",
        "created_at": "2023-11-13T14:23:11.345Z",
        "updated_at": "2023-11-20T07:51:13.257Z"
    },
    {
        "id": 1840,
        "owner": [],
        "entity_id": "2149",
        "entity_id_full": "sse/skill/2149",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a skill called \"Produkt-Regeneration\" which is part of the parent skill \"Fertigung 4.0\". The skill has an ID of 2149, and was created on 2023-11-20T07:51:13.261Z. It was last updated on the same date. The skill has a level of 1 and does not have a description.",
        "created_at": "2023-11-13T14:23:11.351Z",
        "updated_at": "2023-11-20T07:51:13.261Z"
    },
    {
        "id": 2008,
        "owner": [],
        "entity_id": "2155",
        "entity_id_full": "sse/skill/2155",
        "entity_type": "skill",
        "contents": "\n\nThe following dictionary is a Python dictionary describing a particular skill. The dictionary has four key-value pairs, with the keys being \"id\", \"nested_skills\", \"parent_skills\", and \"repository_id\". The value associated with the key \"id\" is 2155, indicating the id number of the skill. The value associated with the key \"nested_skills\" is an empty list, indicating that there are no nested skills within this skill. The value associated with the key \"parent_skills\" is a list containing the single element \"Assistenzsysteme\", indicating that this skill is a sub-skill of the \"Assistenzsysteme\" skill. The value associated with the key \"repository_id\" is 2, indicating the id number of the repository in which this skill is stored. The value associated with the key \"created_at\" is 2023-11-20T07:51:13.264Z, indicating the date and time at which this skill was created. The value associated with the key \"updated_at\" is 2023-11-20T07:51:13.264Z, indicating the date and time at which this skill was last",
        "created_at": "2023-11-13T14:23:11.353Z",
        "updated_at": "2023-11-20T07:51:13.264Z"
    },
    {
        "id": 1888,
        "owner": [],
        "entity_id": "2172",
        "entity_id_full": "sse/skill/2172",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a particular skill, in this case 'Fahrerlose Transportsysteme'. The id refers to the unique identifier for this skill, nested_skills refers to any skills that fall under this one, parent_skills indicates any skills that this one falls under, repository_id is the id of the repository this skill is part of, created_at and updated_at are self-explanatory, name is the name of the skill, level is the level of the skill, and description contains a brief explanation of the skill.",
        "created_at": "2023-11-13T14:23:11.367Z",
        "updated_at": "2023-11-20T07:51:13.269Z"
    },
    {
        "id": 1939,
        "owner": [],
        "entity_id": "2183",
        "entity_id_full": "sse/skill/2183",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Definition Sensoren zur Längenvermessung.\" The skill has an ID of 2183, and it is a level 1 skill. The skill is part of the repository with an id of 2. The skill was created on November 20th, 2023 at 07:51:13 UTC, and updated at the same time. The skill has no parent skills and no nested skills. There is no description for the skill.",
        "created_at": "2023-11-13T14:23:11.372Z",
        "updated_at": "2023-11-20T07:51:13.273Z"
    },
    {
        "id": 1960,
        "owner": [],
        "entity_id": "2195",
        "entity_id_full": "sse/skill/2195",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a particular skill, in this case RFID. The id refers to the skills unique identifier, while nested_skills refers to any skills that fall under RFID, parent_skills represents any skills that RFID is a sub-skill of, repository_id is the unique identifier of the repository this skill belongs to, created_at and updated_at are the timestamps for when this skill was created and last updated, and finally, name is the human-readable name of the skill, while level refers to the skill's position in the repository's hierarchy, with 1 being the highest. Lastly, description is a brief description of the skill, if one exists.",
        "created_at": "2023-11-13T14:23:11.378Z",
        "updated_at": "2023-11-20T07:51:13.276Z"
    },
    {
        "id": 1828,
        "owner": [],
        "entity_id": "2201",
        "entity_id_full": "sse/skill/2201",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill called \"Risiken bei der Verwendung von RFID\" with the following properties:\n- The id of the skill is 2201.\n- The skill has no nested skills.\n- The skill's parent skills are RFID-related.\n- The skill's repository id is 2.\n- The skill was created on 2023-11-20T07:51:13.278Z.\n- The skill was last updated on 2023-11-20T07:51:13.278Z.\n- The level of the skill is 1.\n- The skill has no description.",
        "created_at": "2023-11-13T14:23:11.383Z",
        "updated_at": "2023-11-20T07:51:13.278Z"
    },
    {
        "id": 1987,
        "owner": [],
        "entity_id": "3003",
        "entity_id_full": "sse/skill/3003",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a course called \"Wandel des Medienkonsums\" (the change of media consumption). The course is at level 2 and the description is \"Wandel des Medienkonsums über die Zeit (Vereinzelung) verstehen\" (Understanding the change of media consumption over time (isolation)). The id is 3003, the repository_id is 3, and it was created_at on 2023-11-20T07:51:14.507Z and updated_at on 2023-11-20T07:51:14.507Z. The nested_skills are empty and the parent_skills are ['Menschen, Medien, Maschinen'] (People, Media, Machines).",
        "created_at": "2023-11-13T14:23:13.486Z",
        "updated_at": "2023-11-20T07:51:14.507Z"
    },
    {
        "id": 1962,
        "owner": [],
        "entity_id": "3010",
        "entity_id_full": "sse/skill/3010",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary contains the following key value pairs:\n\n- id: 3010\n- nested_skills: []\n- parent_skills: ['Auditives System']\n- repository_id: 3\n- created_at: 2023-11-20T07:51:15.033Z\n- updated_at: 2023-11-20T07:51:15.033Z\n- name: Bestandteile des menschlichen Ohres\n- level: 1\n- description: Bestandteile des menschlichen Ohres erinnern.\n\nThe id key contains the value 3010, which is the id of the skill.\n\nThe nested_skills key contains the value [], which is an empty list. This key is used to store skills that are sub-skills of the current skill.\n\nThe parent_skills key contains the value ['Auditives System'], which is a list containing the id of the parent skill.\n\nThe repository_id key contains the value 3, which is the id of the repository that the skill belongs to.\n\nThe created_at key contains the value 2023-11-20T",
        "created_at": "2023-11-13T14:23:13.984Z",
        "updated_at": "2023-11-20T07:51:15.033Z"
    },
    {
        "id": 1972,
        "owner": [],
        "entity_id": "3019",
        "entity_id_full": "sse/skill/3019",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a particular skill, including the skill's id number, its name, a description, its level, when it was created and updated, and finally its parent skills and nested skills. The skill's id number is 3019, its name is Gesellschaftliche Auswirkungen digitaler Medien, its level is 2, and its description is Gesellschaftliche Auswirkungen digitaler Medien erinnern verstehen. The skill was created on 2023-11-20T07:51:15.042Z and updated on 2023-11-20T07:51:15.042Z. Its parent skills are listed as ['Medien und Interaktion'], and it has no nested skills.",
        "created_at": "2023-11-13T14:23:13.990Z",
        "updated_at": "2023-11-20T07:51:15.042Z"
    },
    {
        "id": 1995,
        "owner": [],
        "entity_id": "3028",
        "entity_id_full": "sse/skill/3028",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs: id is 3028, nested_skills is an empty list, parent_skills is an empty list, repository_id is 3, created_at is 2023-11-20T07:51:15.048Z, updated_at is 2023-11-20T07:51:15.048Z, name is Mensch-Maschine-Kommunikation, level is 2, description is Grundlagen der Kommunikation zwischen Menschen und Maschine erinnern und verstehen.\n\nThe id key has a value of 3028, which is the identification number for this particular dictionary. The nested_skills key has an empty list as its value, which indicates that there are no skills nested within this skill. The parent_skills key also has an empty list as its value, which means that this skill does not have any parent skills. The repository_id key has a value of 3, which is the id number for the repository that this skill is stored in. The created_at key has a value of 2023-11-20T07:51:15.048Z,",
        "created_at": "2023-11-13T14:23:13.994Z",
        "updated_at": "2023-11-20T07:51:15.048Z"
    },
    {
        "id": 1961,
        "owner": [],
        "entity_id": "3004",
        "entity_id_full": "sse/skill/3004",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains four key value pairs. The first key is \"id\" and the value is \"3004\". The second key is \"nested_skills\" and the value is an empty list. The third key is \"parent_skills\" and the value is a list containing a single element, \"Menschen, Medien, Maschinen\". The fourth key is \"repository_id\" and the value is \"3\".",
        "created_at": "2023-11-13T14:23:13.485Z",
        "updated_at": "2023-11-20T07:51:14.507Z"
    },
    {
        "id": 1967,
        "owner": [],
        "entity_id": "3013",
        "entity_id_full": "sse/skill/3013",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary includes information on a particular skill, including the skill's id number, name, level, description, and when it was created and updated. The skill also has a list of parent skills and nested skills.",
        "created_at": "2023-11-13T14:23:13.986Z",
        "updated_at": "2023-11-20T07:51:15.036Z"
    },
    {
        "id": 1969,
        "owner": [],
        "entity_id": "3026",
        "entity_id_full": "sse/skill/3026",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a semiotic machine. The id is the unique identifier for the machine, the nested_skills and parent_skills are the skills needed to build the machine, the repository_id is the id of the machine's repository, the created_at and updated_at are the date and time when the machine was created and updated, the name is the name of the machine, the level is the machine's level, and the description is a brief description of the machine.",
        "created_at": "2023-11-13T14:23:13.994Z",
        "updated_at": "2023-11-20T07:51:15.045Z"
    },
    {
        "id": 1986,
        "owner": [],
        "entity_id": "3029",
        "entity_id_full": "sse/skill/3029",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Qualität, Usability und User Experience.\" The skill has an ID of 3029, is level 2, and has no parent or nested skills. The skill was created on 2023-11-20 and last updated on the same day. The skill's description is in German and translates to \"Terms of quality, usability and user experience, and their relationships to each other.\"",
        "created_at": "2023-11-13T14:23:13.994Z",
        "updated_at": "2023-11-20T07:51:15.048Z"
    },
    {
        "id": 1974,
        "owner": [],
        "entity_id": "3501",
        "entity_id_full": "sse/skill/3501",
        "entity_type": "skill",
        "contents": "\n\nid: 3501 - This is the id number for the item\nnested_skills: ['Wandel des Medienkonsums', 'Auswirkungen der Digitalisierung', 'Änderungen des Mediencharakters', 'Medienkonvergenz', 'Interdisziplinarität der Medieninformatik'] - This is a list of skills that are related to the item\nparent_skills: [] - This is a list of skills that the item is related to\nrepository_id: 3 - This is the id number for the repository that the item is from\ncreated_at: 2023-11-20T07:51:15.471Z - This is the date that the item was created\nupdated_at: 2023-11-20T07:51:15.471Z - This is the date that the item was updated\nname: Menschen, Medien, Maschinen - This is the name of the item\nlevel: 1 - This is the level of the item\ndescription: - This is the description of the item",
        "created_at": "2023-11-13T14:23:14.057Z",
        "updated_at": "2023-11-20T07:51:15.471Z"
    },
    {
        "id": 1975,
        "owner": [],
        "entity_id": "3502",
        "entity_id_full": "sse/skill/3502",
        "entity_type": "skill",
        "contents": "\n\nThe id is 3502, the nested_skills are ['Gesetze der Gestaltpsychologie', 'Sehzellen im menschlichen Auge'], the parent_skills are [], the repository_id is 3, the created_at is 2023-11-20T07:51:15.499Z, the updated_at is 2023-11-20T07:51:15.499Z, the name is Visuelles System, the level is 1, and the description is .\n\nThe id is the unique identifier for this particular skill, nested_skills are any skills that fall under this one, parent_skills are any skills that this one falls under, repository_id is the id of the repository this skill is in, created_at is the date and time this skill was created, updated_at is the date and time this skill was last updated, name is the name of the skill, level is the level of the skill, and description is a description of the skill.",
        "created_at": "2023-11-13T14:23:14.074Z",
        "updated_at": "2023-11-20T07:51:15.499Z"
    },
    {
        "id": 1976,
        "owner": [],
        "entity_id": "3503",
        "entity_id_full": "sse/skill/3503",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has four key value pairs. The first key is \"id\" and the value is \"3503\". The second key is \"nested_skills\" and the value is a list of three items: \"Bestandteile des menschlichen Ohres\", \"Eigenschaften des auditiven Systems\", and \"Wissensbasiertes Hören\". The third key is \"parent_skills\" and the value is an empty list. The fourth key is \"repository_id\" and the value is \"3\". The dictionary represents a skill called \"Auditives System\" and contains information about the skill's id, nested skills, repository id, and level.",
        "created_at": "2023-11-13T14:23:14.080Z",
        "updated_at": "2023-11-20T07:51:15.506Z"
    },
    {
        "id": 1977,
        "owner": [],
        "entity_id": "3504",
        "entity_id_full": "sse/skill/3504",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary represents the skill \"Gedächtnis\" (memory) in the German educational system. The Repository ID (3) indicates that this skill is part of the national repository of skills. The skill has one sub-skill (\"Verarbeitung von Reizen im Gehin\" or \"processing of stimuli during walking\") and two parent skills (\"Speicherbedarf des menschlichen Erleben\" or \"memory requirements of human experience\", and \"Erkennen und Abrufen von Information\" or \"recognition and retrieval of information\"). The skill was created on 2023-11-20T07:51:15.512Z and last updated on the same date.",
        "created_at": "2023-11-13T14:23:14.085Z",
        "updated_at": "2023-11-20T07:51:15.512Z"
    },
    {
        "id": 1978,
        "owner": [],
        "entity_id": "3505",
        "entity_id_full": "sse/skill/3505",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a motor skill. The id key contains a unique identifier for the skill, while the nested_skills key contains a list of sub-skills related to the motor skill. The parent_skills key contains a list of skills that the motor skill is related to, while the repository_id key contains the id of the repository where the skill is stored. The created_at and updated_at keys contain timestamps for when the skill was created and updated, respectively. The name key contains the name of the motor skill, while the level key contains the skill's level of difficulty. Finally, the description key contains a description of the motor skill.",
        "created_at": "2023-11-13T14:23:14.089Z",
        "updated_at": "2023-11-20T07:51:15.533Z"
    },
    {
        "id": 1979,
        "owner": [],
        "entity_id": "3506",
        "entity_id_full": "sse/skill/3506",
        "entity_type": "skill",
        "contents": "\n\nThe given dictionary represents a skill called \"Medien und Interaktion\" with the id 3506. This skill has five nested skills, which are listed in the \"nested_skills\" key. These nested skills are \"Gesellschaftliche Auswirkungen digitaler Medien\", \"Interaktion zweier Akteure\", \"Digitale Entsprechungen\", \"Computer als Akteur\", and \"Qualitäten digitaler Entsprechungen\". The \"parent_skills\" key is an empty list, because this skill has no parent skills. The \"repository_id\" key is 3, because this skill belongs to the third repository. The \"created_at\" and \"updated_at\" keys represent the date and time when this skill was created and updated, respectively. The \"name\" key represents the name of the skill, and the \"level\" key represents the level of the skill. The \"description\" key is empty.",
        "created_at": "2023-11-13T14:23:14.094Z",
        "updated_at": "2023-11-20T07:51:15.537Z"
    },
    {
        "id": 1981,
        "owner": [],
        "entity_id": "3508",
        "entity_id_full": "sse/skill/3508",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary consists of key value pairs that describe a particular skill. The id key corresponds to the unique identifier for the skill, while the nested_skills key corresponds to a list of skills that are related to the main skill. The parent_skills key corresponds to a list of skills that the main skill is derived from, while the repository_id key corresponds to the unique identifier for the repository that the skill is stored in. The created_at key corresponds to the date and time when the skill was created, while the updated_at key corresponds to the date and time when the skill was last updated. The name key corresponds to the name of the skill, while the level key corresponds to the level of difficulty of the skill. The description key corresponds to a description of the skill.",
        "created_at": "2023-11-13T14:23:14.103Z",
        "updated_at": "2023-11-20T07:51:15.547Z"
    },
    {
        "id": 1970,
        "owner": [],
        "entity_id": "3008",
        "entity_id_full": "sse/skill/3008",
        "entity_type": "skill",
        "contents": "\n\n\nThe given dictionary contains information about a skill called \"Gesetze der Gestaltpsychologie\" which is part of the parent skill \"Visuelles System\". The skill has a level of 2 and a description. The dictionary also contains information about when the skill was created and updated.",
        "created_at": "2023-11-13T14:23:13.756Z",
        "updated_at": "2023-11-20T07:51:14.803Z"
    },
    {
        "id": 1971,
        "owner": [],
        "entity_id": "3015",
        "entity_id_full": "sse/skill/3015",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs:\n- id: 3015\n- nested_skills: []\n- parent_skills: ['Gedächtnis']\n- repository_id: 3\n- created_at: 2023-11-20T07:51:15.038Z\n- updated_at: 2023-11-20T07:51:15.038Z\n- name: Speicherbedarf des menschlichen Erleben\n- level: 2\n- description: Speicherbedarf für die menschliches Erleben (Lesen, Hören und Sehen) einordnen und verstehen\n\nThe id key has a value of 3015, which is the unique identifier for this particular dictionary. The nested_skills key has a value of [], which indicates that there are no nested skills within this dictionary. The parent_skills key has a value of ['Gedächtnis'], which means that the skill of memory is a parent skill of the skill in this dictionary. The repository_id key has a value of 3, which is the identification number for the repository where this",
        "created_at": "2023-11-13T14:23:13.988Z",
        "updated_at": "2023-11-20T07:51:15.038Z"
    },
    {
        "id": 1991,
        "owner": [],
        "entity_id": "3020",
        "entity_id_full": "sse/skill/3020",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary consists of key-value pairs that store information about a particular skill. The key \"id\" refers to the unique identifier of the skill, while the key \"nested_skills\" refers to a list of skills that are related to this skill. The key \"parent_skills\" refers to a list of skills that this skill is a part of. The key \"repository_id\" refers to the unique identifier of the repository that this skill is stored in. The key \"created_at\" refers to the date and time when this skill was created. The key \"updated_at\" refers to the date and time when this skill was last updated. The key \"name\" refers to the name of the skill. The key \"level\" refers to the level of the skill. The key \"description\" refers to a brief description of the skill.",
        "created_at": "2023-11-13T14:23:13.991Z",
        "updated_at": "2023-11-20T07:51:15.042Z"
    },
    {
        "id": 1996,
        "owner": [],
        "entity_id": "3006",
        "entity_id_full": "sse/skill/3006",
        "entity_type": "skill",
        "contents": "\n\nThe following Python dictionary contains information about a class on the role of human senses in media informatics. The id indicates the class's ID number, while nested_skills and parent_skills show what other skills are necessary for this class. Repository_id refers to the ID number of the class's associated repository, and created_at/updated_at show when the class was first created and last updated. Finally, name indicates the class's name and level represents its difficulty.",
        "created_at": "2023-11-13T14:23:13.747Z",
        "updated_at": "2023-11-20T07:51:14.790Z"
    },
    {
        "id": 1988,
        "owner": [],
        "entity_id": "3016",
        "entity_id_full": "sse/skill/3016",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary describes a skill called \"Motorische Schnittstellen\" with the ID 3016. The skill has no sub-skills (nested_skills), and the parent skill is \"Motorisches System\". The skill was created on 2023-11-20T07:51:15.039Z and last updated on 2023-11-20T07:51:15.039Z. The skill is at level 1 and the description is \"Motorische Schnittstellen interaktiver Medien und Werkzeuge erinnern\".",
        "created_at": "2023-11-13T14:23:13.988Z",
        "updated_at": "2023-11-20T07:51:15.039Z"
    },
    {
        "id": 1985,
        "owner": [],
        "entity_id": "3024",
        "entity_id_full": "sse/skill/3024",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary describes a course in media theory at a university. The id is the unique identifier for the course, the nested_skills and parent_skills are lists of skills related to the course, the repository_id is the id of the repository where the course is stored, the created_at and updated_at are the dates when the course was created and updated, respectively, the name is the name of the course, the level is the level of the course, and the description is a description of the course.",
        "created_at": "2023-11-13T14:23:13.993Z",
        "updated_at": "2023-11-20T07:51:15.044Z"
    },
    {
        "id": 1990,
        "owner": [],
        "entity_id": "3007",
        "entity_id_full": "sse/skill/3007",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary includes information on a particular skill, including the skill's id number, name, level, description, and when it was created and updated. It also lists the skill's parent skills and any nested skills it has.",
        "created_at": "2023-11-13T14:23:13.749Z",
        "updated_at": "2023-11-20T07:51:14.794Z"
    },
    {
        "id": 1983,
        "owner": [],
        "entity_id": "3014",
        "entity_id_full": "sse/skill/3014",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary includes the following key value pairs: id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, and description. The id key has a value of 3014, the nested_skills key has a value of an empty list, the parent_skills key has a value of a list containing the string \"Gedächtnis\", the repository_id key has a value of 3, the created_at key has a value of the date 2023-11-20T07:51:15.037Z, the updated_at key has a value of the date 2023-11-20T07:51:15.037Z, the name key has a value of the string \"Erkennen und Abrufen von Information\", the level key has a value of 2, and the description key has a value of the string \"Unterschied zwischen Erkennen und Abrufen von Information zu verstehen\".",
        "created_at": "2023-11-13T14:23:13.987Z",
        "updated_at": "2023-11-20T07:51:15.037Z"
    },
    {
        "id": 1973,
        "owner": [],
        "entity_id": "3025",
        "entity_id_full": "sse/skill/3025",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary represents a unit of study in a class on known media theorists and their work. The id key is the unique identifier for this unit, nested_skills refers to any required skills that are needed to complete this unit, parent_skills lists any prerequisite units, repository_id is the unique identifier for the class, created_at and updated_at are the dates when this unit was first created and last updated, name is the name of the unit, level is the difficulty level of the unit, and description is a brief summary of the unit.",
        "created_at": "2023-11-13T14:23:13.993Z",
        "updated_at": "2023-11-20T07:51:15.044Z"
    },
    {
        "id": 1993,
        "owner": [],
        "entity_id": "3001",
        "entity_id_full": "sse/skill/3001",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a named skill, Änderungen des Mediencharakters. The skill has an id of 3001, and is stored in repository 3. The skill was created on 2023-11-20T07:51:14.507Z, and last updated on the same date and time. Änderungen des Mediencharakters is a level 1 skill, and its description is Grundlegende Änderungen in der Produktion, Distribution und Konsumption von Medien erinnern. The skill has no nested skills, but one parent skill, Menschen, Medien, Maschinen.",
        "created_at": "2023-11-13T14:23:13.485Z",
        "updated_at": "2023-11-20T07:51:14.507Z"
    },
    {
        "id": 1984,
        "owner": [],
        "entity_id": "3017",
        "entity_id_full": "sse/skill/3017",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill called \"Motorik als Fehlerursache\" which is a part of the \"Motorisches System\" skill. The skill has a level of 2 and a description of \"Motorik als Ursache für mögliche Fehler in Computersystemen erinnern und verstehen\". The skill was created on 2023-11-20T07:51:15.040Z and updated on 2023-11-20T07:51:15.040Z.",
        "created_at": "2023-11-13T14:23:13.989Z",
        "updated_at": "2023-11-20T07:51:15.040Z"
    },
    {
        "id": 1994,
        "owner": [],
        "entity_id": "3022",
        "entity_id_full": "sse/skill/3022",
        "entity_type": "skill",
        "contents": "\n\nThis dictionary contains information about a particular skill. The 'id' key corresponds to the unique identifier for this skill, while the 'nested_skills' key indicates any skills that fall under this one. The 'parent_skills' key lists any skills that this one is a sub-skill of, while the 'repository_id' key corresponds to the unique identifier for the skill repository that this skill is part of. The 'created_at' and 'updated_at' keys indicate when this skill was first created and last updated, respectively. Finally, the 'name' key corresponds to the name of this skill, while the 'level' key indicates the difficulty level of the skill. The 'description' key provides a brief description of the skill.",
        "created_at": "2023-11-13T14:23:13.992Z",
        "updated_at": "2023-11-20T07:51:15.043Z"
    },
    {
        "id": 1965,
        "owner": [],
        "entity_id": "3002",
        "entity_id_full": "sse/skill/3002",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill called \"Medienkonvergenz\" which is level 2 and has the description \"Begriff der Medienkonvergenz erinnern und verstehen\". The id is 3002, it has no nested skills, and its parent skills are [\"Menschen, Medien, Maschinen\"]. The repository_id is 3 and it was created and updated at 2023-11-20T07:51:14.510Z.",
        "created_at": "2023-11-13T14:23:13.486Z",
        "updated_at": "2023-11-20T07:51:14.510Z"
    },
    {
        "id": 1968,
        "owner": [],
        "entity_id": "3018",
        "entity_id_full": "sse/skill/3018",
        "entity_type": "skill",
        "contents": "\n\nThe key value pairs in this dictionary include the id, nested_skills, parent_skills, repository_id, created_at, updated_at, name, level, and description. The id is the unique identifier for this skill, the nested_skills is a list of skills that are associated with this skill, the parent_skills is a list of skills that this skill is associated with, the repository_id is the id of the repository that this skill is associated with, the created_at is the date and time that this skill was created, the updated_at is the date and time that this skill was last updated, the name is the name of this skill, the level is the level of this skill, and the description is a description of this skill.",
        "created_at": "2023-11-13T14:23:13.990Z",
        "updated_at": "2023-11-20T07:51:15.041Z"
    },
    {
        "id": 1992,
        "owner": [],
        "entity_id": "3027",
        "entity_id_full": "sse/skill/3027",
        "entity_type": "skill",
        "contents": "\n\n\nThe id key in the dictionary refers to the unique identifier assigned to the Semiotik object. The nested_skills key indicates any skills that are included under the Semiotik skill, while the parent_skills key notes any skills that the Semiotik skill is included under. The repository_id key specifies the repository that the Semiotik skill is part of, while the created_at and updated_at keys provide timestamps for when the Semiotik skill was first created and last updated, respectively. Finally, the name key corresponds to the name of the Semiotik skill, and the level key corresponds to the skill's level within the overall skill hierarchy. The description key provides a brief description of the Semiotik skill.",
        "created_at": "2023-11-13T14:23:13.995Z",
        "updated_at": "2023-11-20T07:51:15.046Z"
    },
    {
        "id": 1997,
        "owner": [],
        "entity_id": "3009",
        "entity_id_full": "sse/skill/3009",
        "entity_type": "skill",
        "contents": "\n\nThe Python dictionary has the following key value pairs:\n\n- id: 3009\n- nested_skills: []\n- parent_skills: ['Auditives System']\n- repository_id: 3\n- created_at: 2023-11-20T07:51:14.864Z\n- updated_at: 2023-11-20T07:51:14.864Z\n- name: Eigenschaften des auditiven Systems\n- level: 1\n- description: Eigenschaften des auditiven Systems wie die räumliche und zeitliche Auflösung erinnern.\n\nThe id key value pair represents the unique identifier for the skill. The nested_skills key value pair is an empty list that represents skills that are sub-skills of the current skill. The parent_skills key value pair represents a list of skills that the current skill is a sub-skill of. The repository_id key value pair represents the unique identifier of the repository that the skill belongs to. The created_at key value pair represents the date and time that the skill was created. The updated_at key value pair represents the date and time that",
        "created_at": "2023-11-13T14:23:13.762Z",
        "updated_at": "2023-11-20T07:51:14.864Z"
    },
    {
        "id": 1966,
        "owner": [],
        "entity_id": "3012",
        "entity_id_full": "sse/skill/3012",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains data on a skill called \"Rolle der Berührungswahrnehmung\" which is a level 1 skill with no parent or child skills. It was created on 2023-11-20T07:51:15.035Z and last updated on the same date. The skill's description is \"Anwendungsgebiete der Berührungswahrnehmung in Informatiksystemen erinnern\".",
        "created_at": "2023-11-13T14:23:13.985Z",
        "updated_at": "2023-11-20T07:51:15.035Z"
    },
    {
        "id": 1964,
        "owner": [],
        "entity_id": "3021",
        "entity_id_full": "sse/skill/3021",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Computer als Akteur\". The skill has an id of 3021, and is a level 2 skill. The skill is part of the parent skill \"Medien und Interaktion\". The skill was created on 2023-11-20T07:51:15.043Z and updated on 2023-11-20T07:51:15.043Z.",
        "created_at": "2023-11-13T14:23:13.991Z",
        "updated_at": "2023-11-20T07:51:15.043Z"
    },
    {
        "id": 1982,
        "owner": [],
        "entity_id": "3005",
        "entity_id_full": "sse/skill/3005",
        "entity_type": "skill",
        "contents": "\n\nThe following dictionary contains information on a particular skill. The 'id' key corresponds to the unique identifier for this skill, 'nested_skills' is an empty list because this skill has no child skills, 'parent_skills' contains a list of this skill's parent skills, 'repository_id' corresponds to the unique identifier of the repository this skill is stored in, 'created_at' and 'updated_at' are timestamps for when this skill was created and last updated, 'name' is the name of the skill, 'level' corresponds to the skill's level within the repository, and 'description' contains a description of the skill.",
        "created_at": "2023-11-13T14:23:13.487Z",
        "updated_at": "2023-11-20T07:51:14.509Z"
    },
    {
        "id": 1963,
        "owner": [],
        "entity_id": "3011",
        "entity_id_full": "sse/skill/3011",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary describes a skill called \"Wissensbasiertes Hören\" which is at level 2. The skill has no nested skills and one parent skill called \"Auditives System\". The skill was created on 2023-11-20T07:51:15.034Z and updated on the same date.",
        "created_at": "2023-11-13T14:23:13.985Z",
        "updated_at": "2023-11-20T07:51:15.034Z"
    },
    {
        "id": 1989,
        "owner": [],
        "entity_id": "3023",
        "entity_id_full": "sse/skill/3023",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a skill called \"Qualitäten digitaler Entsprechungen\" with the ID 3023.\nThe skill has no nested skills and one parent skill called \"Medien und Interaktion\".\nThe skill is stored in repository 3 and was created on 2023-11-20T07:51:15.044Z.\nThe skill was last updated on 2023-11-20T07:51:15.044Z.\nThe skill is at level 1 and has the description \"Qualitäten digitaler Entsprechungen erinnern\".",
        "created_at": "2023-11-13T14:23:13.992Z",
        "updated_at": "2023-11-20T07:51:15.044Z"
    },
    {
        "id": 1808,
        "owner": [],
        "entity_id": "2050",
        "entity_id_full": "sse/skill/2050",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary contains information about a particular skill, in this case virtuelle realität (virtual reality). The id indicates the unique identifier for the skill, while the nested_skills and parent_skills keys store lists of skills related to virtuelle realität. The repository_id points to the location of the skill's information in a database, while the created_at and updated_at timestamps show when the skill was first created and last updated, respectively. Finally, the name and level keys store the skill's name and difficulty level, while the description key contains a brief description of the skill.",
        "created_at": "2023-11-13T14:23:11.297Z",
        "updated_at": "2023-11-20T07:51:13.205Z"
    },
    {
        "id": 1945,
        "owner": [],
        "entity_id": "2063",
        "entity_id_full": "sse/skill/2063",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four key value pairs. The first key is \"id\" and the value is 2063. This is the unique identifier for the dictionary. The second key is \"nested_skills\" and the value is an empty list. This indicates that there are no nested skills within this dictionary. The third key is \"parent_skills\" and the value is a list with one element, \"Grundlagen Produktionstechnik\". This indicates that the skill \"Arten von Sensoren\" is a child skill of \"Grundlagen Produktionstechnik\". The fourth key is \"repository_id\" and the value is 2. This indicates that the skill is stored in the second repository. The fifth key is \"created_at\" and the value is \"2023-11-20T07:51:13.217Z\". This indicates when the skill was created. The sixth key is \"updated_at\" and the value is \"2023-11-20T07:51:13.217Z\". This indicates when the skill was last updated. The seventh key is \"name\" and the value is \"Arten von Sensoren\". This is the name of",
        "created_at": "2023-11-13T14:23:11.307Z",
        "updated_at": "2023-11-20T07:51:13.217Z"
    },
    {
        "id": 1877,
        "owner": [],
        "entity_id": "2070",
        "entity_id_full": "sse/skill/2070",
        "entity_type": "skill",
        "contents": "\n\n\nThe following Python dictionary contains information on a skill called \"Digitale Abbildungen.\" The skill has an id of 2070, and was created on November 20th, 2023. The skill is at level 1 and has no description. The skill has no nested skills, but is under the parent skill \"Grundlagen Produktionstechnik.\" The repository_id is 2 and it was last updated on November 20th, 2023.",
        "created_at": "2023-11-13T14:23:11.312Z",
        "updated_at": "2023-11-20T07:51:13.223Z"
    },
    {
        "id": 2001,
        "owner": [],
        "entity_id": "2084",
        "entity_id_full": "sse/skill/2084",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four key value pairs. The first pair is the id and the value is 2084. The second pair is the nested_skills and the value is an empty list. The third pair is the parent_skills and the value is a list that contains the string \"Big Data\". The fourth pair is the repository_id and the value is 2.",
        "created_at": "2023-11-13T14:23:11.320Z",
        "updated_at": "2023-11-20T07:51:13.234Z"
    },
    {
        "id": 2002,
        "owner": [],
        "entity_id": "2095",
        "entity_id_full": "sse/skill/2095",
        "entity_type": "skill",
        "contents": "\n\n\nThe id key value pair refers to the id number associated with the ERP introduction skill. The nested_skills key value pair shows that this skill does not have any nested skills associated with it. The parent_skills key value pair indicates that the ERP introduction skill is a child skill of the \"Produktionsplanung und -steuerung\" skill. The repository_id key value pair refers to the id number of the repository in which this skill is stored. The created_at key value pair indicates when this skill was created. The updated_at key value pair shows when this skill was last updated. The name key value pair indicates the name of the skill, which is \"Einführung in ERP\" in this case. The level key value pair tells us that this skill is a level 1 skill. The description key value pair contains a brief description of the skill, but in this case it is left blank.",
        "created_at": "2023-11-13T14:23:11.326Z",
        "updated_at": "2023-11-20T07:51:13.241Z"
    },
    {
        "id": 1834,
        "owner": [],
        "entity_id": "2101",
        "entity_id_full": "sse/skill/2101",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary has four keys: id, nested_skills, parent_skills, repository_id.\n\nThe id key has a value of 2101. This is the unique identifier for this particular skill.\n\nThe nested_skills key has a value of an empty list. This indicates that there are no skills nested within this skill.\n\nThe parent_skills key has a value of a list containing a single element: 'Produktionsplanung und -steuerung'. This indicates that this skill is a child skill of 'Produktionsplanung und -steuerung'.\n\nThe repository_id key has a value of 2. This indicates that this skill is part of repository 2.\n\nThe created_at key has a value of '2023-11-20T07:51:13.243Z'. This is the date and time at which this skill was created.\n\nThe updated_at key has a value of '2023-11-20T07:51:13.243Z'. This is the date and time at which this skill was last updated.\n\nThe name key has a value of 'Einführung von Softwaresystemen'.",
        "created_at": "2023-11-13T14:23:11.328Z",
        "updated_at": "2023-11-20T07:51:13.243Z"
    },
    {
        "id": 1864,
        "owner": [],
        "entity_id": "2107",
        "entity_id_full": "sse/skill/2107",
        "entity_type": "skill",
        "contents": "\n\nThe following Python dictionary contains information on a particular skill. The 'id' key corresponds to the unique identifier for the skill, while the 'nested_skills' key contains a list of skills that are sub-skills of the main skill. The 'parent_skills' key contains a list of skills of which the main skill is a sub-skill. The 'repository_id' key corresponds to the identifier for the skill repository in which the skill is stored. The 'created_at' key contains the date and time at which the skill was created, and the 'updated_at' key contains the date and time at which the skill was last updated. The 'name' key corresponds to the name of the skill, while the 'level' key corresponds to the level of the skill. Finally, the 'description' key contains a description of the skill.",
        "created_at": "2023-11-13T14:23:11.331Z",
        "updated_at": "2023-11-20T07:51:13.245Z"
    },
    {
        "id": 2005,
        "owner": [],
        "entity_id": "2123",
        "entity_id_full": "sse/skill/2123",
        "entity_type": "skill",
        "contents": "\n\nThe positions dictionary represents a Skill and contains information about the Skill's id, nested skills, parent skills, repository id, creation date, update date, name, level, and description. The Skill's id is 2123, it has no nested skills, its parent skills are 'Werkzeugkoffer 4.0', its repository id is 2, it was created on 2023-11-20T07:51:13.250Z, it was last updated on 2023-11-20T07:51:13.250Z, its name is 'Definition Poka Yoke', its level is 1, and it has no description.",
        "created_at": "2023-11-13T14:23:11.338Z",
        "updated_at": "2023-11-20T07:51:13.250Z"
    },
    {
        "id": 1926,
        "owner": [],
        "entity_id": "2128",
        "entity_id_full": "sse/skill/2128",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a particular skill, including the skill's id number, name, level, and description. The skill may have nested skills (skills that fall under it) and parent skills (skills that it falls under). The repository_id indicates which repository the skill is found in, and the created_at and updated_at values give the dates when the skill was created and last updated.",
        "created_at": "2023-11-13T14:23:11.340Z",
        "updated_at": "2023-11-20T07:51:13.252Z"
    },
    {
        "id": 1821,
        "owner": [],
        "entity_id": "2134",
        "entity_id_full": "sse/skill/2134",
        "entity_type": "skill",
        "contents": "\n\n\nThe dictionary represents a skill called \"Definition Spaghetti-Diagramm\" with an id of 2134. It was created on 2023-11-20T07:51:13.254Z and updated on the same date. The skill has a level of 1 and no description. It is not nested within any other skills and its parent skill is \"Werkzeugkoffer 4.0\".",
        "created_at": "2023-11-13T14:23:11.343Z",
        "updated_at": "2023-11-20T07:51:13.254Z"
    },
    {
        "id": 1929,
        "owner": [],
        "entity_id": "2147",
        "entity_id_full": "sse/skill/2147",
        "entity_type": "skill",
        "contents": "\n\nThe given dictionary represents a single skill in a larger skills tree. The skill's id is 2147, it has no nested skills, and its parent skills are 'Fertigung 4.0'. The skill was created on 2023-11-20T07:51:13.261Z and last updated on the same date and time. The skill's name is 'Prozesskette der additiven Fertigung' and it is a level 1 skill with no description.",
        "created_at": "2023-11-13T14:23:11.350Z",
        "updated_at": "2023-11-20T07:51:13.261Z"
    },
    {
        "id": 1886,
        "owner": [],
        "entity_id": "2153",
        "entity_id_full": "sse/skill/2153",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill, including the skill's id number, name, level, description, and when it was created and updated. The nested_skills and parent_skills keys are both empty lists, which likely means that this skill does not have any child or parent skills. The repository_id key refers to the id number of the repository that this skill belongs to.",
        "created_at": "2023-11-13T14:23:11.353Z",
        "updated_at": "2023-11-20T07:51:13.263Z"
    },
    {
        "id": 1841,
        "owner": [],
        "entity_id": "2165",
        "entity_id_full": "sse/skill/2165",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a skill called \"Analoge und digitale Signale\" which is a part of the \"Sensorik\" parent skill. The skill has a level of 1 and was created on 2023-11-20T07:51:13.268Z. The skill was last updated on 2023-11-20T07:51:13.268Z.",
        "created_at": "2023-11-13T14:23:11.361Z",
        "updated_at": "2023-11-20T07:51:13.268Z"
    },
    {
        "id": 1842,
        "owner": [],
        "entity_id": "2174",
        "entity_id_full": "sse/skill/2174",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information about a specific skill. The id indicates the skill's id number, while the nested_skills key contains a list of skills that are related to this skill. The parent_skills key contains a list of skills that this skill is a subset of. The repository_id indicates the id number of the repository that this skill is stored in, while the created_at key contains the date and time when the skill was created. The updated_at key contains the date and time when the skill was last updated. The name key contains the skill's name, while the level key indicates the skill's level of difficulty. The description key contains a brief description of the skill.",
        "created_at": "2023-11-13T14:23:11.368Z",
        "updated_at": "2023-11-20T07:51:13.270Z"
    },
    {
        "id": 1873,
        "owner": [],
        "entity_id": "2190",
        "entity_id_full": "sse/skill/2190",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary contains information on a skillset named \"Simulationsmodelle\". The skillset has an ID of 2190, no nested skills, and the parent skillset is \"Grundlagen innerbetrieblicher Materialfluss\". The skillset is located in repository 2 and the date it was created and last updated is given. Finally, the skillset is given a level of 1 and no description.",
        "created_at": "2023-11-13T14:23:11.375Z",
        "updated_at": "2023-11-20T07:51:13.275Z"
    },
    {
        "id": 1908,
        "owner": [],
        "entity_id": "2199",
        "entity_id_full": "sse/skill/2199",
        "entity_type": "skill",
        "contents": "\n\nThe dictionary represents a RFID tag with the id 2199. The nested_skills key refers to a list of skills that this tag has, while the parent_skills key refers to the skills of the tag's parent. The repository_id key indicates the id of the repository in which this tag is stored, while the created_at and updated_at keys represent the date and time when this tag was created and updated, respectively. The name key represents the name of this tag, while the level key represents the level of this tag in the RFID tag hierarchy. Finally, the description key represents a description of this tag.",
        "created_at": "2023-11-13T14:23:11.381Z",
        "updated_at": "2023-11-20T07:51:13.277Z"
    }
]